{
  "ticker": "DHR",
  "cik": "0000313616",
  "company_name": "DANAHER CORP /DE/",
  "filing_date": "2025-02-20",
  "accession": "0000313616-25-000043",
  "primary_doc": "dhr-20241231.htm",
  "item1_text": "Item 1. Business—Competition” for additional details.  In order to compete effectively, we must retain longstanding relationships with major customers and continue to grow our business by establishing relationships with new customers, continually developing new products and services to maintain and expand our brand recognition and leadership position in various product and service categories and penetrating new markets, including high-growth markets.  Our ability to compete can also be impacted by changing customer preferences and requirements (for example increased demand for products incorporating digital capabilities or more environmentally-friendly products and supplier practices) as well as changes in the way healthcare services are delivered (including the movement of some care from acute to non-acute settings and increased focus on chronic disease management).  Cost containment efforts by governments and the private sector, particularly in the healthcare industry, are also resulting in increased emphasis on products that reduce costs and improve efficiency and effectiveness.  In addition, significant shifts in industry market share have occurred and may in the future occur in connection with product problems, safety alerts and publications about products, reflecting the competitive significance of product quality, product efficacy and quality systems in our industry.  Our failure to compete effectively and/or pricing pressures resulting from competition may adversely impact our business and financial statements, and our expansion into new markets may result in greater-than-expected risks, liabilities and expenses.  In addition, the Company’s competitors and customers have from time to time introduced, and may in the future introduce, private label, generic or low-cost products that compete with the Company’s products at lower price points.  New, disruptive technologies may also emerge and displace the Company’s existing technologies resulting in an adverse effect on the Company’s business and financial statements.\nOur growth depends in part on the timely development and commercialization, and customer acceptance, of new and enhanced products and services based on technological innovation.\nWe generally sell our products and services in industries that are characterized by rapid technological changes, frequent new product introductions and changing industry standards.  If we do not develop innovative new and enhanced products and services on a timely basis, our offerings will become obsolete over time and our business and financial statements will suffer.  Our success depends on several factors, including our ability to:\n•\ncorrectly identify customer needs and preferences and predict future needs and preferences;\n•\nallocate our R&D funding to products and services with higher growth prospects;\n•\nanticipate and respond to our competitors’ development of new products and services and technological innovations;\n•\ndifferentiate our offerings from our competitors’ offerings and avoid commoditization;\n•\ninnovate and develop new technologies and applications, and acquire or obtain rights to third-party technologies that may have valuable applications in our served markets;\n•\nobtain adequate intellectual property rights with respect to key technologies before our competitors do;\n•\nsuccessfully commercialize new technologies in a timely manner, price them competitively and cost-effectively manufacture and deliver sufficient volumes of new products of appropriate quality on time;\n15\n•\nobtain necessary regulatory approvals of appropriate scope (including with respect to medical device products by demonstrating satisfactory clinical results where applicable as well as achieving third-party reimbursement); and\n•\nstimulate customer demand for and convince customers to adopt new technologies.\nIf we fail to accurately predict future customer needs and preferences or fail to produce viable technologies, we may invest heavily in R&D of products and services that do not lead to significant revenue, which would adversely affect our business and financial statements.  Even when we successfully innovate and develop new and enhanced products and services, we often incur substantial costs in doing so, and our profitability may suffer.  In addition, promising new offerings may fail to reach the market or realize only limited commercial success because of real or perceived efficacy or safety concerns, failure to achieve positive clinical outcomes, uncertainty over third-party reimbursement or entrenched patterns of clinical practice.  Competitors may also develop after-market services and parts for our products which may detract from our sales.\nThe healthcare industry and related industries that we serve have undergone, and are in the process of undergoing, significant changes in an effort to reduce (and increase the predictability of) costs, which can adversely affect our business and financial statements.\nThe healthcare industry and related industries that we serve have undergone, and are in the process of undergoing, significant changes in an effort to reduce (and increase the predictability of) costs, including the following:\n•\nMany of our customers, and the end-users to whom our customers supply products, rely on government funding of and reimbursement for healthcare products and services and research activities.  The PPACA, healthcare austerity measures in other countries and other potential healthcare reform changes and government austerity measures have reduced and may further reduce the amount of government funding or reimbursement available to customers or end-users of our products and services and/or the volume of medical procedures using our products and services.  For example, the Protecting Access to Medicare Act of 2014 (“PAMA”) introduced a multi-year pricing program for services payable under the Clinical Laboratory Fee Schedule (“CLFS”) that is designed to bring Medicare allowable amounts in line with the amounts paid by private payors.  It is still unclear whether and to what extent these new rates will affect overall pricing and reimbursement for clinical laboratory testing services, but to the extent our customers conclude that Medicare reimbursement for these services is inadequate, it can in turn adversely impact the prices at which we sell our products.  In addition, the Inflation Reduction Act of 2022 contains various drug price negotiation, inflationary rebate and government-established pricing provisions with varying implementation dates and subjects manufacturers who fail to adhere to the government’s interpretation of the law to penalties.  The recent change in U.S. administration may also result in changes that unfavorably impact the healthcare industry and our business. \n•\nOther countries, as well as some private payors, also control the price of healthcare products, directly or indirectly, through reimbursement, payment, pricing or coverage limitations, tying reimbursement to outcomes or (in the case of governmental entities) through compulsory licensing or limiting of intellectual property protections.  For example, China has introduced programs designed to lower prices for medical products and reduce healthcare costs (including a volume-based procurement program) that have unfavorably impacted our revenues and may continue to adversely affect our business and financial statements.  Global economic uncertainty or deterioration can also adversely impact government funding and reimbursement.\n•\nGovernmental and private healthcare providers and payors around the world are increasingly utilizing managed care for the delivery of healthcare services, centralizing purchasing, limiting the number of vendors that may participate in purchasing programs, forming group purchasing organizations, strategic alliances and integrated health delivery networks and pursuing consolidation to improve their purchasing leverage, using competitive bid processes to procure healthcare products and services and investing in healthcare practices to increase their control over healthcare spending.  Payors are also seeking to improve price predictability in an effort to mitigate exposure to future price increases.\nThese changes as well as other impacts from market demand, government regulations, third-party coverage and reimbursement policies and societal pressures are changing the way healthcare is delivered, reimbursed and funded and have in the past and could in the future cause participants in the healthcare industry and related industries that we serve to purchase fewer of our products and services, reduce the prices they are willing to pay for our products or services, reduce the amounts of reimbursement and funding available for our products and services from governmental agencies or third-party payors, heighten clinical data requirements, reduce the volume of medical procedures that use our products and services, affect the acceptance rate of new technologies and products and increase our compliance and other costs.  In addition, we may be excluded from important market segments or unable to enter into contracts with group purchasing organizations and integrated health networks on terms acceptable to us, and even if we do enter into such contracts they may be on terms that negatively affect our current or future profitability.  All of the factors described above can adversely affect our business and financial statements.\n16\nNon-U.S. economic, political, legal, compliance, social and business factors can negatively affect our business and financial statements.\nIn 2024 approximately 58% of our sales from continuing operations were derived from customers outside the U.S.  In addition, many of our manufacturing operations, suppliers and employees are located outside the U.S.  Since our growth strategy depends in part on our ability to further penetrate markets outside the U.S. and increase the localization of our products and services, we plan to continue to increase our sales and presence outside the U.S., particularly in the high-growth markets.  Our non-U.S. business (and particularly our business in high-growth markets) is subject to risks that include:\n•\npublic health crises and epidemics, such as the recent COVID-19 pandemic;\n•\ninterruption in the transportation of materials to us and finished goods to our customers; \n•\nincreases in materials, energy, labor or other manufacturing-related costs or higher supply chain logistics costs;\n•\ndifferences in terms of sale, including longer payment terms than are typical in the U.S.;\n•\nlocal product preferences or requirements;\n•\nchanges in a country’s or region’s political, legal, social, compliance, business or economic conditions, such as the devaluation of particular currencies or military conflict;\n•\ntrade protection measures, tariffs, embargoes and import or export restrictions and requirements;\n•\nunexpected changes in laws or regulatory requirements, including changes in tax laws;\n•\ncapital controls and limitations on ownership and on repatriation of earnings and cash;\n•\nthe potential for nationalization of enterprises;\n•\nchanges in local healthcare delivery, payment and reimbursement policies and programs;\n•\ncomplex data privacy and cybersecurity requirements;\n•\nlimitations on legal rights and our ability to enforce such rights, including differing protection of intellectual property;\n•\ndifficulty in staffing and managing widespread operations;\n•\nworkforce instability and differing labor or employment regulations;\n•\ndifficulties in implementing restructuring actions on a timely or comprehensive basis; and\n•\ngreater uncertainty, risk, expense and delay in commercializing products in certain foreign jurisdictions, including with respect to product and other regulatory approvals.\nInternational business risks have in the past and may in the future negatively affect our business and financial statements.\nIn 2024 we generated approximately 12% of our sales from continuing operations from China.  Accordingly, political, economic, legal, compliance, social and business conditions in China generally can adversely influence our business and financial statements.  Additionally, China’s government continues to play a significant role in regulating industry development by imposing sector-specific policies, and it maintains control over China’s economic growth through setting monetary policy and determining treatment of particular industries or companies.  Further, considerable uncertainty exists regarding the long-term effects of the fiscal policies pursued by China as well as some of the world’s other leading economies.  Uncertainty or adverse changes to conditions in China or the policies of China’s government or its laws and regulations can adversely affect the overall economic growth of China, or of the particular industries in which we participate, and can adversely affect our business and financial statements.\nOur growth can suffer if the markets into which we sell our products and services decline, do not grow as anticipated or experience cyclicality.\nOur growth depends in part on the growth of the markets which we serve, and visibility into our markets can be limited (particularly for markets into which we sell through distribution).  Our quarterly sales and profits depend substantially on the volume and timing of orders received during the quarter, which are difficult to forecast.  Any decline or lower than expected growth in our served markets can diminish demand for our products and services and adversely affect our business and financial statements.  Certain of our businesses operate in industries that experience seasonality, or industries that have experienced and may continue to experience periodic, cyclical downturns.  For example, demand for our molecular diagnostics products is typically heavier in anticipation of and during respiratory season, and in the past has been impacted and in the future will be impacted by the degree of severity of the flu and COVID-19 season as well as by outbreaks of other infectious diseases.  Certain of our businesses have also experienced recent, cyclical dynamics as a result of factors such as inventory de-stocking, high interest rates and depressed funding levels for biotechnology companies.\n17\nIn addition, in certain of our businesses demand depends on customers’ capital spending budgets, government funding policies and interest rates, and matters of public policy and government budget, fiscal and monetary dynamics as well as product and economic cycles can affect the spending decisions of these entities.  Demand for our products and services is also sensitive to changes in customer order patterns, which may be affected by announced price changes, marketing or promotional programs, new product introductions, the timing of industry trade shows and changes in distributor or customer inventory levels due to distributor or customer management thereof or other factors.  Any of these factors could adversely affect our business and financial statements in any given period.\nUncertainties with respect to the development, deployment, and use of artificial intelligence in our business and products may result in harm to our business and reputation.\nWe are in the early stages of incorporating artificial intelligence (“AI”) into our business activities and our product and service offerings.  As with many innovations, AI presents risks and challenges that could adversely impact our business.  The development, adoption, and use of AI technologies are still in their early stages and ineffective or inadequate AI development or deployment practices could result in unintended consequences.  For example, AI algorithms may be flawed or may be based on datasets that are biased or insufficient.  In addition, any disruption or failure in the AI functionality we incorporate into our business activities, products or services could adversely impact our business or result in delays or errors in our offerings.  Conversely, any failure to successfully develop and deploy AI in our business activities, products and services could adversely affect our competitiveness (particularly if our competitors successfully deploy AI in their businesses, products and services), and the development and deployment of AI will require additional investment and increase our costs.  There also may be real or perceived social harm, unfairness, or other outcomes that undermine public confidence in the use and deployment of AI.  Any of the foregoing may result in decreased demand for our products or harm to our business, financial statements or reputation.\nThe legal and regulatory landscape surrounding AI technologies is rapidly evolving and uncertain, including in the areas of intellectual property, cybersecurity and privacy and data protection.  Compliance with new or changing laws, regulations or industry standards relating to AI may impose significant costs and may limit our ability to develop, deploy or use AI technologies.  Failure to appropriately respond to this evolving landscape may result in legal liability, regulatory action, or brand and reputational harm.\nGlobal health crises, pandemics, epidemics or other outbreaks can adversely impact certain elements of our business and financial statements. \nOur global operations expose us to risks associated with public health crises, including epidemics and pandemics such as COVID-19.  The global spread of COVID-19 led to unprecedented restrictions on, and disruptions in, business and personal activities, including as a result of preventive and precautionary measures that we, other businesses, our communities and governments undertook to mitigate the spread.  Any resurgence of COVID-19 (or the outbreak of any epidemic or pandemic) or the reinstatement of similar preventive measures in the future could negatively impact the economies and financial markets of the world and our business and financial statements.  To the extent we develop and sell products to help epidemics or pandemics in the future, as such epidemics/pandemics evolve we may experience volatility and declines in demand that are unanticipated in timing or magnitude, which could adversely affect our business and financial statements. \nCertain of our businesses rely on relationships with business partners and other third-parties for development, supply and/or marketing of certain products, potential products and technologies, and such business partners or other third-parties could fail to perform sufficiently.\nFor certain of our businesses, success in penetrating target markets depends in part on their ability to develop and maintain business relationships with other companies.  Relying on these relationships is risky because, among other things, our business partners may (1) not devote sufficient resources to the success of our collaborations; (2) fail to obtain regulatory approvals necessary to continue the collaborations in a timely manner; (3) be acquired by other companies and terminate our partnership or become insolvent; (4) compete with us; (5) disagree with us on key details of the business relationship; (6) have insufficient capital resources; (7) fail to comply with applicable laws, regulatory requirements and/or applicable contractual obligations; and (8) terminate or decline to renew existing relationships on acceptable terms, which may require us to devote additional resources to product development and commercialization and/or cancel programs.  The realization of any of these risks could adversely affect our business and financial statements.\n18\nAcquisition, Divestiture and Investment Risks\nAny inability to consummate acquisitions at our historical rate and at appropriate prices, and to make appropriate investments that support our long-term strategy, could negatively impact our business.\nOur ability to grow revenues, earnings and cash flow at or above our historic rates depends in part upon our ability to identify and successfully acquire and integrate businesses at appropriate prices and realize anticipated synergies, and to make appropriate investments that support our long-term strategy.  We may not be able to consummate acquisitions at rates similar to the past, which could adversely impact our business.  Promising acquisitions and investments are difficult to identify and complete for a number of reasons, including high valuations, competition among prospective buyers or investors, the availability of affordable funding in the capital markets and the need to satisfy applicable closing conditions and obtain applicable antitrust and other regulatory approvals on acceptable terms.  For example, antitrust scrutiny by regulatory agencies and changes to regulatory approval processes in the U.S. and non-U.S. jurisdictions may cause approvals to take longer than anticipated to obtain, may not be obtained at all, or may contain burdensome conditions, which may jeopardize, delay or reduce the anticipated benefits of acquisitions to us and could impede the execution of our business strategy.  In addition, competition for acquisitions and investments has resulted and may result in higher purchase prices.  Changes in accounting or regulatory requirements or instability in the credit markets could also adversely impact our ability to consummate acquisitions and investments.\nOur acquisition of businesses, investments, joint ventures and other strategic relationships can negatively impact our business and financial statements.\nAs part of our business strategy, we acquire businesses, make investments and enter into joint ventures and other strategic relationships in the ordinary course, and we also from time to time complete more significant transactions; refer to “Item 7. MD&A” for additional details.  Acquisitions, investments, joint ventures and strategic relationships involve a number of financial, accounting, managerial, operational, legal, compliance and other risks and challenges, including but not limited to the following, any of which can adversely affect our business and financial statements:\n•\nbusinesses, technologies, services and products that we acquire or invest in sometimes under-perform relative to our expectations and the price that we paid, fail to perform in accordance with our anticipated timetable or fail to achieve and/or sustain anticipated levels of profitability;\n•\nwe from time to time incur or assume significant debt in connection with our acquisitions, investments, joint ventures or strategic relationships, which can also cause a deterioration of Danaher’s credit ratings, result in increased borrowing costs and interest expense and diminish our future access to the capital markets;\n•\nacquisitions, investments, joint ventures or strategic relationships can cause our financial results to differ from our own or the investment community’s expectations in any given period, or over the long-term;\n•\npre-closing and post-closing earnings charges can adversely impact our results in any given period, and the impact may be substantially different from period-to-period;\n•\nacquisitions, investments, joint ventures or strategic relationships can create demands on our management, operational resources and financial and internal control systems that we are unable to effectively address;\n•\nwe can experience difficulty in integrating cultures, personnel, operations and financial and other controls and systems and retaining key employees and customers, and former employees of our existing businesses or businesses we acquire sometimes compete with us;\n•\nwe are not always able to achieve cost savings or other synergies anticipated in connection with acquisitions, investments, joint ventures or strategic relationships;\n•\nwe have assumed and may assume unknown liabilities, known contingent liabilities that become realized, known liabilities that prove greater than anticipated, internal control deficiencies or exposure to regulatory sanctions resulting from the acquired company’s or investee’s activities; and the realization of any of these liabilities or deficiencies can increase our expenses, adversely affect our financial position or cause us to fail to meet our public financial reporting obligations;\n•\nin connection with acquisitions and joint ventures, we often enter into post-closing financial arrangements such as purchase price adjustments, earn-out obligations and indemnification obligations, which can have unpredictable financial results and/or lead to disputes and litigation;\n•\nas a result of our acquisitions and investments, we have recorded significant goodwill and other assets on our balance sheet and if we are not able to realize the value of these assets, or if the value of our investments declines, we are required to incur impairment charges (See “Financial and Tax Risks—We may be required to recognize impairment charges for our goodwill and other intangible assets” for additional information);\n19\n•\nwe may have interests that diverge from those of our joint venture partners or other strategic partners or the companies we invest in, and we are not always able to direct or influence the management and operations of the joint venture, other strategic relationship or investee in the manner we believe is most appropriate, exposing us to additional risk; and\n•\ninvesting in or making loans to early-stage companies often entails a high degree of risk, including uncertainty regarding the company’s ability to successfully develop new technologies and services, bring these new technologies and services to market and gain market acceptance, maintain adequate capitalization and access to cash or other forms of liquidity, and retain critical management personnel; we do not always achieve the strategic, technological, financial or commercial benefits we anticipate; we may lose our investment or fail to recoup our loan; or our investment may be illiquid for a greater-than-expected period of time.\nThe indemnification provisions of acquisition agreements by which we have acquired companies may not fully protect us and as a result we may face unexpected liabilities.\nCertain of the acquisition agreements by which we have acquired companies require the former owners to indemnify us against certain liabilities related to the operation of the acquired company before we acquired it.  In most of these agreements, however, the liability of the former owners is limited and certain former owners may be unable to meet their indemnification responsibilities.  In addition, we obtain or receive the benefits of representations and warranties insurance in connection with certain acquisitions.  There can be no assurance that these indemnification provisions or insurance coverages will protect us fully or at all, and as a result we may face unexpected liabilities that adversely affect our business and financial statements.\nDivestitures or other dispositions could negatively impact our business, and contingent liabilities from businesses that we or our predecessors have disposed of could adversely affect our business and financial statements.\nWe continually assess the strategic fit of our existing businesses and may divest, spin-off, split-off or otherwise dispose of businesses for strategic, financial or other reasons.  Over the last several years, Danaher has separated and disposed of multiple businesses using a combination of sale, spin-off, split-off, initial public offering and other transactions (collectively, the “Dispositions”).  The Dispositions and any future, similar transactions pose risks and challenges that could negatively impact our business and financial statements.  For example, divestitures or other dispositions can dilute the Company’s earnings per share, have other adverse financial, tax and accounting impacts and distract management, disputes can arise with the new owners of the divested/disposed business, we may not realize some or all of the anticipated benefits from the transaction and the transaction may not yield greater net benefits to Danaher and its shareholders than if it had not occurred.  In addition, we have retained responsibility for and/or have agreed to provide indemnification against some known and unknown contingent liabilities related to the businesses that were subject to the Dispositions and other businesses we or our predecessors have sold or disposed.  The resolution of these contingencies has not had a material effect on our business or financial statements but there can be no assurance that this favorable pattern will continue.\nIn addition, with respect to the liabilities for which other parties have agreed to indemnify us in connection with the Dispositions, there can be no assurance that the indemnity rights we have against such other parties will be sufficient to protect us against the full amount of the liabilities, or that such other parties will be able to fully satisfy their respective indemnification obligations. It is also possible that a court could disregard the allocation of assets and liabilities agreed to between Danaher and such other parties and require Danaher to assume responsibility for obligations allocated to such other parties.  Each of these risks could negatively affect our business and financial statements.\nWe could incur significant liability if our dispositions of any of Fortive Corporation, Envista Holdings Corporation or Veralto Corporation is determined to be a taxable transaction.\nWe have received opinions from outside tax counsel to the effect that the dispositions of Fortive Corporation in 2016, Envista Holdings Corporation in 2019 and Veralto Corporation in 2023 each qualifies as a transaction that is described in Sections 355(a) and 368(a)(1)(D) of the Internal Revenue Code.  These opinions rely on certain facts, assumptions, representations and undertakings regarding the past and future conduct of the companies’ respective businesses and other matters.  If any of these facts, assumptions, representations or undertakings are incorrect or not satisfied, our stockholders and we may not be able to rely on the respective opinion of tax counsel and could be subject to significant tax liabilities.  Notwithstanding the opinion of tax counsel, the Internal Revenue Service (“IRS”) could determine on audit that any such transactions are taxable if it determines that any of these facts, assumptions, representations or undertakings are not correct or have been violated or if it disagrees with the conclusions in the respective opinion.  If any such transaction is determined to be taxable for U.S. federal income tax purposes, our stockholders that are subject to U.S. federal income tax and we could incur significant U.S. federal income tax liabilities.\n20\nOperational Risks\nSignificant disruptions in, or breaches in security of, our information technology systems or data or violation of data privacy laws can adversely affect our business and financial statements.\nWe rely on information technology systems, some of which are provided and/or managed by third-parties, to process, transmit and store electronic information (including sensitive data such as confidential business information and personal data relating to employees, customers, other business partners and patients), and to manage or support a variety of critical business processes and activities (such as receiving and fulfilling orders, billing, collecting and making payments, shipping products, providing services and support to customers and fulfilling contractual obligations).  Errors, defects, security issues or other vulnerabilities in third-party technology or in the integration of third-party technology with our systems could result in errors that could harm our business.  In addition, some of our remote monitoring products and services incorporate software and information technology that house personal data and some products or software we sell to customers connect to our systems for maintenance or other purposes.  These systems, products and services (including those we acquire through business acquisitions) are susceptible to being damaged, disrupted or shut down due to attacks by computer hackers, computer viruses, ransomware, human error or malfeasance (including by employees), power outages, hardware failures, telecommunication or utility failures, catastrophes, war, conflicts or other unforeseen events, and in any such circumstances our system redundancy and other disaster recovery planning may be ineffective or inadequate.  Certain attacks also target hardware, software and information installed, stored or transmitted in our products after such products have been purchased and incorporated into third-party products, facilities or infrastructure.  Security breaches of systems provided or enabled by us, regardless of whether the breach is attributable to a vulnerability in our products or services, or security breaches of third-party suppliers we rely on to process, store or transmit electronic information, can result in the misappropriation, destruction or unauthorized disclosure of confidential information or personal data belonging to us or to our employees, partners, customers, patients or suppliers.  Like most multinational corporations, our information technology systems and data have been subject to computer viruses, malicious codes, unauthorized access and other cyber-attacks and we expect the sophistication and frequency of such attacks to continue to increase.  Unauthorized tampering, adulteration or interference with our products may also adversely affect product functionality and result in loss of data, risk to patient safety and product recalls or field actions.  In addition, the rapid evolution and increased adoption of artificial intelligence technologies may intensify our cybersecurity risks.  The attacks, breaches, misappropriations and other disruptions and damage described above have the ability to interrupt our operations or the operations of our customers and partners, delay production and shipments, result in theft of our and our customers’ intellectual property and trade secrets, result in disclosure of personal data, damage customer, patient, business partner and employee relationships and our reputation and result in defective products or services, legal claims and proceedings, liability and penalties under privacy and other laws and increased costs for security and remediation, in each case resulting in an adverse effect on our business and financial statements.  Our liability insurance may not be sufficient in type or amount to cover us against claims related to security breaches, cyber-attacks and other related breaches.  In addition, any businesses that we acquire may further expose us to the risks set forth above.\nIn addition, our information technology systems require an ongoing commitment of significant resources to maintain and enhance existing systems and develop new systems to keep pace with continuing changes in information processing technology, evolving legal and regulatory standards, evolving customer expectations, changes in the techniques used to obtain unauthorized access to data and information systems, and the information technology needs associated with our changing products and services.  There can be no assurance that we will be able to successfully maintain, enhance and upgrade our systems as necessary to effectively address these requirements.  Further, more of our employees work remotely now compared to before the beginning of the COVID-19 pandemic, which exposes us to greater cybersecurity and data privacy risks.\nAny inability to maintain reliable information technology systems and appropriate controls with respect to global data privacy and security requirements and prevent data breaches can result in adverse regulatory and business consequences and litigation.  As a global organization, we are subject to data privacy and security laws, regulations and customer-imposed controls in numerous jurisdictions as a result of having access to and processing confidential, personal and/or sensitive data in the course of our business.  For example, entities that are found to be in violation of HIPAA as the result of a breach of unsecured patient health information, a complaint about privacy practices or an audit by HHS, may be subject to significant civil, criminal and administrative fines and penalties and/or additional reporting and oversight obligations.  Failure to comply with the requirements of the GDPR and the applicable national data protection laws of the EU member states and other states subject to the GDPR may result in fines of up to €20 million or up to 4% of total worldwide annual turnover for the preceding financial year, whichever is higher, and other administrative penalties.  Please see “Item 1. Business—Regulatory Matters” for additional information.  Government investigations and enforcement actions can be costly and interrupt the regular operation of our business, and data breaches or violations of data privacy laws can result in civil and criminal, monetary and non-monetary penalties and damage to customer, patient, business partner and employee relationships and to our reputation, any of which may adversely affect our business and financial statements.  In addition, compliance with the varying data privacy regulations across the U.S. and around the world has required significant expenditures and may require additional expenditures, and may require further changes in our products or business models that increase expenses or reduce revenue.\n21\nDefects and unanticipated use or inadequate disclosure with respect to our products or services, or allegations thereof, can adversely affect our business and financial statements.\nManufacturing or design defects or “bugs” in, unanticipated use of, safety or quality issues (or the perception of such issues) with respect to, “off label” use of, or inadequate disclosure of risks relating to the use of products and services that we make or sell (including items that we source from third-parties) can lead to personal injury, death, property damage and/or regulatory violations that can adversely affect our business and financial statements.  These events can lead to recalls or safety alerts, result in the removal of a product or service from the market and result in product liability, errors and omissions or similar claims being brought against us.  Recalls, removals and product liability and similar claims (regardless of their validity or ultimate outcome) can result in significant costs, as well as negative publicity and damage to our reputation that could reduce demand for our products and services.  Our business can also be affected by studies of the utilization, safety and efficacy of medical device products and components that are conducted by industry participants, government agencies and others.  Any of the above can result in the discontinuation of marketing of such products in one or more countries and give rise to claims for damages from persons who believe they have been injured as a result of product issues, including claims by individuals or groups seeking to represent a class.\nIf we suffer loss to our facilities, supply chains, distribution systems or information technology systems due to catastrophe or other events, our operations could be seriously harmed.\nOur facilities, supply chains, distribution systems and information technology systems are subject to catastrophic loss due to fire, flood, cyber-attack, earthquake, hurricane, power shortage or outage, public health crisis (including epidemics and pandemics) and the reaction thereto, war, terrorism, riot, public protest or other natural or man-made disasters, such as the COVID-19 pandemic and the damage caused to our facilities by Hurricane Maria in Puerto Rico in 2017.  If any of these facilities, supply chains or systems were to experience a catastrophic loss, it could disrupt our operations, delay production and shipments, result in defective products or services, diminish demand, damage customer relationships and our reputation and result in legal exposure and significant repair or replacement expenses.  The third-party insurance coverage that we maintain varies from time to time in both type and amount depending on cost, availability and our decisions regarding risk retention, and may be unavailable or insufficient to protect us against such losses.\nClimate change, legal or regulatory measures to address climate change and other sustainability topics and any inability on our part to address stakeholder expectations relating to climate change and other sustainability topics may negatively affect us.\nClimate change resulting from increased concentrations of carbon dioxide and other greenhouse gases in the atmosphere presents risks to our operations.  Physical risk resulting from acute changes (such as hurricane, tornado, wildfire or flooding) or chronic changes (such as droughts, heat waves or sea level changes) in climate patterns can adversely impact our facilities and operations and disrupt our supply chains and distribution systems.  Concern over climate change can also result in new or additional legal, regulatory or quasi-regulatory requirements designed to reduce greenhouse gas emissions, mitigate the effects of climate change on the environment (such as taxation of, or caps on the use of, carbon-based energy) and/or increase disclosures with respect thereto.  Any such new or additional requirements relating to climate change or other sustainability topics may increase the costs associated with, or disrupt, sourcing, manufacturing and distribution of our products, which may adversely affect our business and financial statements.  In addition, any failure to adequately address regulatory requirements (such as the new regulations certain jurisdictions have adopted relating to false or misleading claims about a company’s sustainability practices, and recent changes in U.S. federal law and policy related to diversity practices) or stakeholder expectations with respect to sustainability matters may result in penalties, loss of business, adverse reputational impacts, diluted market valuations and challenges in attracting and retaining customers and employees.  For example, our ability to achieve our current and future sustainability goals is uncertain and remains subject to numerous risks, including evolving regulatory requirements and stakeholder expectations, our ability to recruit, develop and retain a diverse workforce, the availability of suppliers and other business partners that can meet our sustainability expectations, the effects of the organic and inorganic growth of our business, cost considerations, the availability of third-party performance or data beyond our control and third-party development of cost-effective technologies or resources that are made available to us and support our goals.\nThe manufacture of many of our products is a highly exacting and complex process, and if we directly or indirectly encounter problems manufacturing products, our business and financial statements could suffer.\nThe manufacture of many of our products is a highly exacting and complex process, due in part to strict regulatory requirements.  Problems can arise during manufacturing for a variety of reasons, including equipment malfunction, contamination, failure to follow specific protocols and procedures, problems with raw materials or components, cyber-attacks, natural disasters and environmental factors, and if not discovered before the product is released to market can result in recalls and product liability exposure.  Because of the time required to obtain approval of and licenses for certain regulated manufacturing facilities and other stringent regulations of the FDA and similar agencies regarding the manufacture of certain of our products, an alternative manufacturer is not always available on a timely basis to replace such production capacity.  Any of these manufacturing problems could result in adverse impacts to our business and financial statements.\n22\nOur financial results are subject to fluctuations in the cost and availability of the supplies that we use in, and the labor we need for, our operations.\nPrices for and availability of the components, raw materials and other commodities we use in our business, as well as for labor, have fluctuated significantly in recent years.  Please see “Item 1. Business-Materials” for additional details.  The supply chains for our businesses can be disrupted by inflation, supplier capacity constraints, fluctuations in demand, decreased availability of key raw materials or commodities, legislative or regulatory changes, bankruptcy or exiting of the business for other reasons and external events such as natural disasters, pandemic health issues, war, terrorist actions and governmental actions (such as trade protectionism).  In addition, some of our businesses purchase certain requirements from sole or limited source suppliers for reasons of quality assurance, regulatory requirements, cost effectiveness, availability or uniqueness of design.  In the event of interruptions in the supply, or increases in the cost, of such supplies, we might not be able to quickly establish or qualify replacement sources of supply.  Sustained interruptions in the supply of, or increase in the cost of, key components, raw materials, other commodities and labor can result in production interruptions, delays, extended lead times and inefficiencies and adversely affect our business and financial statements.  In addition, due to the highly competitive nature of the industries that we serve, the cost-containment efforts of our customers and the terms of certain contracts we are party to, when supply and labor prices rise we are not always able to pass along cost increases through higher prices for our products.  Whenever we are unable to fully recover higher supply and labor costs through price increases or offset these increases through cost reductions, or whenever there is a time delay between the increase in costs and our ability to recover or offset these costs, our margins and profitability can decline and our business and financial statements can be adversely affected.\nOur profitability could also be adversely impacted if we are unable to adjust our purchases to reflect changes in customer demand and market fluctuations, including those caused by seasonality or cyclicality.  During a market upturn, suppliers from time to time extend lead times, limit supplies or increase prices.  Conversely, in order to secure supplies for the production of products, we sometimes enter into noncancelable purchase commitments with vendors, which can impact our ability to adjust our inventory to reflect declining market demands.  Because we cannot always immediately adapt our production capacity and related cost structures to changing market conditions, at times our manufacturing capacity has exceeded or fallen short, and may in the future exceed or fall short, of our production requirements.  Any or all of these problems can result in the loss of customers or cost inefficiencies, provide an opportunity for competing products to gain market acceptance and otherwise adversely affect our business and financial statements.\nAdverse changes in our relationships with, or the financial condition, performance, purchasing patterns or inventory levels of, key distributors and other channel partners can adversely affect our business and financial statements.\nCertain of our businesses sell a significant amount of their products to or through key distributors and other channel partners that have valuable relationships with customers and end-users.  Some of these distributors and other partners also sell our competitors’ products or compete with us directly.  Adverse developments in the financial condition, performance or purchasing patterns of these distributors and partners, or consolidation of these distributors and partners, can adversely affect our business and financial statements. \n \nThe levels of inventory maintained by these parties, and changes in those levels, also impacts our results of operations in any given period.  \nOur success depends on our ability to recruit, retain and motivate talented employees.\nThe market for highly skilled workers and leaders in our industries, particularly in the areas of science, technology and management, is extremely competitive and expectations from qualified talent in many areas of the labor market have evolved and escalated recently.  In addition, in recent years we faced, and may continue to face, labor availability constraints and labor cost inflation in certain areas of our business.  If we are less successful in our recruiting efforts, if we cannot retain and motivate highly skilled workers and key leaders, or if we experience labor disputes or unionization, our business and financial statements may be adversely affected. \nOur restructuring actions and other cost reduction efforts can have long-term adverse effects on our business and financial statements.\nIn the past, we have implemented significant restructuring and other cost reduction activities across our businesses to adjust our cost structure, and we may engage in similar activities in the future.  These activities could diminish our resources and competitiveness, and delays or failures in implementing planned restructuring and other cost reduction activities may diminish the expected operational or financial benefits from such actions.  Any of the circumstances described above could adversely impact our business and financial statements.\n23\nIntellectual Property Risks\nIf we are unable to adequately protect our intellectual property, or if third-parties infringe our intellectual property rights, we may suffer competitive injury or expend significant resources enforcing our rights.  These risks are particularly pronounced in countries in which we do business that do not have levels of protection of intellectual property comparable to the United States.\nMany of the markets we serve are technology-driven, and as a result intellectual property rights play a significant role in product development and differentiation.  We own numerous patents, trademarks, copyrights, trade secrets and other intellectual property and licenses to intellectual property owned by others, which in aggregate are important to our business.  The intellectual property rights that we obtain, however, are not always sufficiently broad and do not always provide us a significant competitive advantage, and patents may not be issued for pending or future patent applications owned by or licensed to us.  In addition, the steps that we and our licensors have taken to maintain and protect our intellectual property do not always prevent it from being challenged, invalidated, circumvented, designed-around or becoming subject to compulsory licensing.  In some circumstances, enforcement is not available to us because an infringer has a dominant intellectual property position or for other business reasons.  We also rely on nondisclosure and noncompetition agreements with employees, consultants and other parties to protect, in part, trade secrets and other proprietary rights.  There can be no assurance that these agreements adequately protect our trade secrets and other proprietary rights and will not be breached, that we will have adequate remedies for any breach, that others will not independently develop substantially equivalent proprietary information or that third-parties will not otherwise gain access to our trade secrets or other proprietary rights.  Our failure to obtain or maintain intellectual property rights that convey competitive advantage and adequately protect our intellectual property; our failure to detect or prevent circumvention or unauthorized use of such property; and the cost of enforcing our intellectual property rights each can adversely impact our business and financial statements.\nThese risks are particularly pronounced in countries in which we do business that do not have levels of protection of corporate proprietary information, intellectual property, technology and other assets comparable to the United States.  The risks we encounter in such countries include but are not limited to the following:\n•\nJoint ventures that we participate in can include restrictions that could compromise our control over the intellectual property, technology and proprietary information of the joint venture;\n•\nAs we expand our operations globally, increasing amounts of our data, intellectual property and technology is used and stored in countries outside the United States, and regulations in certain countries require data to be stored locally.  These factors increase the risk that such data, intellectual property and technology could be stolen or otherwise compromised;\n•\nCertain of our products have been counterfeited and we may encounter additional and/or increased levels of counterfeiting in the future;\n•\nGovernmental entities may adopt regulations or other requirements that give them rights to certain of our intellectual property, technology and/or proprietary information, such as through compulsory licensing or ownership restrictions or requirements;\n•\nIn certain countries, we do not have the same ability to enforce intellectual property rights as we do in the U.S.; \n•\nGovernmental regulations relating to state secrecy or other topics limit our ability to transfer data or technology out of certain jurisdictions; and\n•\nRisks, costs and challenges of operating in a particular jurisdiction can result in a decision to relocate or divert operations to a different jurisdiction, potentially at higher cost.\nAny of these risks can adversely impact our business and financial statements.  Refer to “Business and Strategic Risks—Non-U.S. economic, political, legal, compliance, social and business factors can negatively affect our business and financial statements” for a discussion of additional risks relating to our international operations.\n24\nThird-parties from time to time claim that we are infringing or misappropriating their intellectual property rights and we could suffer significant litigation expenses, losses or licensing expenses or be prevented from selling products or services.\nFrom time to time, we receive notices from third parties alleging intellectual property infringement or misappropriation of third parties’ intellectual property and we cannot be certain that the conduct of our business does not and will not infringe or misappropriate the intellectual property rights of others.  Disputes or litigations regarding intellectual property can be costly and time-consuming to defend due to the complexity of many of our technologies and the uncertainty of intellectual property litigation.  Our intellectual property portfolio may not be useful in asserting a counterclaim, or negotiating a license, in response to a claim of infringement or misappropriation.  In addition, as a result of such claims of infringement or misappropriation, we could lose our rights to critical technology, be unable to license critical technology or sell critical products and services, be required to pay substantial damages or license fees with respect to the infringed rights, be required to license technology or other intellectual property rights from others, be required to cease marketing, manufacturing or using certain products or be required to redesign, re-engineer or re-brand our products at substantial cost, any of which could adversely impact our business and financial statements.  Third-party intellectual property rights may also make it more difficult or expensive for us to meet market demand for particular product or design innovations.  When we are required to seek licenses under patents or other intellectual property rights of others, we are not always able to acquire these licenses on acceptable terms, if at all.  Even if we successfully defend against claims of infringement or misappropriation, we may incur significant costs and diversion of management attention and resources, which could adversely affect our business and financial statements.\nThe U.S. government has certain rights with respect to incremental production capacity attributable to, and/or the intellectual property we have developed, using government financing.  In addition, in times of national emergency the U.S. government could control our allocation of manufacturing capacity.  \nCertain agencies of the U.S. government, such as the Biomedical Advanced Research and Development Authority (“BARDA”) within the U.S. Department of Health and Human Services, have agreed to finance an expansion of production capacity and/or the development of technology at certain of our businesses, and our businesses may enter into similar agreements in the future.  In consideration of this financing the U.S. government has certain rights, including rights with respect to the allocation of certain of the incremental production capacity associated with such expansion and/or rights in intellectual property produced with its financial assistance.  If the U.S. government exercises its rights with respect to our intellectual property or allocating our production capacity, our business and financial statements could be negatively impacted.\nIn addition, to optimize availability of needed medical and other products in connection with any pandemic or other national emergency, we may elect or governments may require us or our customers to allocate manufacturing capacity (for example, pursuant to the U.S. Defense Production Act (“DPA”)) in a way that adversely affects our financial condition and results of operations, results in differential treatment of customers and/or adversely affects our reputation and customer relationships.  For example, certain of our customers were subject to DPA requirements relating to the production of COVID-19 related products and required certain of our businesses to also comply with these requirements under our supply agreements.  Under such circumstances, the levels of demand for our products can exceed our capacity to meet such demand on a timely basis or at all, which can result in negative publicity, competitive disadvantage and legal liability, and may adversely affect our business and financial statements.\nFinancial and Tax Risks\nFrom time to time our outstanding debt has increased significantly as a result of acquisitions, and we may incur additional debt in the future.  Our existing and future indebtedness may limit our operations and our use of our cash flow and negatively impact our credit ratings; and any failure to comply with the covenants that apply to our indebtedness could adversely affect our business and financial statements.\nAs of December 31, 2024, we had approximately $16.0 billion in outstanding indebtedness.  In addition, we had the ability to incur approximately $4.0 billion of additional indebtedness in direct borrowings or under our outstanding commercial paper facilities based on the amounts available under our credit facilities that were not being used to backstop outstanding commercial paper balances.  From time to time our outstanding debt has increased significantly as a result of acquisitions, and we may incur additional debt in the future.  Our debt level and related debt service obligations can have negative consequences, including (1) requiring us to dedicate significant cash flow from operations to the payment of principal and interest on our debt, which reduces the funds we have available for other purposes such as acquisitions and other investments; (2) reducing our flexibility in planning for or reacting to changes in our business and market conditions; and (3) exposing us to interest rate risk on any variable rate debt we may issue, particularly in light of increases in interest rates.  If our credit ratings are downgraded or put on watch for a potential downgrade, we may not be able to sell additional debt securities or borrow money in the amounts, at the times or interest rates or upon the more favorable terms and conditions that might be available if our current credit ratings were maintained.\n25\nOur credit facilities and long-term debt obligations also impose certain restrictions on us, including certain restrictions on our ability to incur liens on our assets, and a requirement under our credit facilities to not exceed a specified, consolidated leverage ratio.  If we breach any of these restrictions and cannot obtain a waiver from the lenders on favorable terms, subject to applicable cure periods, the outstanding indebtedness (and any other indebtedness with cross-default provisions) could be declared immediately due and payable, which would adversely affect our business and financial statements (including our liquidity).  If we add new debt in the future, the risks described above would increase.\nWe may be required to recognize impairment charges for our goodwill and other intangible assets.\nAs of December 31, 2024, the net carrying value of our goodwill and other intangible assets totaled approximately $59.1 billion.  Significant negative industry or economic trends, disruptions to our business, inability to effectively integrate acquired businesses, unexpected significant changes or planned changes in use of our assets, changes in the structure of our business, divestitures, market capitalization declines, or increases in associated discount rates can impair our goodwill and other intangible assets.  In 2024 and prior periods, we recognized impairment charges relating to certain non-goodwill intangible assets, and in the future, we could recognize charges related to the impairment of goodwill or other intangible assets.  Any such impairment charges adversely affect our financial statements in the periods recognized.\nForeign currency exchange rates can adversely affect our financial statements.\nSales and purchases in currencies other than the U.S. dollar expose us to fluctuations in foreign currencies relative to the U.S. dollar, which have in the past and may in the future adversely affect our financial statements.  Increased strength of the U.S. dollar increases the effective price of our products sold in U.S. dollars into other countries, which can adversely affect sales or require us to lower our prices.  Decreased strength of the U.S. dollar adversely affects the cost of materials, products and services we purchase overseas.  Sales and expenses of our non-U.S. businesses are also translated into U.S. dollars for reporting purposes and the strengthening of the U.S. dollar generally results in unfavorable translation effects.  In addition, certain of our businesses invoice customers in a currency other than the business’ functional currency, and movements in the invoiced currency relative to the functional currency can also result in unfavorable translation effects.  The Company also faces exchange rate risk from its investments in subsidiaries owned and operated in foreign countries.\nChanges in our tax rates or exposure to additional income tax liabilities or assessments can affect our profitability.  In addition, audits by tax authorities can result in additional tax payments for prior periods.\nWe are subject to income taxes in the U.S. and in numerous non-U.S. jurisdictions.  Due to the potential for changes to tax laws and regulations or changes to the interpretation thereof (including regulations and interpretations pertaining to the U.S. Tax Cuts and Jobs Act (“TCJA”)), the ambiguity of tax laws and regulations, the subjectivity of factual interpretations, the complexity of our intercompany arrangements, uncertainties regarding the geographic mix of earnings in any particular period, and other factors, our estimates of effective tax rate and income tax assets and liabilities can be incorrect and our financial statements could be adversely affected; please refer to “Item 7. MD&A” for a discussion of additional factors that may adversely affect our effective tax rate and decrease our profitability in any period.  The impact of the factors referenced in the preceding sentence may be substantially different from period-to-period.  In addition, the amount of income taxes we pay is subject to ongoing audits by U.S. federal, state and local tax authorities and by non-U.S. tax authorities, such as the audits described in MD&A and the Company’s Consolidated Financial Statements.  If audits result in payments or assessments different from our reserves, our results can be adversely affected.  Any further changes to the tax system in the United States or in other jurisdictions could also adversely affect our financial statements.  \nChanges in tax law relating to multinational corporations could adversely affect our tax position.\nLegislative bodies and government agencies in the U.S. and other countries as well as the Organisation for Economic Co-operation and Development (“OECD”) have focused on issues related to the taxation of multinational corporations.  One example is in the area of “base erosion and profit shifting,” for which the OECD has released several components of its comprehensive plan (e.g. the Pillar Two 15% global minimum tax framework) that have been adopted and expanded by many taxing authorities to address perceived tax abuse and inconsistencies between tax jurisdictions.  As a result, the tax laws in the U.S. and other countries in which we do business could change on a prospective or retroactive basis, and any such changes could adversely affect our business and financial statements.\n26\nMilitary conflicts (such as the conflicts between Russia and Ukraine and in the Middle East) can adversely affect our business and financial statements.\nMilitary conflicts (such as the conflicts between Russia and Ukraine and in the Middle East) can adversely affect our business and financial statements.  For example, consequences of the conflict between Russia and Ukraine have included sanctions, embargoes, regional instability, geopolitical shifts and adverse impacts on energy supplies and prices, and such conflict or other conflicts may cause similar adverse effects in the future.  In addition to suspending sales prohibited by sanctions, the Company has suspended the shipment of products to Russia with the exception of products for the purposes of diagnosing and treating patients and producing vaccines and therapeutics.  Military conflicts also heighten other risks disclosed in this Annual Report, any of which can adversely affect our business and financial statements.  Such risks include, but are not limited to, adverse effects on macroeconomic conditions, including increased inflation, constraints on the availability of commodities, supply chain disruption and decreased business spending; disruptions to our or our business partners’ global technology infrastructure, including through cyber-attack or cyber-intrusion; adverse changes in international trade policies and relations; claims, litigation and regulatory enforcement; potential retaliatory actions by governments against companies, such as nationalization of foreign businesses; adverse impacts on our ability to implement and execute our business strategy; terrorist activities; our exposure to foreign currency fluctuations; reputational risk; and constraints, volatility, or disruption in the capital markets.\nIn 2024, Russia, Ukraine and Israel sales combined accounted for less than 1% of the Company’s sales.  \nLegal, Regulatory, Compliance and Reputational Risks\nSignificant developments or changes in national laws or policies to protect or promote domestic interests and/or address foreign competition can have an adverse effect on our business and financial statements.\nSignificant developments or changes in national laws or policies to protect or promote domestic interests and/or address foreign competition, including laws and policies in areas such as trade, manufacturing, government purchasing, healthcare, intellectual property and investment/development, can adversely affect our business and financial statements.  For example, certain governments have implemented policies to induce “re-shoring” of supply chains, reduce reliance on imported supplies and promote national production.  The Chinese government has issued a series of policies in the past several years to promote the development and use of local medical devices.  In addition, in recent years the U.S. has increased tariffs on certain imported goods and trade tensions between China and other countries (including the U.S.) have escalated, with countries imposing significant additional tariffs on a wide range of imported goods.  Following the recent change of administration in the U.S., new tariffs have been implemented and have prompted retaliatory tariffs by certain countries, further tariffs my follow and the risks noted above have increased.  The full impact of these tariffs on the Company and our business partners remains uncertain.\nOur business and financial statements can be impaired by improper conduct by any of our employees, agents or business partners.\nThere can be no assurance that our internal controls and compliance systems, including our Code of Conduct, protect us from acts committed by employees, agents or business partners of ours (or of businesses we acquire or partner with) that violate laws, including the laws governing payments to government officials, bribery, fraud, kickbacks and false claims, pricing, sales and marketing practices, conflicts of interest, competition, employment practices and workplace behavior, export and import compliance, economic and trade sanctions, money laundering and data privacy.  In particular, the U.S. Foreign Corrupt Practices Act, the UK Bribery Act and similar anti-bribery laws in other jurisdictions generally prohibit companies and their intermediaries from making improper payments to government officials for the purpose of obtaining or retaining business, and we operate in many parts of the world that have experienced governmental corruption to some degree.  Any such improper actions or allegations of such acts could damage our reputation and subject us to civil or criminal investigations and related shareholder lawsuits, could lead to substantial civil and criminal, monetary and non-monetary penalties and could cause us to incur significant legal and investigatory fees.  In addition, the government may seek to hold us liable for violations committed by companies in which we invest or that we acquire.  We also rely on our suppliers to adhere to our Supplier Code of Conduct, and violations of such code of conduct could adversely affect our business and financial statements.\nOur businesses are subject to extensive regulation; failure to comply with those regulations could adversely affect our business and financial statements.\nIn addition to the environmental, health, safety, healthcare, medical device, anticorruption, data privacy, artificial intelligence, sustainability and other regulations noted elsewhere in this Annual Report, our businesses are subject to extensive regulation by U.S. and non-U.S. governmental and self-regulatory entities at the supranational, federal, state, local and other jurisdictional levels, including for example the following:\n27\n•\nWe are required to comply with various import laws and export control and economic sanctions laws, which may affect our transactions with certain customers, business partners and other persons and dealings between our employees and between our subsidiaries.  Compliance with the various import laws that apply to our businesses can restrict our access to, and increase the cost of obtaining, certain products and at times can interrupt our supply of imported inventory.  In addition, we sell and provide products and technology to third parties, such as agents, representatives and distributors, who may export such items to end-users.  If we or any of these third parties do not comply with applicable export or import laws we may incur liability.  In addition, from time to time, certain of our subsidiaries have limited business dealings in countries subject to comprehensive sanctions.  These business dealings represent an insignificant amount of our consolidated revenues and income but expose us to a heightened risk of violating applicable sanctions regulations.  We have established policies and procedures designed to help ensure compliance with such laws and regulations but there can be no assurance that the policies and procedures have prevented and will prevent violations of these regulations, and any such violation can adversely affect our business and financial statements.\n•\nWe also have agreements to sell products and services to government entities as well as agreements relating to government financing, as discussed above (less than 5% of our 2024 sales were made to the U.S. federal government).  The laws governing government contracts differ from the laws governing private contracts; for example, our government contracts are in some cases subject to termination, reduction or modification at the convenience of the government or in the event of changes in government requirements, reductions in federal spending and other factors.  Government contracts that have been awarded to us following a bid process can become the subject of a bid protest by a losing bidder, which could result in loss of the contract.  We are also subject to investigation and audit for compliance with the requirements governing government contracts.  \nThese are not the only regulations that our businesses must comply with.  The regulations we are subject to have tended to become more stringent over time and can be inconsistent across jurisdictions.  We, our representatives and the industries in which we operate are at times under review and/or investigation by regulatory authorities.  Failure to comply (or any alleged or perceived failure to comply) with the regulations referenced above or any other regulations can result in import detentions, fines, damages, civil and administrative penalties, injunctions, consent decrees, suspensions or losses of regulatory approvals, recall or seizure of products, operating restrictions, refusal of the government to approve product export applications or allow us to enter into supply contracts, disbarment from selling to certain governmental agencies or exclusion from government funded healthcare programs, such as Medicare and Medicaid or similar programs in other countries or jurisdictions, integrity oversight and reporting obligations to resolve allegations of non-compliance, disruption of our business, limitation on our ability to manufacture, import, export and sell products and services, loss of customers, significant legal and investigatory fees, disgorgement, individual imprisonment, reputational harm, contractual damages, diminished profits, curtailment or restricting of business operations, criminal prosecution and other monetary and non-monetary penalties.  Compliance with these and other regulations can also affect our returns on investment, require us to incur significant expenses or modify our business model or impair our flexibility in modifying product, marketing, pricing or other strategies for growing our business.  Our products and operations are also often subject to the rules of industrial standards bodies such as the International Standards Organization, and failure to comply with these rules can result in withdrawal of certifications needed to sell our products and services and otherwise adversely impact our business and financial statements.  For additional information regarding these risks, refer to “Item 1. Business—Regulatory Matters.”\nWe are subject to or otherwise responsible for a variety of litigation and other legal and regulatory proceedings in the course of our business that can adversely affect our business and financial statements.\nWe are subject to or otherwise responsible for a variety of litigation and other legal and regulatory proceedings in the course of our business (or related to the business operations of previously owned entities), including claims or counterclaims for damages arising out of the use of products or services and claims relating to intellectual property matters, employment matters, tax matters, commercial disputes, breach of contract claims, competition and sales and trading practices, environmental matters, personal injury, insurance coverage, securities matters, fiduciary duties and acquisition or divestiture-related matters, as well as regulatory subpoenas, requests for information, investigations and enforcement.  We also from time to time become subject to lawsuits as a result of acquisitions or as a result of liabilities retained from, or representations, warranties or indemnities provided in connection with, businesses divested by us or our predecessors.  The types of claims made in lawsuits include claims for compensatory damages, punitive and consequential damages (and in some cases, treble damages) and/or injunctive relief.  The defense of these lawsuits can divert our management’s attention, we from time to time incur significant expenses in defending these lawsuits, and we can be required to pay damage awards or settlements or become subject to equitable remedies that adversely affect our business and financial statements.  Moreover, any insurance or indemnification rights that we have may be insufficient or unavailable to protect us against such losses.  Because most contingencies are resolved over long periods of time, new developments (including litigation developments, the discovery of new facts, changes in legislation and outcomes of similar cases), changes in assumptions or changes in the Company’s strategy in any given period can require us to adjust the loss contingency estimates that we have recorded in our financial statements, record estimates for liabilities or assets previously not susceptible of reasonable estimates or pay cash settlements or judgments.  Any of these developments can \n28\nadversely affect our business and financial statements in any particular period.  There can be no assurance that our liabilities in connection with current and future litigation and other legal and regulatory proceedings will not exceed our estimates or adversely affect our financial statements and business.  However, based on our experience, information and applicable law as of the date of this Annual Report, we do not believe that it is reasonably possible that any amounts we may be required to pay in connection with litigation and other legal and regulatory proceedings in excess of our reserves as of December 31, 2024 will have a material effect on our business or financial statements.\nFrom time to time, we become aware through our internal audits and other internal control procedures, employees or other parties of possible compliance matters, such as complaints or concerns relating to accounting, internal controls, financial reporting, auditing or ethical matters or relating to compliance with laws.  When we become aware of such possible compliance matters, we investigate internally and take what we believe to be appropriate corrective action.  Internal investigations can lead to the assertion of claims or the commencement of legal or regulatory proceedings against us and adversely affect our business and financial statements.\nCertain of our businesses are subject to extensive regulation by the FDA and by comparable agencies of other countries, as well as laws regulating fraud and abuse in the healthcare industry and the privacy and security of health information.  Failure to comply with those regulations could adversely affect our business and financial statements.\nCertain of our products are medical devices and other products that are subject to regulation by the FDA, by other federal and state governmental agencies, by comparable agencies of other countries and regions, by certain accrediting bodies and by regulations governing hazardous materials and drugs-of-abuse (or the manufacture and sale of products containing any such materials).  The global healthcare regulatory environment has become increasingly stringent and unpredictable.  Several countries that did not have regulatory requirements for medical devices have established such requirements in recent years, and other countries have expanded, or plan to expand, their existing regulations.  For example, expanded FDA regulation of laboratory-developed tests (i.e., diagnostic assays developed and produced by clinical laboratories) may delay and add to the cost of commercialization of these products, as well as subject us to additional regulatory requirements.  Please see “Item 1. Business—Regulatory Matters” for more information.  Failure to meet these requirements can adversely impact our business and financial statements in the applicable geographies.\nTo varying degrees, these regulators require us to comply with laws and regulations governing the development, testing, manufacturing, labeling, marketing, distribution and post-marketing surveillance of our products.  We cannot guarantee that we will be able to obtain regulatory clearance (such as 510(k) clearance) or approvals for our new products or modifications to (or additional indications or uses of) existing products within our anticipated timeframe or at all, and if we do obtain such clearance or approval it may be time-consuming, costly and subject to restrictions.  Our ability to obtain such regulatory clearances or approvals will depend on many factors, for example our ability to obtain the necessary clinical trial results, and the process for obtaining such clearances or approvals could change over time and may require the withdrawal of products from the market until such clearances are obtained.  Even after initial regulatory clearance or approval, we are subject to periodic inspection by these regulatory authorities, and when safety issues arise we can be required to amend conditions for use of a product, such as providing additional warnings on the product’s label or narrowing its approved intended use, which could reduce the product’s market acceptance.  We are also subject to various laws regulating fraud and abuse, research and development, pricing and sales and marketing practices, the privacy and security of health information as well as manufacturing and quality standards, including the federal regulations described in “Item 1. Business—Regulatory Matters.”  \nGovernment authorities have in the past and may in the future conclude that our business practices do not comply with current or future statutes, regulations, agency guidance or case law.  Failure to obtain required regulatory clearances or approvals before marketing our products (or before implementing modifications to or promoting additional indications or uses of our products), other violations of laws or regulations, failure to remediate inspectional observations to the satisfaction of these regulatory authorities, real or perceived efficacy or safety concerns or trends of adverse events with respect to our products (even after obtaining clearance for distribution) and unfavorable or inconsistent clinical data from existing or future clinical trials can lead to FDA Form 483 Inspectional Observations, warning letters, notices to customers, declining sales, loss of customers, loss of market share, remediation and increased compliance costs, recalls, seizures of adulterated or misbranded products, fines, expenses, injunctions, civil penalties, criminal penalties, consent decrees, administrative detentions, refusals to permit importations, partial or total shutdown of production facilities or the implementation of operating restrictions, narrowing of permitted uses for a product, refusal of the government to grant 510(k) clearance, suspension or withdrawal of approvals, pre-market notification rescissions and other adverse effects referenced under the risk factor titled “Our businesses are subject to extensive regulation; failure to comply with those regulations could adversely affect our business and financial statements.”  Further, defending against any such actions can be costly and time-consuming and may require significant personnel resources.  Therefore, even if we are successful in defending against any such actions brought against us, our business may be impaired.  Ensuring that our operations and business arrangements with third parties comply with applicable laws and regulations also involves substantial costs.  \n29\nOur products can be subject to human clinical trials, the results of which may be unexpected, or perceived as unfavorable by the market, and could adversely affect our business and financial statements.\nAs a part of the regulatory process of obtaining marketing clearance for certain new products and new indications for certain existing products, we conduct and participate in clinical trials with a variety of study designs, patient populations and trial endpoints.  Unexpected or inconsistent clinical data from existing or future clinical trials, or a regulator’s or market perception of these clinical data, can adversely impact our ability to obtain product approvals, our position in, and share of, the markets in which we participate and our business and financial statements.  In addition, our products and services may support or be used in connection with customer products that are subject to clinical trials, and adverse results in any such clinical trials may adversely affect future demand for our products and services. \nOff-label marketing of our products could result in substantial penalties.\nThe FDA and other regulatory agencies around the world strictly regulate the promotional claims that may be made about approved or cleared products.  In particular, any clearances we may receive only permit us to market our products for the intended uses indicated on the labeling cleared by the FDA.  We may request additional label indications for our current products, and the FDA may deny those requests outright, require additional performance or clinical data to support any additional indications or impose limitations on the intended use of any cleared products as a condition of clearance.  If the FDA or any other regulator determines that we have marketed our products for off-label use, we can be subject to exclusion from participation in government healthcare programs and the other adverse effects referenced under the risk factors set forth above.  Any of these events could significantly harm our business and financial statements.\nCertain modifications to our products may require new 510(k) clearances or other marketing authorizations and may require us to recall or cease marketing our products.\nOnce a medical device is permitted to be legally marketed in the United States pursuant to a 510(k) clearance or a premarket approval (“PMA”), a manufacturer may be required to notify the FDA of certain modifications to the device (similar requirements apply in other jurisdictions).  Manufacturers determine in the first instance whether a change to a product requires a new 510(k) clearance or premarket submission, but the FDA may review any manufacturer’s decision.  The FDA may not agree with our decisions regarding whether new clearances are necessary.  We have made modifications to our products in the past and have determined based on our review of the applicable FDA regulations and guidance that in certain instances new 510(k) clearances or other premarket submissions were not required.  We may make similar modifications or add additional features in the future that we believe do not require a new clearance or approval.  If the FDA disagrees with our determinations and requires us to submit new 510(k) notifications or PMA applications, we may be required to cease marketing or to recall the modified product until we obtain clearance, and we may be subject to civil and criminal, monetary and non-monetary penalties and damage to our reputation.\nOur operations, products and services expose us to the risk of environmental, health and safety liabilities, costs and violations that could adversely affect our business and financial statements.\nOur operations, products and services are subject to numerous U.S. federal, state, local and non-U.S. environmental, health and safety laws and regulations concerning, among other things, the health and safety of our employees, the generation, storage, use and transportation of hazardous materials, emissions or discharges of substances into the environment, investigation and remediation of hazardous substances or materials at various sites, chemical constituents in products and end-of-life disposal and take-back programs for products sold.  There can be no assurance that our environmental, health and safety compliance program (or the compliance programs of businesses we acquire) have been or will at all times be effective.  Failure to comply with any of these laws can result in civil and criminal, monetary and non-monetary penalties and damage to our reputation.  In addition, there can be no assurance that our costs of complying with current or future environmental protection and health and safety laws will not exceed our estimates or adversely affect our business or financial statements.\nIn addition, we from time to time incur costs related to remedial efforts or alleged environmental damage associated with past or current waste disposal practices or other hazardous materials handling practices.  We are also from time to time party to personal injury, property damage or other claims brought by private parties alleging injury or damage due to the presence of or exposure to hazardous substances.  We can also become subject to additional remedial, compliance or personal injury costs due to future events such as changes in existing laws or regulations, changes in agency direction or enforcement policies, developments in remediation technologies, changes in the conduct of our operations and changes in accounting rules.  There can be no assurance that our liabilities arising from past or future releases of, or exposures to, hazardous substances will not exceed our estimates or adversely affect our reputation and financial statements or that we will not be subject to additional claims for personal injury or remediation in the future based on our past, present or future business activities.  However, based on the information we have as of the date of this Annual Report we do not believe that it is reasonably possible that any amounts we may be required to pay in connection with environmental matters in excess of our reserves as of December 31, 2024, will have a material effect on our business or financial statements.\n30\nChanges in governmental regulations can reduce demand for our products or services or increase our expenses.\nWe compete in markets in which we and our customers must comply with supranational, federal, state, local and other jurisdictional regulations, such as regulations governing health and safety, the environment, food and drugs and privacy.  We develop, configure and market our products and services to meet customer needs created by these regulations.  Any significant change in any of these regulations (or in the interpretation or application thereof) can reduce demand for, increase our costs of producing or delay the introduction of new or modified products and services, or restrict our existing activities, products and services.  For example, changes in the FDA’s regulation of the drug discovery/development process can have an adverse effect on the demand for our products and services.  \nExclusive forum provisions in our By-laws could limit our stockholders’ ability to choose their preferred judicial forum for disputes with us or our directors, officers or employees.\nOur Amended and Restated By-laws (the “By-laws”) provide that unless the Company selects or consents to the selection of an alternative forum, the sole and exclusive forum for any complaint asserting any internal corporate claims, to the fullest extent permitted by law and subject to applicable jurisdictional requirements, will be the Court of Chancery of the State of Delaware (or, if the Court of Chancery does not have, or declines to accept, jurisdiction, another state court or a federal court located within the State of Delaware) (collectively, “Delaware Courts”).  Current and former stockholders are deemed to have consented to the personal jurisdiction of the Delaware Courts in connection with any action to enforce such exclusive forum provision and to service of process in any such action.  These provisions of the By-laws are not a waiver of, and do not relieve anyone of duties to comply with, federal securities laws including those specifying the exclusive jurisdiction of federal courts under the Exchange Act and concurrent jurisdiction of federal and state courts under the Securities Act of 1933, as amended.  To the extent that the exclusive forum provisions of our By-laws limit a current or former stockholder’s ability to select a judicial forum other than the Delaware Courts, they might discourage the specified legal actions, might cause current or former stockholders to incur additional litigation-related expenses and might result in outcomes unfavorable to current or former stockholders.  Alternatively, a court might determine that these provisions of the By-laws are inapplicable or unenforceable in any particular action, in which case we may incur additional litigation-related expenses in such action, and the action may result in outcomes unfavorable to us, which could have an adverse impact on our business and financial statements.\nITEM 1B.  UNRESOLVED STAFF COMMENTS\nNot applicable.\nITEM 1C.  CYBERSECURITY\nCybersecurity Strategy and Risk Management\nDanaher’s cybersecurity strategy and risk management program focuses on seeking to maintain a secure environment for our data that complies with applicable legal requirements and effectively supports our business objectives and customer needs.\n  Our commitment to cybersecurity emphasizes cultivation of a security-minded culture through education and training, and a programmatic and layered approach to prevention and detection of, and response to, cybersecurity threats.  Key elements of our program for identifying, assessing and managing material risks from cybersecurity threats are described below\n.\nWe maintain cybersecurity policies that articulate Danaher’s expectations and requirements with respect to topics such as acceptable use of technology and data, data privacy, risk management, education and awareness and event and incident management.  We regularly conduct exercises, with the support of outside domain experts, to improve the effectiveness of our processes and we periodically assess our processes against recognized cybersecurity frameworks.  Consistent with our position that cybersecurity is the responsibility of every Danaher associate, we regularly educate and share best practices with our associates to raise awareness of cybersecurity threats.  Every year, associates in applicable job categories are required to take information security and protection training as part of the Danaher Annual Training Program.  We also conduct regular education and training for our associates through cyber-event simulations.\nWe strive to implement and maintain layered controls designed to prevent and, where necessary, detect and respond to cybersecurity threats.  Our physical controls are designed to restrict access to locations that house significant physical information technology assets.  Our technical preventive controls include access restrictions and network security technologies.  Our notification policies and processes are designed to have notifications and alerts escalated to the appropriate personnel on a timely basis to support effective review, response and compliance with legal requirements.  In addition to event-specific notifications, data is aggregated and compiled on a regular basis to support the identification of trends and effective program review and oversight.  \nWe also recognize that Danaher is exposed to cybersecurity risks that affect third parties whom we rely on to process, store or transmit our electronic information.  To manage these risks, we maintain technical security controls as well as processes designed to facilitate Danaher’s identification of third-party cybersecurity risks.\n31\nKey elements of Danaher’s annual Enterprise Risk Management (“ERM”) program include an inventory and classification of key risk areas and topics; a methodology for scoring risks based on the risk’s probability, severity and velocity of impact, and for trending key risks; and a framework for developing and implementing countermeasures for key risks.  Information technology/cybersecurity is one of five topical areas required to be addressed as part of the annual ERM program.  IT and cybersecurity risks are required to be scored using the same methodology applied to all other risk categories, which facilitates an evaluation of the significance and prioritization of cyber-related risks relative to wider business risks.  In addition, Danaher policy requires the reporting of certain cybersecurity incident data to Danaher’s Risk Committee (comprising senior members of the legal, finance, internal audit and compliance functions) for consideration as part of the ERM process.  \nMembers of the Danaher Risk Committee present annually to the Danaher Board of Directors a report on the results of the ERM process, including with respect to information technology and cybersecurity risks.\n  As part of our cybersecurity risk management program, we also maintain cyber insurance in amounts and subject to coverage terms that are typical for companies of our type and size.  However, such insurance may not be sufficient in type or amount to cover us against damages incurred or claims related to security breaches, cyber-attacks and other related breaches.\nWe periodically engage external consultants to assess our cybersecurity program.  In addition, management’s annual assessment of the effectiveness of the Company’s internal control over financial reporting assesses the effectiveness of certain controls relating to cybersecurity, and the Company’s independent registered public accounting firm audits the effectiveness of the Company’s internal control over financial reporting.\n \nCybersecurity Governance and Oversight\nAt the management level, \nDanaher’s cybersecurity program is led by the Company’s Chief Information Security Officer (“CISO”), who reports to Danaher’s Chief Information Officer (“CIO”), who in turn reports to Danaher’s Chief Financial Officer.\n \nDanaher’s CIO has served as a technology leader for over 25 years, leading cybersecurity, engineering, and operational functions as the CIO for two multi-billion dollar businesses prior to assuming the Danaher CIO role.  Danaher’s CISO has served for more than 20 years in various information security roles, including serving as the Chief Information Security Officer of two large, publicly-traded companies prior to joining Danaher.\n  The CISO is supported by the Information Risk Steering Committee (“IRSC”), a management committee comprising senior members of the information technology, legal, privacy, finance, internal audit and communications functions.  The IRSC supports the CISO and CIO in overseeing and managing information security risks and in the event of a cybersecurity incident provides oversight and leadership with respect to incident investigation, mitigation and remediation.\nAt the Board level, \nDanaher’s Board of Directors has delegated to the Audit Committee of the Board responsibility for oversight of risks relating to cybersecurity, as set forth in the Committee’s charter.  Multiple members of Danaher’s Audit Committee have prior work experience overseeing or assessing a cybersecurity function.  \nDanaher’s CISO and CIO update the Audit Committee multiple times per year regarding Danaher’s cybersecurity program, including key program metrics, initiatives and developments.  The Audit Committee regularly briefs the full Board on these matters.\n  In addition, in the event of a significant cybersecurity incident, Danaher policy and process requires timely engagement of and consultation with the Audit Committee\n.\n \nBased on the information we have as of the date of this Annual Report, we do not believe any risks from cybersecurity threats, including as a result of any previous cybersecurity incidents, have materially affected or are reasonably likely to materially affect Danaher, including our business strategy, results of operations or financial condition."
}