{
  "ticker": "DLTR",
  "cik": "0000935703",
  "company_name": "DOLLAR TREE, INC.",
  "filing_date": "2025-03-26",
  "accession": "0000935703-25-000015",
  "primary_doc": "dltr-20250201.htm",
  "item1_text": "Item 1. Business\n” for further discussion of the effect of competition on our operations.\n14\nTable of Contents\nOur business could be adversely affected if we fail to manage our organizational talent and capacity, including attracting and retaining qualified associates and key personnel.\nOur growth and performance are dependent on the skills, experience and contributions of our associates, executives and key personnel. At our stores and distribution centers, we must recruit, develop, train, and retain qualified associates in relatively large numbers, while also working to decrease turnover in these positions. Our ability to meet labor needs while controlling costs is subject to many external factors, including competition for and availability of qualified personnel, unemployment levels, wage rates and salary levels (including the heightened possibility of increased federal, state and/or local minimum wage rates/salary levels), health and other insurance costs, changes in employment and labor laws or other workplace regulations (including those relating to employee benefit programs such as health insurance and paid leave programs), labor activism, associate safety issues, associate expectations and productivity, and our reputation and relevance within the labor market. If we are unable to attract, develop and retain adequate numbers of qualified associates, our operations, customer service levels, legal and regulatory compliance, and support functions could suffer. Further, our stores are typically staffed with relatively few associates, which increases our exposure to the foregoing risks. In addition, to the extent a significant portion of our associate base unionizes, or attempts to unionize, our labor and other related costs could increase. The potential financial impact of union organization is further compounded by the possibility of federal agencies adopting or imposing changes to existing labor law that could facilitate union organizing. We currently do not have any employees represented by unions. Our ability to pass along labor and other related costs to our customers is constrained by our pricing model, and we may not be able to offset such increased costs elsewhere in our business.\nSuccessful execution of our plans and strategies also depends on the efforts of key management personnel. The labor market for these executives and other key personnel is nationwide in scope and intensely competitive. The loss of such personnel, or the inability to hire, train, motivate and retain them, or to manage changes to our organizational structure and capacity, could, at least temporarily, have an adverse effect on the company’s operating results and financial condition. In addition, failure to develop an adequate succession plan for senior positions could reduce our organizational capabilities and competitive advantage during a transition. We recently have experienced turnover in senior positions, which, in addition to organizational changes related to our pending sale of the Family Dollar business, can disrupt progress in implementing business strategies, result in a loss of institutional knowledge, cause greater workload demands for remaining team members and divert attention away from key areas of the business, or otherwise negatively impact the company’s growth prospects or future operating results.\nWe rely on third parties in many aspects of our business, which creates additional risk.\nDue to the scale and scope of our business, we must rely on relationships with third parties, including our suppliers, distributors, landlords, contractors, and external business partners. If we are unable to effectively manage our third-party relationships and the agreements under which our third-party partners operate, our results of operations and cash flows could be adversely impacted. Further, failure of these third parties to meet their obligations to the company or substantial disruptions in the relationships between the company and these third parties could adversely impact our operations and financial results. Additionally, while we have policies and procedures for managing these relationships, they inherently involve a lesser degree of control over business operations, governance and compliance, thereby potentially increasing our financial, legal, reputational and operational risk.\nRisks Relating to Strategic Initiatives and the Pending Sale of the Family Dollar Business\nWe may not be successful in implementing or in anticipating the impact of important strategic initiatives, which may have an adverse impact on our business and financial results.\nIn recent years, we have embarked on a number of strategic initiatives across the Dollar Tree and Family Dollar banners to drive productive sales growth and improve operating efficiency. In our Dollar Tree banner, those initiatives include, among others:\n•\nWe continue to expand our Dollar Tree brand assortment at the $1.25 price point and expand our multi-price product assortment, which now comprises a wide assortment of consumable and discretionary product at varying price points.\n•\nWe secured the leases for 164 former 99 Cents Only Stores across Arizona, California, Nevada and Texas and opened those stores under our Dollar Tree segment. More recently we have acquired designation rights for approximately 138 Party City stores and as we complete our diligence on this group of stores, we intend to designate acceptable stores and open these as Dollar Tree segment stores.\n•\nWe have initiatives to provide competitive pay and benefits, enhanced training, and other projects to support our workforce as well as initiatives to optimize and modernize our stores. Our supply chain initiatives include optimizing our transportation network and distribution methods.\n•\nWe continue our significant investments in our technology across our business, including our mobile apps, store systems, merchandising and supply chain.\n15\nTable of Contents\nIn addition, we have been executing on a number of strategic initiatives in our Family Dollar banner, culminating with our agreement in March 2025 to sell the Family Dollar business. For more information about the impacts of the sale of Family Dollar, please see \n“The completion of the pending sale of the Family Dollar business is subject to various risks and uncertainties, may not be completed in a timely fashion or at all, and the pending sale may be disruptive to our business operations and adversely affect our profitability”\n and \n“If the pending sale of the Family Dollar business is completed, we may not achieve the anticipated benefits of the transaction, and the transaction may expose us to new risks”\n below.\nThe implementation, timing and results of these complex strategic initiatives are subject to various risks and uncertainties, which may require that we make significant estimates and assumptions in our planning. These initiatives place significant demands on our accounting, financial, information technology, and other systems, and on our business overall. We are dependent on our management’s ability to oversee these initiatives effectively and implement them successfully. If our estimates and assumptions about our initiatives are incorrect, or if we miscalculate the resources or time we need to complete them or fail to execute on them effectively, our pursuit of these initiatives may increase our costs and reduce our margins and profitability.\nTo be effective, our strategies have and will continue to require significant investment in cross-functional operations and management focus, along with supporting investments. For example, we experienced increased expenses from temporary labor on the Dollar Tree segment during 2024 to support our multi-price rollout. If we are unable to attract and retain employees or contract with third parties having the specialized skills needed to support our efforts, implement improvements to systems in a timely manner, our ability to compete and our results of operations could be adversely affected. In addition, if initiatives related to our multi-priced merchandise at Dollar Tree and improved customer experience do not appeal to our customers or if we are unable to consistently meet our brand execution promises in a cost-effective manner, we may experience a loss of customer confidence or lost sales, which could adversely affect our reputation and results of operations.\nA failure to properly execute our plans and business strategies, delays in executing our plans and business strategies, increased costs associated with executing on our plans and business strategies, or failure to identify alternative strategies could have a material adverse effect on our business, financial position, results of operations, and cash flows.\nThe completion of the pending sale of the Family Dollar business is subject to various risks and uncertainties, may not be completed in a timely fashion or at all, and the pending sale may be disruptive to our business operations and adversely affect our profitability.\nAs previously reported, in fiscal 2024 we initiated a formal review of strategic alternatives for the Family Dollar business. On March 25, 2025, the Company entered into a definitive agreement to sell the Family Dollar business to Brigade Capital Management, LP and Macellum Capital Management, LLC, subject to regulatory review and other closing conditions. The pending sale of the Family Dollar business is subject to various risks and uncertainties that could adversely affect our business, financial condition and results of operations. We have expended and will continue to expend significant management time and resources and have incurred and will continue to incur significant expenses due to legal, advisory and financial services fees related to the sale. The majority of these expenses are payable by us regardless of whether the sale is consummated. Accordingly, if the pending sale of the Family Dollar business is delayed or is not completed on the terms set forth in the definitive purchase agreement or at all, our business, results of operations, financial condition, cash flows and/or stock price could be adversely affected.\nIn addition, the pendency and anticipated completion of the sale of the Family Dollar business may impose challenges on our business, including the diversion of management’s attention from ongoing business concerns; impacts on our resources, systems, procedures and controls; attracting, retaining and motivating key management and other employees; retaining existing, or attracting new, business and operational relationships, including with suppliers and other business counterparties; potential negative reactions from the financial markets and other unanticipated adverse impacts; any of which could adversely affect our business and financial condition. \nIf the pending sale of the Family Dollar business is completed, we may not achieve the anticipated benefits of the transaction, and the transaction may expose us to new risks.\nIf the pending sale of the Family Dollar business is completed, our operational and financial profile will change significantly, with the Dollar Tree banner comprising substantially all of our retail operations. Our company following the sale would be smaller and less diversified than exists today, and our exposure to the risks inherent in our remaining business would increase. Our diversification of revenues, costs and cash flows would diminish, such that our results of operations, cash flows, working capital, and financing requirements may be subject to increased volatility and vulnerability to changing market conditions. Further, there can be no assurance that our credit ratings, access to financial markets and potential sources of liquidity and/or cost of financing would not be adversely impacted following the sale. As a result, our ability to fund capital expenditures and investments, pay dividends and meet debt obligations and other liabilities may be diminished. Until the market has fully analyzed the value of the Dollar Tree banner as a separate company, the price of our common stock also may experience volatility.\n16\nTable of Contents\nIn addition, the sale of our Family Dollar business and other recent strategic initiatives entail significant changes across our organizational structure, senior leadership, culture, functional alignment, outsourcing and other areas. These changes have been and could continue to be disruptive to our business operations. Further, there can also be no assurance that the stranded costs or dis-synergies of such a transaction will not exceed the anticipated amounts. Any of the foregoing could have a material adverse effect on our business, results of operations, financial conditions and cash flows, and we cannot assure you that the Dollar Tree banner, as an independent company, will be successful. \nFurther, we expect to have continuing obligations to Family Dollar pursuant to transition services or other agreements in connection with the sale of the Family Dollar business, which could require significant management and operational resources or reduce our ability to fully realize cost savings and efficiency initiatives that we would otherwise be able to implement following such a disposition. While we anticipate receiving payment for the transition services that we provide, we may not be able to recoup all of the underlying costs.\nWe have incurred losses due to impairment of goodwill and other long-lived assets.\nUnder U.S. generally accepted accounting principles, we review our long-lived assets for impairment whenever economic events or changes in circumstances indicate that the carrying value of an asset may not be recoverable. Identifiable intangible assets with an indefinite useful life, including goodwill, are not amortized but are evaluated annually for impairment. An evaluation is also performed if events or circumstances indicate that impairment could have occurred.\nFor example, in the fourth quarter of fiscal 2023, we recorded a $1,069.0 million non-cash goodwill impairment charge and a $950.0 million non-cash trade name impairment charge resulting from our annual impairment testing and a $503.9 million non-cash store asset impairment charge related to our store portfolio optimization review. In the fourth quarter of fiscal 2024, we recorded a $490.5 million non-cash goodwill impairment charge and a $1,400.0 million non-cash trade name impairment charge resulting from our annual impairment testing and an $88.1 million store asset impairment charge. Additionally, in the fourth quarter of fiscal 2024, we determined that the Family Dollar business met the held for sale and discontinued operations accounting criteria and recognized an impairment of $3,438.8 million to reflect the write-down of the carrying value to fair value less costs to sell. The Family Dollar goodwill and trade name comprise a substantial portion of our goodwill and indefinite-lived intangible assets and management’s judgment utilized in the Family Dollar goodwill and trade name impairment evaluations is critical. Please refer to “\nCritical Accounting Estimates and Assumptions\n” in “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nShould we experience business challenges or significant negative industry or general economic trends, we could recognize additional impairments to our goodwill, intangible assets and other long-lived assets. We monitor key assumptions and other factors utilized in our impairment analysis, and if business or other market conditions develop that are materially different than we currently anticipate, we will conduct an additional impairment evaluation. Any reduction in or impairment of assets will result in a charge against earnings, which could have a material adverse impact on our reported results of operations and financial condition. \nWe make estimates and assumptions in connection with the preparation of our consolidated financial statements, and any changes to those estimates and assumptions could adversely affect our results of operations.\nIn connection with the preparation of our consolidated financial statements, we make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, as well as the disclosures of contingent assets and liabilities. Please refer to “\nCritical Accounting Estimates and Assumptions\n” in “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.” Our estimates are often based on complex judgments, probabilities and assumptions that management believes to be reasonable, but that are inherently uncertain and unpredictable and subject to changing conditions and other factors beyond our control. Accordingly, actual results could be significantly different from these estimates. \nFor example, our liabilities related to our self-insurance programs, which include general liability claims, are estimates that require judgment and the use of assumptions. As a result of unfavorable developments due to the rising costs to reimburse, settle, or litigate claims related to customer accidents and other incidents at our stores, our actuarially determined liabilities were increased during 2024, contributing to a $20.4 million increase in our general liability claim expenses compared to the prior year. Should these or any other estimates and assumptions change or prove to have been incorrect, it could adversely affect our results of operations. \nCybersecurity and Technology Risks\nWe rely on computer and technology systems in our operations, and any material failure, inadequacy, interruption or security failure of those systems, including because of a cyberattack, could harm our ability to effectively operate and grow our business and could adversely affect our financial results.\nWe rely extensively on our computer and technology systems and, in certain cases, those of third-party service providers to support nearly all key functions in our business, including managing inventory, operating our stores, processing credit card and customer transactions, managing our customer and associate relationships and summarizing results. Our ability to effectively manage \n17\nTable of Contents\nour business and coordinate the distribution and sale of our merchandise depends significantly on the capabilities, confidentiality, integrity and availability of these systems and on our ability to successfully acquire and integrate upgraded or replacement systems as needed to support our business requirements and strategic initiatives. We also rely on third-party providers and platforms for many of these computer and technology systems and support.\nAlthough we have operational safeguards in place, they may not be effective in preventing the failure of these systems or platforms to operate effectively and be available to us. This may be as the result of deliberate breach in the security of these systems or platforms by bad actors, including through malicious software, ransomware and other cyberattacks, which may originate from state actors and may increase during times of international tensions. Failures may also be caused by various other factors, including power outages, catastrophic events, physical theft, computer and network failures, inadequate or ineffective redundancy, obsolescence or failure of vendor support, flaws in third-party software or services, errors or improper use by our employees or third-party service providers.\nTo support the growth of our business, we are making substantial investments in our information technology systems. Transitioning to these new or upgraded processes and systems requires significant capital investments and personnel resources. Implementation is also highly dependent on the coordination of numerous associates, contractors and software and system providers. While these efforts have resulted in improvements to our operational systems, we expect to continue to incur expenses to implement additional improvements and upgrades to our systems. Many of these expenditures have been and may continue to be incurred in advance of the realization of any direct benefits to our business. We cannot guarantee that we will be successful at improving our operational systems, or that our efforts will result in the anticipated benefits to us. We may also experience difficulties in implementing or operating our new or upgraded operational or IT systems, including, but not limited to, ineffective or inefficient operations, significant system failures, system outages, delayed implementation and loss of system availability, which could lead to increased implementation and/or operational costs, loss or corruption of data, delayed shipments, excess inventory and interruptions of operations resulting in lost sales and/or profits. If our information technology systems, upgrades and associated change management are not adequate to support our business and our strategic initiatives, our financial condition and results of operations could be adversely affected, and our business may become less competitive.\nThe potential unauthorized access to our systems could disrupt operations or lead to the theft of data which may violate privacy laws and could damage our business reputation, subject us to negative publicity, litigation and costs, and adversely affect our results of operations or financial condition.\nMany of our information technology systems, such as those we use for our point-of-sale, web and mobile platforms, including online and mobile payment systems, and for administrative functions, including human resources, payroll, benefits, accounting, and internal and external communications, contain personal, financial, health-related or other confidential information that is entrusted to us by our customers and associates as well as proprietary and other confidential information related to our business and suppliers.\nWe are exposed to persistent and substantial risks from cybersecurity threats, as the number of cyberattacks targeting retailers and corporate networks grows, and the volume, intensity and sophistication of attempted attacks, intrusions and threats from around the world increase daily. Both we and our vendors have experienced data security incidents; however, to date, these incidents have not been material to our results of operations. The security measures that we and/or our third-party partners put in place cannot provide absolute security to prevent harm to our systems or safeguard our customers’ personal information (including debit and credit card information), our associates’ private data, suppliers’ data, and our business records and intellectual property and other sensitive information.\nCybercriminals, who may include well-funded state actors or organized criminal groups, are rapidly evolving their cyberattack techniques and tactics, which are becoming increasingly more sophisticated and challenging to detect. We and/or our third-party suppliers may be vulnerable to and unable to anticipate, detect, and appropriately respond to cybersecurity attacks, including data security breaches and data loss.\nWe are also subject to laws and regulations in various jurisdictions in which we operate regarding privacy, data protection and data security, including those related to the collection, storage, handling, use, disclosure, transfer and security of personal data of customers, associates, or others. These laws permit regulators to assess potentially significant fines for data privacy violations and may create a right for individuals to bring class action suits seeking damages for violations. Our efforts to comply with consumer privacy laws and other similar privacy and data protection laws may impose significant costs and challenges that are likely to increase over time, and we could incur substantial penalties or be subject to litigation related to violation of existing or future data privacy laws and regulations.\nLikewise, we are subject to the Payment Card Industry Data Security Standards (“PCI-DSS”) which is mandated by the card brands and administered through the Payment Card Industry Security Standards Council. As a Level 1 Merchant, we are subject to assessment and attestation for PCI-DSS compliance on an annual basis. A failure to meet and maintain compliance with PCI-DSS requirements could result in our inability to continue to accept credit cards as a form of payment, which would materially impact our ability to sell our products. In addition, our credibility and reputation within the business community and with our customers may be \n18\nTable of Contents\naffected, which could result in our customers discontinuing the use of debit or credit cards in our stores or not shopping in our stores altogether. Non-compliance with PCI-DSS requirements also may subject us to recurring and accumulating fines until compliance is achieved. Considerable investments to strengthen our information security could also be required should we ever be deemed to be non-compliant. We are currently in compliance with the PCI-DSS standards.\nMoreover, significant additional capital investments and other expenditures could also be required to continue to strengthen our overall cybersecurity posture and prevent future security breaches, including costs associated with additional security technologies, personnel, experts and services (e.g., notification and credit-monitoring services) for those whose data has been breached. These costs, which could be material, could adversely impact our results of operations in the period in which they are incurred and may not meaningfully limit the success of future attempts to breach our information technology systems.\nThe unavailability of information technology systems on which we rely or the failure of those systems or software to perform as required to support our business needs for any reason and any inability to respond to, or recover from, such events, could disrupt our business, decrease performance, and increase overhead costs. If we, our vendors, or other third parties with whom we do business experience significant data security incidents or fail to detect and appropriately respond to significant incidents, we could be subject to negative publicity, costly government enforcement actions or private litigation and increased costs. In addition, our customers could lose confidence in our ability to protect their information, stop using our applications or other programs, or stop shopping with us altogether. Any of these factors could have a material adverse effect on our reputation, results of operations or financial condition.\nLegal, Regulatory and Environmental, Social and Governance (“ESG”) Risks\nLegal proceedings may adversely affect our reputation, business, results of operations or financial condition.\nOur business is subject to the risk of litigation and other proceedings involving associates, consumers, suppliers, competitors, shareholders, government agencies, or others through private actions, class actions, derivative actions, governmental investigations, administrative proceedings, regulatory actions, arbitrations or other similar actions.\nIn addition, our operations and/or the products we sell are subject to regulatory oversight by the U.S. Food and Drug Administration (“FDA”), the U.S. Department of Agriculture, the Occupational Safety and Health Administration, states’ attorneys-general, and other federal, state, local and applicable foreign governmental authorities. Where such authorities believe that we have failed to comply with applicable regulations and/or procedures, they may require prompt corrective action, and/or proceed directly to other forms of enforcement action, including the imposition of operating restrictions, including a ceasing of operations in one or more facilities, enjoining and restraining certain violations of applicable law pertaining to products, seizure of products, assessing civil or criminal sanctions or penalties, and requiring enhancements to our compliance programs or reporting requirements. Any adverse regulatory action, depending on its magnitude, may restrict us from effectively selling our products and could have a material adverse effect on our business, financial condition and/or results of operations.\nFor example, in 2024 we resolved a previously disclosed investigation by the United States Department of Justice (the “DOJ”) regarding a historical rodent issue at Family Dollar’s West Memphis, Arkansas distribution center (“DC 202”) and the related adulteration of products regulated by the FDA. Under this resolution, a Family Dollar subsidiary pled guilty to a one count misdemeanor violation of Title 21, United States Code, Sections 331(k), 333(a)(1) for causing FDA-regulated products to become adulterated and paid $200,000 in fines and a forfeiture money judgment in the amount of $41,475,000 to the United States. For a discussion of other impacts of this resolution, see also \n“Our failure to comply with applicable law, or to adequately respond to changes to such laws, could increase our expenses, expose us to legal risks or otherwise adversely affect us”\n below.\nOur products could also cause illness or injury, harm our reputation, and subject us to litigation. Product liability, personal injury, consumer protection or other claims may be asserted against us relating to product adulteration, product tampering, mislabeling, recall and other safety issues with respect to the products that we sell, or with respect to our handling or storage of such products. Recent such matters have led to increased scrutiny of our operations by regulatory agencies, requiring further management attention and potential legal fees and other expenses. A significant product liability, consumer fraud, or other legal judgment against us, a related regulatory compliance or enforcement action or a product recall could materially and adversely affect our reputation, financial condition and/or results of operations. Moreover, even if a product liability, consumer fraud or other claim is unsuccessful, has no merit or is not pursued, the negative publicity surrounding assertions against the products we sell could materially and adversely affect our reputation. We seek but may not be successful in obtaining contractual indemnification from our vendors, where appropriate, or insurance coverage, and if we do not have adequate contractual indemnification or insurance available, such claims could adversely affect our business, financial condition and/or results of operations. Our ability to obtain the benefit of contractual indemnification from vendors may be hindered by our ability to enforce contractual indemnification obligations against such vendors, for example because the vendors are overseas or lack financial resources. Our litigation-related expenses could increase as well, which also could have a materially negative impact on our financial condition and/or results of operations even if a claim is unsuccessful or is not fully pursued.\n19\nTable of Contents\nThe outcome of such matters is often difficult to assess or quantify. Plaintiffs in these types of lawsuits or proceedings may seek recovery of very large or indeterminate amounts, and the magnitude of the potential loss may remain unknown for substantial periods of time. In addition, certain of these matters, if decided adversely to us or settled by us, may result in an expense that may be material to our consolidated financial statements as a whole or may negatively affect our operating results if changes to our business operations are required. If we experienced a material loss arising from these matters, we could also become subject to shareholder derivative suits and securities litigation. The cost to defend current and future litigation or proceedings, including arbitrations, may be significant. There also may be adverse publicity associated with litigation, including litigation related to product or food safety, customer information and environmental or safety requirements, which could negatively affect customer perception of our business, regardless of whether the allegations are valid or whether we are ultimately found liable.\nFor a discussion of current legal matters, please see “\nItem 3. Legal Proceedings\n” and \nNote 5\n to our consolidated financial statements under the caption “Contingencies.”\nOur failure to comply with applicable law, or to adequately respond to changes to such laws, could increase our expenses, expose us to legal risks or otherwise adversely affect us.\nWe operate in an increasingly regulated environment across a large and diverse geographic footprint, and we devote substantial resources to ensure effective compliance with numerous and frequently changing laws and regulations. The complexity of this regulatory environment and related compliance costs continue to increase due to additional legal and regulatory requirements, our expanding operations, and increased regulatory scrutiny and enforcement efforts. New or revised laws, regulations, orders, policies and related interpretations and enforcement practices, including product and food safety, marketing, labeling or pricing; information security and privacy; artificial intelligence; labor and employment; employee wages and benefits; health and workplace safety (including Occupational Safety and Health Administration rules); imports and customs; taxes; bribery; climate change; and environmental compliance, may significantly increase our expenses or require extensive system and operating changes that could materially increase our cost of doing business.\nIf our programs do not adequately anticipate regulatory expectations or requirements, or if we fail to appropriately design and maintain an effective enterprise compliance program and system of controls to prevent and detect non-compliance, including implementing and communicating a strong culture of compliance, there is a possibility any failure to comply with applicable laws and regulations would subject us to enhanced legal risks and adverse outcomes. Violations of applicable laws and regulations or untimely or incomplete execution of a required product recall can result in significant penalties (including loss of licenses, eligibility to accept certain government benefits such as SNAP or significant fines), class action or other litigation, governmental investigation or action and reputational damage. As part of our 2024 resolution of the DOJ investigation regarding DC 202, we agreed to implement improved internal controls, compliance codes, policies, and procedures, many of which were already underway or completed, and to make periodic reports to the DOJ for three years. The failure to properly manage our overall compliance program and fully comply with our obligations could adversely affect our ability to conduct business, result in significant fines and other penalties, damage our brand and reputation, and negatively impact our financial position and results of operations.\nNew laws and regulations could have an adverse effect on our business. For example, various municipalities have begun regulating the placement or proximity of our stores or may place requirements on labor relations or the types of products we sell. In addition, the adoption by certain jurisdictions of new or expanded environmental laws and regulations could significantly increase our operating or merchandise costs or reduce the demand for our products. These laws and regulations may include, but are not limited to, requirements relating to hazardous waste materials, recycling, single-use plastics, so-called “chemicals of concern,” extended producer responsibility, use of refrigerants, carbon pricing or carbon taxes, product energy efficiency, animal welfare standards and product labeling.\nIn addition, significant changes in laws or regulations that impact our relationship with our workforce, such as minimum wage increases, health care, labor relations laws or workplace safety, could increase our expenses and adversely affect our operations. An increase in federal corporate tax rates also could adversely affect our profitability. Changes in other regulatory areas, such as consumer credit, privacy and information security, product and food safety, energy or environmental protection, international labor protections, and tariff and other trade restrictions, among others, could cause our expenses to increase or result in product recalls.\nOur business is subject to evolving disclosure requirements and expectations with respect to environmental, social and governance matters that could expose us to numerous risks.\nOur business faces increasing public scrutiny related to social responsibility, climate change and other ESG practices. We risk damage to our brand and reputation, including risk to our plans for profitable growth, if we fail to act responsibly in a number of areas, such as worker safety and welfare, diversity and inclusion, environmental stewardship, support for local communities, and corporate governance and transparency. Conversely, if efforts around diversity, equity and inclusion (“DEI”) are perceived as too ambitious, we may be subject to investigations, litigation and other proceedings and our brand and reputation and stock price may be harmed. Adverse incidents could impact the value of our brand, the cost of our operations and relationships with associates, customers or investors, all of which could adversely affect our business and results.\n20\nTable of Contents\nIn addition, regulators, customers, investors, associates, and other stakeholders are focusing on ESG matters and related disclosures. These changing rules, regulations and stakeholder expectations have resulted in, and are likely to continue to result in, increased general and administrative expenses and increased management time and attention spent complying with or meeting such regulations and expectations. For example, developing and acting on initiatives within the scope of ESG, and collecting, measuring, and reporting ESG-related information and metrics can be costly, difficult and time consuming and is subject to evolving reporting standards. We may also communicate certain initiatives and goals regarding environmental matters, culture and belonging, responsible sourcing and social investments and other ESG-related matters, in our SEC filings or in other public disclosures. These initiatives and goals within the scope of ESG could be difficult and expensive to implement, the technologies needed to implement them may not be cost effective and may not advance at a sufficient pace, and we could be criticized for the accuracy, adequacy, or completeness of the disclosure. Further, statements about our ESG-related initiatives and goals, and progress toward those goals, may be based on standards for measuring progress that are still developing, internal controls and processes that continue to mature, and assumptions that are subject to change in the future. \nFurther, the Supreme Court’s recent ruling striking down race-based affirmative action in higher education has increased scrutiny of corporate diversity, equity and inclusion practices. Some groups and attorneys general have begun to analogize the outcome of that case to private employment matters, asserting that certain corporate DEI practices are racially discriminatory and unlawful. Anti-ESG and anti-DEI related policies, legislation, initiatives and scrutiny could expose us to the risk of litigation, investigations or challenges by federal or state authorities, result in injunctions, penalties and reputational harm and require certain investors to divest or discourage certain fund investors from investing in our funds.\nIf we are unable to meet our ESG-related goals or evolving stakeholder expectations and industry standards, if our ESG-related data, processes and reporting are incomplete or inaccurate, or if our efforts around ESG-related issues are perceived as insufficient or too ambitious, consumers may choose to stop purchasing our products or purchase products from a competitor, and our reputation, business or financial condition may be adversely affected.\nRisks Relating to Indebtedness and Our Common Stock\nOur inability to access credit or capital markets, a downgrade of our credit ratings and/or increases in interest rates could negatively affect our financing costs, results of operations and financial condition.\nWe rely on internally generated funds and borrowings under our credit facilities and commercial paper program to fund our seasonal working capital requirements for existing and new stores, distribution network programs and other capital projects. In addition, we have $3.45 billion of senior notes outstanding as of February 1, 2025, of which $1.0 billion matures in May 2025.\nOur continued access to financial markets depends on multiple factors, including market conditions, our operating performance and our credit ratings. Changes in the credit and capital markets, including as a result of financial market disruptions, rising interest rates, bank failures or other macroeconomic conditions, could increase the cost of financing or restrict our access to these potential sources of future liquidity. Further, our credit ratings impact the cost and availability of future borrowings and, accordingly, our cost of financing. Our ratings reflect the opinions of the ratings agencies of our financial strength, operating performance and ability to meet our debt obligations. A downgrade in our credit ratings could limit our access to credit and capital markets, limit the institutions willing to provide credit facilities to us, result in more restrictive financial and other covenants in our debt agreements and would likely significantly increase our overall financing costs and adversely affect our results of operations.\nIf we are unable to access financial markets when needed, on favorable terms or at all, whether to refinance our existing indebtedness on or before maturity or to fund our capital expenditures or working capital needs not satisfied by cash flows from operations, our results of operations or financial condition could be materially and adversely affected.\nIn addition, we have exposure to future interest rates based on variable rates under our revolving credit facility and issuances under our commercial paper program and to the extent we raise additional debt in the capital markets to meet maturing debt obligations or otherwise. Significant and sustained increases in market interest rates could materially increase our financing costs and negatively impact our reported results.\nOur business or the value of our common stock could be negatively affected as a result of actions by shareholders.\nWe value constructive input from investors and regularly engage in dialogue with our shareholders regarding strategy and performance. The Board of Directors and management team are committed to acting in the best interests of all our shareholders. There is no assurance that the actions taken by the Board of Directors and management in seeking to maintain constructive engagement with our shareholders will be successful. Shareholders who disagree with our strategy or the way we are managed may seek to effect change in the future, through various strategies that could include private engagement, publicity campaigns, proxy contests, and litigation. Responding to these actions may be costly and time-consuming, disrupt our operations, divert the attention of our Board of Directors, management, and associates, and impact our relationship with investors, vendors, and other third parties. Shareholder engagement also may result in changes to our business plans, operations, strategies, initiatives, governance, management, and risk \n21\nTable of Contents\nfactors. The perceived uncertainty as to our future direction resulting from these actions of shareholders could also affect the market price and volatility of our common stock.\nThe price of our common stock is subject to market and other conditions and may be volatile.\nThe market price of our common stock may fluctuate significantly in response to a number of factors. These factors, some of which may be beyond our control, include the perceived prospects and actual results of operations of our business; changes in estimates of our results of operations by analysts, investors or us; trading activity by our large shareholders; trading activity by sophisticated algorithms (high-frequency trading); our actual results of operations relative to estimates or expectations; actions or announcements by us or our competitors; litigation and judicial decisions; legislative or regulatory actions or changes; and changes in general economic or market conditions. In addition, the stock market in general has from time-to-time experienced extreme price and volume fluctuations. These market fluctuations could reduce the market price of our common stock for reasons unrelated to our operating performance.\nCertain provisions in our Articles of Incorporation and By-Laws could delay or discourage a change of control transaction that may be in a shareholder’s best interest.\nOur Articles of Incorporation and By-Laws contain provisions that may delay or discourage a takeover attempt that a shareholder might consider in his/her best interest. These provisions, among other things, provide that only the Board of Directors, the chairman or vice chairman of the Board, the chief executive officer or shareholders who own 15% or more of the outstanding shares of our common stock may call special meetings of the shareholders; establish certain advance notice procedures for nominations of candidates for election as directors and for shareholder proposals to be considered at shareholders’ meetings; and permit the Board of Directors, without further action of the shareholders, to issue and fix the terms of preferred stock, which may have rights senior to those of the common stock. However, we believe that these provisions allow our Board of Directors to negotiate a higher price in the event of a takeover attempt which would be in the best interest of our shareholders.\nItem 1B. Unresolved Staff Comments\nNone.\nItem 1C. Cybersecurity\nRisk Management and Strategy\nWe understand the importance of cybersecurity in maintaining the confidentiality, integrity, and availability of our systems and data. Our business operations leverage information technology infrastructure and third-party vendors and systems which makes us susceptible to various cyber threats. We have implemented a comprehensive cybersecurity risk management program to mitigate these risks and safeguard our assets.\nWe have measures in place to prevent, detect, and manage material risks from unauthorized access to our electronic information systems. These include various controls, technologies, and processes that protect confidential, proprietary, business and personal information that we collect, process, store, and transmit as part of our business operation.\nWe also consider cybersecurity, along with other business risks, within our enterprise risk management framework. Our assessment, identification and management of cybersecurity and data privacy risks are reported as part of our regular enterprise risk assessments, security audits and risk management programs. In addition, we leverage recognized consulting firms to conduct application security and penetration testing assessments annually. We also require employees with access to information systems, including all corporate employees, to undertake cybersecurity training and compliance programs annually. \nOur cybersecurity program utilizes the National Institute of Standards and Technology framework along with risk-based analysis and judgment, to choose the most effective security controls to address potential risks. We consider various factors such as likelihood and severity of risk, impact on our organization and others if a risk materializes, feasibility and cost of controls, and the effects of controls on our operations and others.\nBecause \nwe rely on third-party providers\n and platforms for many of our computer and technology systems and support, we use a variety of processes and tools to address cybersecurity threats related to the use of third-party technology and services, including pre-acquisition diligence, imposition of contractual obligations, and performance monitoring. \nAs a part of our monitoring, we regularly obtain System Organization and Control Reports (SOC Reports) for key third-party financial systems.\nAs part of our overall strategic initiatives, we have made investments in internal and external resources to support and enhance our technology infrastructure over the next several years. As part of this technology transformation, we plan to continue to invest in our information security team, enhance our cyber response plan and data privacy policies and evolve our third-party risk management program. In addition, in connection with our strategic review of the Family Dollar business, we are conducting a comprehensive \n22\nTable of Contents\nreassessment of our cybersecurity posture. This evaluation focuses on how these changes affect our people, processes, and technologies. By doing this, we ensure the ongoing protection of sensitive data and critical assets, while also maintaining alignment with our security standards.\nNo material cybersecurity incidents occurred in fiscal 2024,\n but future incidents cannot be predicted. Additionally, in “"
}