{
  "ticker": "DOV",
  "cik": "0000029905",
  "company_name": "DOVER Corp",
  "filing_date": "2025-02-14",
  "accession": "0000029905-25-000006",
  "primary_doc": "dov-20241231.htm",
  "item1_text": "Item 16.\nForm 10-K Summary\n113\nSIGNATURES\n114\n3    \nTable of Contents\nPART I\nITEM 1.  BUSINESS\nOverview\nDover Corporation is a diversified global manufacturer and solutions provider delivering innovative equipment and components, consumable supplies, aftermarket parts, software and digital solutions and support services through five operating segments: Engineered Products, Clean Energy & Fueling, Imaging & Identification, Pumps & Process Solutions, and Climate & Sustainability Technologies. Unless the context indicates otherwise, references herein to \"Dover,\" \"the Company,\" and words such as \"we,\" \"us,\" or \"our\" include Dover Corporation and its consolidated subsidiaries. Dover was incorporated in 1947 in the State of Delaware and became a publicly traded company in 1955. Dover is headquartered in Downers Grove, Illinois and currently employs approximately 24,000 people worldwide.\nDover's five segments are structured around businesses with similar business models, go-to-market strategies, product categories, and manufacturing practices. This structure increases management efficiency and better aligns Dover's operations with its strategic initiatives and capital allocation priorities, and provides greater transparency about performance to external stakeholders. Dover's five operating and reportable segments are as follows: \n•\nOur Engineered Products segment provides a wide range of equipment, components, software, solutions and services to the vehicle aftermarket, aerospace and defense, industrial winch and hoist, and fluid dispensing end-markets. \n•\nOur Clean Energy & Fueling segment provides components, equipment, software solutions and services enabling safe and reliable storage, transport and dispensing of traditional and clean fuels (including liquefied natural gas, hydrogen, and electric vehicle charging), cryogenic gases, and other hazardous substances along the supply chain, and safe and efficient operation of convenience retail, retail fueling and vehicle wash establishments. \n•\nOur Imaging & Identification segment supplies precision marking and coding, product traceability, brand protection and digital textile printing equipment, as well as related consumables, software and services to the global packaged and consumer goods, pharmaceutical, industrial manufacturing, textile and other end-markets.\n•\nOur Pumps & Process Solutions segment manufactures specialty pumps and flow meters, fluid transfer connectors, highly engineered precision components, instruments and digital controls for rotating and reciprocating machines, and polymer processing equipment, serving single-use biopharmaceutical production, diversified industrial manufacturing applications, chemical production, plastics and polymer processing, midstream and downstream oil and gas, clean energy markets, thermal management, food and beverage, semiconductor production and medical applications and other end-markets. \n•\nOur Climate & Sustainability Technologies segment is a provider of innovative and energy-efficient equipment, components, solutions, services and parts for the commercial refrigeration, heating and cooling and beverage can-making equipment end-markets.\nDiscontinued Operations\nOn October 8, 2024, the Company completed the sale of the Environmental Solutions Group (\"ESG\") business, an operating company within the Engineered Products segment, for total consideration, net of cash transferred, of $2.0 billion. As the disposal represented a strategic shift with a major effect on the Company's operations and financial results, the Company has classified ESG's results of operations prior to the sale as discontinued operations for all periods presented. The discussion throughout Item 1 of this Form 10-K, unless otherwise noted, relates solely to our continuing operations. For more details, see Note 4 — Discontinued and Disposed Operations in the consolidated financial statements in Item 8 of this Form 10-K.\n4    \nTable of Contents\nManagement Philosophy \nDover is committed to delivering shareholder value creation through a combination of sustained profitable growth, operational excellence, superior free cash flow generation and productive capital re-deployment while adhering to a conservative financial policy. Dover seeks to be a leader in a diverse set of growing markets where customers are loyal to trusted partners and suppliers, and value product performance and differentiation driven by superior engineering, manufacturing precision, total solution development and excellent supply chain performance. Our businesses are long-time leaders in their respective markets and are known for their innovation, engineering capability and customer service excellence. We aim to continue growing our businesses from this strong foundation. \nOur operating structure of five business segments allows for a differentiated acquisition focus consistent with our portfolio and capital allocation priorities. We believe our business segment structure, coupled with value-creating functional expertise at our lean corporate center, presents opportunities to identify and capture operating synergies, such as global sourcing and supply chain integration, centralized shared services, cross-pollination of manufacturing best practices, and further advances the development of our executive talent. Our executive management team sets strategic direction, initiatives and goals, develops effective incentive structures, provides oversight of strategy execution and achievement of these goals for our business segments, and with oversight from our Board of Directors, makes capital allocation decisions, including with respect to organic investment initiatives, major capital projects, acquisitions, divestitures, and the return of capital to our shareholders. \nOur goal is to foster an operating culture with high ethical and performance standards that values accountability, rigor, trust, inclusion, respect and open communications, designed to allow individual growth and operational effectiveness. We are also increasing our focus on maintaining sustainable business practices that reduce environmental impact, and developing products that help our customers meet their sustainability goals. \nCompany Goals\n \nWe are committed to driving superior shareholder returns through three key tenets of our corporate strategy. \nFirst\n, we are committed to achieving organic sales growth above that of gross domestic product (4% to 6% annually on average) over a long-term business cycle, absent prolonged adverse economic conditions, complemented by growth through strategic acquisitions. \nSecond\n, we continue to focus on improving returns on capital, as well as earnings margin, by enhancing our operational capabilities and making investments across the organization in growth capacity expansion, digital capabilities, automation, operations management, information technology (\"IT\"), shared services (including Dover Business Services and our India Innovation Center), and talent. We also focus on continuous, effective cost management and productivity initiatives, such as supply chain optimization, automation and productivity capital expenditures, e-commerce and digital go-to-market, restructuring, product complexity reduction, improved footprint utilization, strategic pricing and portfolio management. \nThird\n, we aim to generate growth in free cash flow and earnings per share through strong earnings performance, productivity improvements and active working capital management, which is enhanced by opportunistic divestitures allowing for concentration on growing our core platforms. Dover prioritizes deploying free cash flow toward high-return and high-confidence organic reinvestments aimed at growing, improving and strengthening our businesses, as well as through inorganic investments that synergistically enhance the quality of our portfolio. Dover's value creation strategy is supported by a financial policy that includes a prudent approach to financial leverage, and a disciplined approach to capital allocation that allows for a balance between reinvestment and return of capital to shareholders through growing dividends and opportunistic share repurchases. \nWe support achievement of these goals by (1) aligning management compensation with strategic and financial objectives, (2) actively managing our portfolio to increase enterprise scale, improving business mix over time to markets with secular growth characteristics, and pursuing acquisitions that fit the characteristics of an ideal Dover business and (3) investing in talent development programs.\n5    \nTable of Contents\nCharacteristics of a Dover Business\nFor over 70 years, Dover has successfully and profitably operated a diversified portfolio of high-quality businesses serving a wide variety of industrial and business-to-business end markets with different business models. We believe this diversity is a strength of our portfolio, providing Dover with multiple avenues for organic and inorganic growth, lower cyclicality, and the ability to extract synergies of common ownership. While we expect our portfolio to remain diversified, we also strive to shape the portfolio over time to increase common attractive attributes across our businesses. \nDover is adept at operating businesses within two core operating models:\n•\nComponent Businesses\n: Many of our businesses produce critical components that represent a small portion of a larger system by cost. For example, our industrial and biopharma pumps, biopharma connectors, engineered bearings and compression components, clean energy components, and heat exchangers are all part of larger systems built or employed by our customers. Such components typically serve demanding applications where value-in-use and costs and risks of switching far exceed the cost of the component itself. \n•\nEquipment with Aftermarket Opportunity\n: Many of our businesses produce complex and highly engineered equipment and systems that require a significant and predictable volume of parts, consumables, software and services over their life cycle. For example, our marking and coding equipment, plastics and polymer processing equipment and aluminum can-making equipment all derive a significant share of revenue and profits from sale of consumables, parts and services into their large installed base. Recurring demand, which includes parts, consumables, services and software, represents approximately 36% of our revenue. \nWe see the following commonalities characterizing the majority of Dover businesses:\n•\nAttractive Markets\n: Our businesses generally operate in strategically attractive niche industrial markets with proven and well-understood long-term growth trends, favorable customer and supplier landscapes, mature and incrementally improving technologies with opportunities for technological differentiation, and highly loyal customers, suppliers or channel partners.\n•\nLeading Positions\n: Our businesses are long-time leaders in their respective markets and have consistently enjoyed customer bases that choose products primarily based on their performance, track record, safety and compliance. \n•\nDigital Opportunity\n: Our equipment and components are often complemented by value-added digital applications, including connected products, sensors, digital controls and industry-specific software that create new sources of value for our customers.\n•\nAttractive Financial Profile\n: Our businesses exhibit attractive financial profiles, characterized by predictable, stable revenue, low capital intensity, strong cash-flow and sustainable returns on invested capital well in excess of our cost of capital. \nBusiness Strategy \nDover seeks to create value for shareholders by combining the global scale and capabilities, as well as access to capital, of a diversified industrial enterprise with the agility and entrepreneurial dynamism of niche manufacturing businesses. We believe the centralized scale of the corporation provides a distinct competitive advantage to our individual operating businesses through (i) driving efficiency gains and economies of scale of shared global resources across the corporation, (ii) freeing management time and effort to focus on the most important aspects of their businesses, including servicing and addressing the critical needs of their customers, aligning their business to capitalize on key market trends and focusing on product excellence, and (iii) access to centralized talent and expertise that our individual operating businesses otherwise may not have on their own. To achieve our stated goals, we are focused on executing the following pillars of Dover's business strategy: \nCapturing growth potential in our end-markets and adjacent market segments\nDover’s business segments are focused on building enduring competitive advantages and leadership positions in markets we believe are positioned for sustained future growth. We believe our businesses are among the top suppliers in most markets and niches we serve (as defined by customer applications, geographies or products), which positions us well to capture future growth. We capitalize on our engineering, intellectual property, technology and design expertise, and maintain an intense focus on meeting the needs of our customers and on adding significant, and often new, value to their operations through \n6    \nTable of Contents\nsuperior product performance, safety, reliability, and a commitment to aftermarket support. We cultivate and maintain an entrepreneurial culture to enable business agility, and continuously innovate to address our customers' needs, to help them win in the markets they serve.\nIn particular, our businesses are well-positioned to capitalize on: growing industrial manufacturing and trade volumes; an increased global focus on digitization and automation in industrial processes; increasing requirements for sustainability, safety, energy efficiency and consumer product safety; and growth of the middle class and consumption in emerging economies. \n•\nOur Engineered Products segment is capitalizing on global infrastructure investment, an increasing number of vehicles in operation, average car age and annual miles driven, increasing digitization and sensorization of modern vehicles, as well as growing defense spending related to signal intelligence and electronic warfare.\n \n•\nOur Clean Energy & Fueling segment benefits from the worldwide growth in environmental safety and compliance regulations, new infrastructure build-out in emerging economies, transition to clean energy products such as liquefied natural gas and hydrogen, growth in demand for cryogenic gases and electric vehicle charging, consolidation in the convenience retail sector, increased digitization of convenience stores and fuel retailing, as well as secular growth in automated vehicle wash systems and solutions (over manual and do-it-yourself washing). \n•\nOur Imaging & Identification segment leverages its unique product offering containing equipment, consumables, software and services to address market needs and requirements, including increased regulation for supply chain transparency in fast moving consumer goods, adoption of more stringent food safety regulations in emerging economies, and growing demand for product traceability and brand protection. \n•\nOur Pumps & Process Solutions segment is focused on capturing growth in its installed base, in biological drug production and the shift toward single-use manufacturing processes. The segment's offerings address the increased demand for liquid cooling requirements for certain electronics (including in data center infrastructure), and investment in midstream energy and power generation infrastructure (including growing sophistication of fluid transfer and rotating machinery components, instrumentation, and digital controls). We also support virgin, recycled plastics, and polymers production and energy transition investments into wind power, hydrogen compression and carbon capture. \n•\nOur Climate & Sustainability Technologies segment is responding to our customers' demand for increased energy efficiency and sustainability in food retail merchandising solutions, including refrigeration systems using CO\n2 \nrefrigerant, as well as increasing demand for sustainable heating and cooling solutions, including heat pumps, and sustainability-driven growing global demand for aluminum beverage cans.\nWe aim to capture growth by making organic investments in capacity expansion, automation and productivity improvement, research and development, developing new products and technologies, improving digital capabilities and expanding our geographic coverage. We pursue a disciplined and strategic approach to acquisitions aiming to enhance the quality and attractiveness of our portfolio over time and position Dover for long-term growth. We evaluate acquisition opportunities across the portfolio where we see the greatest runway for value-creating inorganic capital deployment. We continually evaluate how our assets and capabilities can position us to grow in markets adjacent to our core businesses (for example, new applications, geographies, product segments or adjacent technologies) where we can be advantaged.\nIn addition to product innovation, we aim to capture growth by developing digital technologies. Our Boston-based Dover Digital Labs serves as the company-wide hub for our digital initiative. We have continued to invest in this facility and our team of software developers, data scientists, and product managers to enhance our digital capabilities. The Digital Labs team is driving digital transformation across our businesses in four areas: (i) enhancing the customer experience through more efficient and streamlined digital customer interfaces that make it easy to do business with Dover companies; (ii) developing and improving acquired and organically built connected and software-as-a-service (\"SaaS\") products, that combine sensors, software, machine learning and artificial intelligence; (iii) driving increased efficiency, safety and quality in our manufacturing operations by employing cutting-edge automation through \"connected factory\" and \"data quality\" programs; and (iv) ensuring security of digital products. Many of our software solutions in the areas of product traceability, anti-counterfeiting, retail fueling station monitoring, vehicle damage analysis and measurement systems, and visual commerce have been certified as compliant under AICPA System and Organization Controls 2 (\"SOC 2\") audits. We believe the Digital Labs’ contributions in these areas enable us to add significant value to our products and to capture commercial growth opportunities. By leveraging a central resource for Commercial Excellence, Industry 4.0, Industrial Internet of Things (\"IIoT\") and our software products, we are able to capture efficiencies in our digital transformation efforts, improve product \n7    \nTable of Contents\nsecurity, and offer better efficiency in providing support and engineering for our software and connected products to keep our projects cost-competitive.\nImproving profitability and return on invested capital\nWe are committed to generating sustainable returns on invested capital well above the cost of capital across all of our businesses. We continually evaluate and pursue opportunities to improve efficiency, margin and return on capital. We are intensely foc\nused on driving operational excellence across our businesses. We have implemented numerous productivity initiatives to maximize our efficiency, such as supply chain integration, shared services, lean manufacturing principles and production automation, footprint optimization, and product complexity reduction, as well as workplace safety initiatives to help ensure the health and welfare of our employees. Our businesses place a strong emphasis on continual product quality improvement and new product development to better serve customers and to facilitate expansion into new products and geographic markets. \nWe also focus on margin expansion initiatives designed to reduce our selling, general and administrative cost base and optimize our manufacturing and supply chain operations across the portfolio. We continually expand initiatives to extract productivity gains across the businesses and realize savings. Our margin expansion initiatives are focused on four core enterprise capabilities: (1) leverage our Digital Labs team to enhance our internal and market-facing digital capabilities, (2) improve utilization and optimization of our manufacturing footprint through centralized resources and investment, (3) further centralize shared services under Dover Business Services, and (4) invest in our India Innovation Center shared services.\nDover Digital\n.\n \nOur Dover Digital Labs consists of a team of approximately 150 software developers, data scientists, manufacturing engineers and product managers who provide digital capabilities to enhance the customer experience, develop connected industrial products and artificial intelligence based models that are embedded in SaaS offerings provided to customers by our operating companies, drive automation and efficiency inside our factories through digital technologies and in our business processes and focus on the security of our digital products. Our Dover Digital Labs team has built common platforms which are being deployed on customer facing applications to make it easier to discover, find, configure, buy and obtain products and services from Dover companies, thereby optimizing our sales and support staff resources, driving pricing discipline, enabling reduction of product complexity and improving management of working capital. Our digital team has also deployed shared IIoT capability such that many of Dover's products are remotely configurable and monitored, enabling our businesses to sell aftermarket parts and offer remote diagnostic services. \nDover Operational Excellence\n. Our corporate team is composed of functional experts in operational optimization, lean manufacturing, automation, Environment, Health and Safety (\"EHS\") and complex project management. This team works closely with our businesses to drive excellence in our manufacturing and supply chain processes, standards and measurement tools to identify, prioritize and monitor execution of operational improvement initiatives. We continue to focus on initiatives to improve operational performance and the continuous improvement programs embedded in our businesses' day-to-day operations.\nDover Business Services\n. We continue to invest in Dover Business Services shared service centers, consisting of a team of approximately 700 professionals, to provide important transactional and value-added services to our businesses. Our shared service model allows us to leverage scale across Dover, increase process efficiencies through technology and specialization, and reduce risk through centralized controls. Our shared service centers create value by freeing resources within our businesses that would otherwise be dedicated to transactional services and allowing them to focus on customers, markets and product excellence. We expect to continue driving efficiencies through Dover Business Services as we increase the level of service centralization across the portfolio.\nIndia Innovation Center\n. Our India Innovation Center has a team of approximately 800 engineers and IT professionals that our businesses rely on to leverage for product engineering, digital solutions development, data and information management, research and development and intellectual property services. The scale of this team allows our businesses to access resources with capabilities and expertise across many disciplines that would be more costly to them as stand-alone companies, and allows for concurrent engineering on time sensitive projects.\n \n8    \nTable of Contents\nWe have been steadily investing in the build out and deployment of the above four enterprise capabilities in the past several years, including organically investing and expanding the staff of experts and support personnel in key centers of excellence globally.\nDisciplined capital allocation and continuous portfolio enhancement \nWe are focused on the most efficient allocation of capital to maximize returns on investment. To do this, we utilize organic reinvestment to grow and strengthen our existing businesses. We plan to make average annual investments in capital spending of approximately 2% of revenue with a focus on internal projects designed to expand our market participation and manufacturing capacity, drive further adoption of e-commerce and digital capabilities, and improve productivity. In addition, we seek to deploy capital for acquisitions in attractive growth areas across our portfolio. Dover focuses primarily on bolt-on acquisitions, applying strict selection criteria of market attractiveness (including growth, market landscape, and performance-based competition), business fit (including sustained leading position, revenue visibility, and favorable customer value-add versus switching cost or risk) and financial return profile (including accretive growth and margins and double-digit return on invested capital). We opportunistically divest businesses where we see limited runway for future value creation relative to our aspirations, or where market and business fundamentals change and no longer suit our criteria of business attractiveness and portfolio fit. Finally, we have consistently returned cash to shareholders by paying dividends, which have increased annually over each of the last 69 years. We undertake opportunistic share repurchases as part of our capital allocation strategy. We employ a prudent financial policy to support our capital allocation strategy, which includes maintaining an investment grade credit rating. \nPortfolio Development \nAcquisitions\n \nOur acquisition strategy aims to enhance our existing portfolio through value creating acquisitions within our priority growth platforms, with a focus on increasing our exposure to high organic growth and margin accretive businesses with significant synergy potential. We seek to acquire complementary add-on businesses with a strong fit with our existing platforms, increasing their reach and customer access, broadening their product mix, providing exposure to attractive end market adjacencies, or enhancing technological capabilities and customer value-add. With all our acquisitions, we seek businesses that are leaders in their respective markets or niches, have a strong track record for innovation, offer differentiated solutions, and have attractive and sustainable returns with significant synergy potential. We aim to generate double-digit return on capital within three or four years after an acquisition is completed.\nOver the past three years (2022 through 2024), we have spent approximately $1.5 billion, net of cash acquired and including contingent consideration, to purchase thirteen businesses. For more details, see Note 3 — Acquisitions in the consolidated financial statements in Item 8 of this Form 10-K. \nOur future growth depends in large part on finding and acquiring successful businesses that expand the scope of our offerings and make us an even more important supplier to our customers. While we expect to generate annual organic revenue growth above that of gross domestic product (4% to 6% annually on average) over a long-term business cycle absent extraordinary adverse economic conditions, our success in consistently growing the portfolio is also dependent on the ability to acquire and integrate businesses within our existing structure. To track post-merger integration and accountability, we utilize an internal scorecard and well-defined processes to help ensure expected synergies are realized and value is created.\nDispositions\n \nFrom time to time, we have sold or divested some of our businesses based on changes in specific market outlook, structural changes in financial performance, value-creation potential, or for other strategic considerations, which include an effort to reduce our exposure to cyclical and capital intensive markets and, therefore, focus on our higher margin and higher growth spaces.\nGoing forward, we recognize that some businesses in Dover's portfolio may have a greater value-creation potential if owned by another parent with a larger presence and focus on a given niche. We pragmatically consider such opportunities as part of our ongoing portfolio management and review processes, and execute divestitures if the value created by the divestiture is \n9    \nTable of Contents\ndetermined to be at an appropriate premium to the value of such business to Dover and the divestitures allow Dover shareholders to participate in the future value-creation potential from a change in ownership, including through the redeployment of divestiture proceeds into attractive add-on businesses in higher priority end-markets or through opportunistic return of capital to shareholders. \nDuring 2022 and 2023, there were no material dispositions. \nOn March 31, 2024, the Company completed the sale of the De-Sta-Co business, an operating company within the Engineered Products segment, for total consideration, net of cash transferred, of $675.9 million. The sale did not meet the criteria to be classified as a discontinued operation, as it did not represent a strategic shift that would have a major effect on operations and financial results. \nOn October 8, 2024, the Company completed the sale of the ESG business, an operating company within the Engineered Products segment, for total consideration, net of cash transferred, of $2.0 billion, subject to standard working capital adjustments. As the disposal represented a strategic shift with a major effect on the Company's operations and financial results, the sale met the criteria to be classified as a discontinued operation. For more details, see Note 4 — Discontinued and Disposed Operations in the consolidated financial statements in Item 8 of this Form 10-K.\nBusiness Segments \nAs noted previously, Dover's five segments are structured around businesses with similar business models, go-to-market strategies and manufacturing practices and product categories which increases management efficiency and better aligns Dover's operations with its strategic initiatives and capital allocation priorities, and provides greater transparency about performance to external stakeholders. Dover's five operating and reportable segments are as follows: Engineered Products, Clean Energy & Fueling, Imaging & Identification, Pumps & Process Solutions and Climate & Sustainability Technologies. For financial information about our segments and geographic areas, see Note 19 — Segment Information in the consolidated financial statements in Item 8 of this Form 10-K. \nEngineered Products\nOur Engineered Products segment provides a wide range of equipment, components, software, solutions and services that have broad customer applications across a number of markets, including: aftermarket vehicle service, aerospace and defense, industrial winch and hoist, and fluid dispensing. Our vehicle service business provides equipment, software solutions and services used primarily in vehicle repair and maintenance, including light and heavy-duty vehicle lifts, wheel service equipment, vehicle diagnostics and vehicle collision repair solutions. Our industrial winch and hoist business provides a range of winches, hoists, bearings, drives, and electric monitoring systems for infrastructure and other industrial markets. Our aerospace and defense business supplies radio frequency and microwave filters and switches, as well as signals intelligence and other integrated solutions, to enable secure communications in aerospace and defense applications. The segment also includes bench top soldering and fluid dispensing solutions in electronics and industrial product assembly markets.\nOur Engineered Products segment's products are manufactured primarily in North America, Europe and Asia and are sold throughout the world directly and through a network of distributors.\nClean Energy & Fueling\nOur Clean Energy & Fueling segment provides components, equipment and software, and service solutions enabling safe storage, transport, handling and dispensing of clean and traditional fuels, cryogenic gases and other hazardous fluids, as well as safe and efficient operation of retail fueling and vehicle wash establishments across the globe. Among solutions supplied by the segment are dispensing equipment and components for gasoline, compressed natural gas (CNG), liquefied natural gas (LNG) and hydrogen (H2) fueling sites, electric vehicle charging stations, payment systems, hardware and underground containment systems, vehicle wash systems, as well as asset tracking, monitoring and operational optimization software.\nOur Clean Energy & Fueling segment's products are manufactured primarily in North America, Europe, Asia, and South America and are sold throughout the world directly and through a network of distributors.\n10    \nTable of Contents\nImaging & Identification\nThe companies in our Imaging & Identification segment are global suppliers of precision marking and coding, product traceability, brand protection, and digital textile printing equipment and solutions, as well as related consumables, software and services. Our marking and coding businesses primarily design and manufacture equipment and consumables used for printing variable information (such as bar codes, dates, and serial numbers) on fast-moving consumer goods, provide serialization solutions for pharmaceutical customers, and develop supply chain traceability solutions capitalizing on expanding food and product safety, supply chain traceability and brand protection requirements. \nIn addition, our businesses serving the digital printing market develop, manufacture and sell equipment, software, consumables and service solutions used in textile, apparel, soft signage and specialty materials markets. Businesses within this segment leverage digital printing capabilities and operate business models that involve initial equipment and software sales followed by significant consumable, software and service aftermarket revenue streams.\nOur Imaging & Identification segment's products are manufactured primarily in North America, Europe and Asia and are sold throughout the world directly and through a network of distributors.\nPumps & Process Solutions\nThe businesses in our Pumps & Process Solutions segment manufacture specialty pumps, single-use pumps, connectors and flow meters, plastics and polymers processing equipment and highly-engineered components, specialized instrumentation and digital controls for rotating and reciprocating machinery. The segment's products are used in a wide variety of markets, including biopharma, thermal management (including liquid cooling of server racks and chips in data centers), plastics and polymers processing, chemicals production, food/sanitary, medical, transportation, petroleum refining, natural gas compression, power generation and general industrial applications. The products in this segment are generally used in demanding and specialized operating environments with high performance requirements. Businesses within this segment share the following commonalities: their products are predominantly components or parts of larger equipment and production systems with our products often specified by end customers or regulations, they participate in markets with a diverse and fragmented customer base and where there is a significant demand for aftermarket equipment and parts from a large installed base, and the route-to-market is a mix of distribution and direct sales.\nOur Pumps & Process Solutions segment's products are manufactured primarily in North America, Europe, and Asia and are sold throughout the world directly and through a network of distributors and original equipment manufacturers.\nClimate & Sustainability Technologies\nOur Climate & Sustainability Technologies segment is a provider of innovative and energy-efficient equipment, systems and solutions that serve the commercial refrigeration, heating and cooling, and aluminum can-making equipment end-markets. Our refrigeration business manufactures refrigeration systems (including environmentally friendly systems like CO\n2\n), refrigeration display cases and commercial glass refrigerator and freezer doors for food retail and industrial applications. Our heat exchanger business manufactures energy-efficient brazed plate heat exchangers used for residential climate control applications, including heat pumps, as well as industrial heating and cooling applications, including an increasing opportunity in data center cooling applications. The other business in this segment designs and manufactures machinery and associated spare parts used for aluminum can-making, along with providing turnkey can line solutions. The majority of the products that are manufactured or serviced by the Climate & Sustainability Technologies segment are used by the retail food industry, including supermarkets, \"big-box\" retail and convenience stores, the commercial/industrial refrigeration and HVAC industry, food production markets and beverage can-making industries. \nOur Climate & Sustainability Technologies segment's products are manufactured primarily in North America, Europe and Asia and are sold globally, directly and through a network of distributors.\n11    \nTable of Contents\nRaw Materials \nWe use a wide variety of raw materials, primarily metals and semi-processed or finished components, which are generally available from a number of sources. As a result, the loss of any single supplier has not had, and is not likely to have, a material impact on operating profits at the consolidated level. While the required raw materials are generally available, commodity pricing can be volatile, particularly for various grades of steel, copper, aluminum and select other commodities. Although cost increases in commodities may be recovered through increased prices to customers, our operating results are exposed to such fluctuations. We attempt to control such costs through index-based contracts with suppliers and customers and various other programs, such as our global supply chain activities. \nMarkets for multiple raw materials saw significant volatility and supply chain disruptions throughout 2021 into 2023. Although most commodity and logistics costs have returned to historical norms, volatility is still a risk due to economic uncertainties and supply side dynamics. These situations could still negatively impact profitability of some businesses as we were required to seek alternative sources of supply at higher costs or interrupt our normal manufacturing process flow leading to less efficient output and cost.\nResearch and Development \nOur businesses invest to develop innovative new products, as well as to upgrade and improve existing products, to satisfy customer needs, including demand for energy-efficient products designed to help customers meet sustainability goals, expand revenue opportunities geographically, maintain or extend competitive advantages, improve product reliability and reduce production costs.\nOur Imaging & Identification segment expends significant effort in research and development because the rate of product development by their customers is often quite high. Our businesses that develop product identification, printing equipment and software solutions believe their customers expect a continuing rate of product innovation, performance improvement and reduction in total cost of ownership. The result has been downward pricing trends that can only be mitigated with the continuous introduction of innovative product solutions in a market where product life cycles generally average less than seven years.\nOur \nClean Energy & Fueling\n segment invests in research and development to advance innovative traditional and alternative fuel dispensing equipment and components, payment platforms, fuel site asset management and connectivity solutions, IIoT-enabled cloud-based connected solutions for retail and commercial fleet fueling settings, components for high-criticality cryogenic gas storage and transportation applications, including hydrogen and liquefied natural gas. These technology investments align with our customer's needs and our commitment to delivering to our customers opportunities for operational cost reductions, increased sales, and an enhanced customer experience for their customers through a combination of intelligent fueling and retail solutions.\nOur Pumps & Process Solutions segment invests in research and development for new product introduction and custom solutions to drive volume and share in both existing markets and newer/faster growth markets – such as single-use biopharmaceutical manufacturing and liquid cooling of high performance electronics. These investments will allow us to take advantage of existing growth trends such as in cell and gene therapy applications, and data center cooling applications supporting investments in artificial intelligence.\nMany of our businesses are also involved in important product improvement initiatives. These businesses concentrate on working closely with customers on specific applications, expanding product lines and market applications and continuously improving manufacturing processes. Some of these businesses experience a much more rapid rate of change requiring higher product development capability and new product introduction.\nSimilarly, our businesses invest in research and development to pursue digital strategies based on customer needs and leverage the capabilities of the Dover Digital Labs to deliver on those digital strategies. For example, OPW, an operating company within the Clean Energy & Fueling segment, announced the launch of its RegO Presto-Link\n© \ndevice and RegO application integration during 2024. This application streamlines testing processes and enhances safety measures for on-site personnel performing the liquefied petroleum gas container and regulator testing. The RegO application is integrated with the Presto-Link Bluetooth device, which communicates with RegO Presto-Tap products placed on propane-system components \n12    \nTable of Contents\nrequiring testing. This connection enables swift and precise leak detection and pressure readings, eliminating the need for manual recording of results and mitigating the risks associated with human error.\nHuman Capital Resources\nOur employees are our most valuable asset and are critical to our ability to deliver on our strategic plans. Our success in delivering high quality and innovative products and solutions for our customers and driving operational excellence is only achievable through the talent, expertise, and dedication of our global team. We had approximately 24,000 employees worldwide as of\n \nDecember 31, 2024. \nAttraction, Development, and Retention\nWe recognize that attracting, developing and retaining skilled talent and promoting a work environment that is professional and inclusive are essential to maintaining our leadership positions in the markets we serve. While our operating companies are the hubs of these activities — an effective model that puts ownership in the businesses and cultures that are the source of opportunities for employees — we are increasingly leveraging the corporate center to drive talent recruitment and development and consistent human capital management practices across our businesses. This center-led focus is enabling us to make development opportunities available across our enterprise which we believe promotes employee advancement, engagement and retention. We offer employees resources to continuously improve their skills and performance with the goal of further cultivating entrepreneurial talent with a range of perspectives, backgrounds, skills, and experiences inside our global businesses to fill key positions. We seek people who are proactive and dedicated, demonstrate an ownership mindset and share our commitment to the pursuit of operational excellence. We continue to make significant investments in talent development and recognize that the growth and development of our employees is essential for our continued success.\nWorkplace Environment and Inclusion\nAs noted above, we are committed to maintaining a work environment that is professional, inclusive, and free from discrimination and harassment. That includes ensuring equal opportunity in our hiring practices and in our treatment of employees regardless of their race, color, religion, disability, national origin, gender, sexual orientation, gender identity and expression, marital status, family responsibility, age, or other characteristic protected by law. Our Code of Conduct lays out guidelines to maintain a fair and safe workplace.\nWe strive to build teams that fully leverage individuals’ capabilities and the breadth of skills, perspectives and experiences represented in our workforce. We believe this motivates our employees to be engaged and productive, enables us to attract new talent, helps us effectively serve our customers, and advances innovation from ideas contributed as a result of the variety of backgrounds, experiences, and perspectives of our employees. To that end, we partner with human resources and leadership teams across our portfolio of companies on talent outreach action plans to identify and recruit qualified candidates with a variety of backgrounds, skills, and experiences.  We aim to cultivate an inclusive culture that enables employees to feel connected to our business objectives and valued for their contributions.\nHealth and Safety\nWe are committed to achieving our vision of a zero-harm workplace and continue to prioritize health and safety compliance, risk mitigation, and process improvement across the organization. We utilize a global EHS information management system designed to measure and track key metrics and actions pertinent to our health and safety programs. This software supports our strategy to proactively reduce hazards thereby further enhancing shop floor safety. Through our efforts, we have reduced our total recordable injury rate substantially since 2019.\n13    \nTable of Contents\nHuman Capital Investments Related to Strategic Priorities\nIn line with our strategic priorities, we have additionally invested in the following aspects of human capital resource management, among other areas:\n•\nDover Digital Labs – We are continuing to leverage our Digital Labs team to improve our digital capabilities. Our team of software developers, data scientists, manufacturing engineers, and product managers drive digital transformation across our businesses by enhancing customer experience, developing connected industrial products, enabling digital manufacturing and securing our digital products.\n•\nOperational management – Our operations teams, including our management team at the corporate center, focuses on improving operational efficiency, such as implementing production automation.\n•\nShared services – We are continuing to further centralize shared services under Dover Business Services and our India Innovation Center. Our shared services capabilities include a wide range of functional areas including transactional support, human resources, IT, finance and accounting, engineering and product development. These services enable increased productivity and growth as well as free up resources within our operating companies to focus on customers, markets and product development.\nIntellectual Property and Intangible Assets \nOur businesses own many patents, trademarks, licenses and other forms of intellectual property, which have been created, registered or acquired over a number of years and, to the extent relevant, expire at various times over a number of years. A large portion of our businesses' intellectual property consists of patents, unpatented technology and proprietary information constituting trade secrets that we seek to protect in various ways, including confidentiality agreements with employees and suppliers where appropriate. In addition, a significant portion of our intangible assets relate to customer relationships. While our intellectual property and customer relationships are important to our success, the loss or expiration of any of these rights or relationships is not likely to materially affect our results on a consolidated basis. We believe that our commitment to continuous engineering improvements, new product development and improved manufacturing techniques, as well as strong sales, marketing and service efforts, are significant to our general leadership positions in the niche markets we serve.\nCustomers \nWe serve thousands of customers, none of which accounted for more than 10% of our consolidated revenue in 2024. Given our diversity of served markets, customer concentrations are not significant. Businesses supplying the defense and commercial refrigeration industries tend to deal with a few large customers that are significant within those industries. This also tends to be true for businesses supplying the power generation and chemical industries. In the other markets served, there is usually a much lower concentration of customers, particularly where our companies provide a substantial number of products and services applicable to a broad range of end-use applications. \nSeasonality \nIn general, while our businesses are not highly seasonal, we do tend to have stronger revenue generation in the second half of the year, which is driven by customer capital expenditure timing and seasonal activity patterns in our end-markets. Our businesses serving the retail fueling market tend to increase in the second half of the year based on the historical purchasing patterns of their customers. Our businesses serving the major equipment markets, such as power generation, chemical and processing industries, have longer lead times geared to seasonal, commercial, or consumer demands and customers in these markets tend to delay or accelerate product ordering and delivery to coincide with those market trends which moderates the aforementioned seasonality patterns. Our food retail refrigeration business tends to face higher levels of demand in the second and third quarters as retailers avoid construction and remodeling activity during fall/winter holidays.\n14    \nTable of Contents\nCompetition\n \nOur competitive environment is complex because of the wide diversity of our products manufactured and the markets served. In general, most of our businesses are market leaders that compete with only a few companies, and the key competitive factors are customer service, product quality, price and innovation. A summary of our key competitors within each of our segments follows:\nSegment\nKey Competitors\nEngineered Products\nSnap-On Inc. (Challenger Lifts, Car-O-Liner), The COATS Company, Arrowhead Winch, Teledyne, Nordson Corporation\nClean Energy & Fueling\nVontier (Gilbarco Veeder-Root, DRB), Tatsuno, Verifone, Franklin Electric, Elaflex, Ingersoll Rand (Emco Wheaton), Crane Company (Cryoflo), Dixon Valve & Coupling Company, PDI Technologies, Inc., Salco, Sonny's Enterprises LLC, National Carwash Solutions, Washtec AG\nImaging & Identification\nVeralto Corporation (Videojet), Brother Industries, Ltd. (Domino Printing), Electronics for Imaging (Reggiani), SPG Prints, Konica Minolta, Kornit Digital Ltd.\nPumps & Process Solutions\nIDEX Corporation, Ingersoll Rand, Millipore, Danaher Corporation (Pall), Avantor (Masterflex), Nordson Corporation, ITT, SPX Flow Inc. (Waukesha), Spirax Sarco (Watson Marlow), Kingsbury, Seko, Ecolab, Hoerbiger Holdings AG, Miba AG, Hillenbrand Inc. (Coperion)\nClimate & Sustainability Technologies\nPanasonic (Hussman Corp.), Alfa Laval, Danfoss, Stolle Machinery, Crown Holdings\nInternational\n \nConsistent with our strategic focus on positioning our businesses for growth, we aim to grow our revenue in international markets, particularly in developing economies in Asia, the Middle East, Eastern Europe and South America. \nMost of our non-U.S. subsidiaries and affiliates are currently based in China, France, Germany, Italy, Sweden, Switzerland, the United Kingdom, and other locations including Australia, Brazil, Canada, India, Mexico, and the Netherlands. \nThe following table shows annual revenue derived from customers outside the U.S. as a percentage of total annual revenue for each of the last three years, by segment and in total:\nPercentage of  Non-U.S. Revenue \nby Segment\nYears Ended December 31,\n2024\n2023\n2022\nEngineered Products\n33 \n%\n35 \n%\n35 \n%\nClean Energy & Fueling\n43 \n%\n44 \n%\n41 \n%\nImaging & Identification\n72 \n%\n72 \n%\n72 \n%\nPumps & Process Solutions\n49 \n%\n53 \n%\n51 \n%\nClimate & Sustainability Technologies\n37 \n%\n43 \n%\n40 \n%\nTotal percentage of revenue derived from customers outside of the United States\n46 \n%\n48 \n%\n46 \n%\nOur international operations are subject to certain risks, such as price and exchange rate fluctuations and non-U.S. governmental restrictions, which are discussed further in"
}