{
  "ticker": "DRI",
  "cik": "0000940944",
  "company_name": "DARDEN RESTAURANTS INC",
  "filing_date": "2025-07-18",
  "accession": "0000940944-25-000038",
  "primary_doc": "dri-20250525.htm",
  "item1_text": "Item 1A. RISK FACTORS \nVarious risks and uncertainties could affect our business.  Any of the risks described below or elsewhere in this report or our other filings with the Securities and Exchange Commission could have a material impact on our business, financial condition or results of operations. It is not possible to predict or identify all risk factors.  Additional risks and uncertainties not presently known to us or that we currently believe to be immaterial may also impair our business operations. \nRisks Relating to Inflation and Macroeconomic Disruption\nA failure to address cost pressures, including rising costs for commodities, labor, health care and utilities used by our restaurants, and a failure to effectively deliver cost management activities and achieve economies of scale in purchasing could compress our margins and adversely affect our sales and results of operations.\nOur results of operations depend significantly on our ability to anticipate and react to changes in the price and availability of food, ingredients, labor, health care, utilities, fuel and other related costs over which we may have little control.  While inflationary conditions have somewhat abated in recent periods, we have experienced and continue to experience higher than normal inflationary conditions with respect to most or all of these costs during fiscal 2025.  Operating margins for our restaurants are subject to changes in the price and availability of food commodities, including beef, pork, chicken, seafood, cheese, butter and produce.  The introduction of or changes to tariffs or adverse impacts resulting from restrictive trade policies or trade disputes on imported food products, such as produce and seafood, could increase our costs and possibly impact the supply of those products.  \n14\nWe cannot predict whether we will continue to be able to anticipate and react to changing food costs by adjusting our purchasing practices, menu offerings, and menu prices, and a failure to do so could adversely affect our operating results.  We attempt to leverage our size to achieve economies of scale in purchasing, but there can be no assurances that we can always do so effectively.  We are also subject to the general risks of inflation and its impact on the macroeconomic environment.\nIncreases in minimum wage, health care and other benefit costs may have a material adverse effect on our labor costs. We operate in many states and localities where the minimum wage is significantly higher than the federal minimum wage.  The market for labor in the United States is competitive and has resulted in pressure on wages and may continue to do so in the future.  Increases in minimum wage and market pressure may also result in increases in the wage rates paid for non-minimum wage positions.  Many states and localities are also passing laws regulating employment practices and working conditions, which could have a material adverse effect on our labor costs in those areas.\nOur restaurants’ operating margins are also affected by fluctuations in the price of utilities such as electricity and natural gas, whether as a result of inflation or otherwise, on which the restaurants depend for their energy supply.  In addition, interruptions to the availability of gas, electric, water or other utilities, whether due to aging infrastructure, weather conditions, fire, animal damage, trees, digging accidents, geopolitical impacts or other reasons largely out of our control, may adversely affect our operations.  Our inability to anticipate and respond effectively to an adverse change in any of these factors could have a significant adverse effect on our sales and results of operations.\nCertain economic and business factors and their impacts on the restaurant industry and other general macroeconomic factors, including unemployment, energy prices and interest rates that are largely beyond our control may adversely affect consumer behavior and our sales and results of operations.\nOur business results depend on a number of industry-specific and general economic factors, many of which are beyond our control, and may adversely affect consumer behavior and our sales and our results of operations.  The full-service dining sector of the restaurant industry is affected by changes in international, national, regional and local economic conditions, seasonal fluctuation of sales volumes, consumer spending patterns and consumer preferences, including changes in consumer tastes and dietary habits, and the level of consumer acceptance of our restaurant brands.  The performance of individual restaurants may also be adversely affected by factors such as demographic trends, severe weather including hurricanes, traffic patterns and the type, number and location of competing restaurants.\nGeneral economic conditions, including slow global recovery from economic downturns, geopolitical conditions and uncertainty about the strength or pace of economic recovery, have also adversely affected our results of operations and may continue to do so.  Economic recession, a protracted economic slowdown, a worsening economy, political instability, increased unemployment, increased inflation, increased energy prices, rising interest rates, a downgrade of the U.S. government’s long-term credit rating, imposition of retaliatory tariffs on important U.S. imports and exports or other industry-wide cost pressures have affected and can continue to affect consumer behavior and spending for restaurant dining occasions and lead to a decline in sales and earnings.  Economic uncertainty has caused and may continue to cause guests to make fewer discretionary purchases, and any significant decrease in our guest traffic or average profit per transaction will negatively impact our financial performance.  In addition, if gasoline, natural gas, electricity and other energy costs remain at the current elevated levels or increase further, and credit card, home mortgage and other borrowing costs increase with rising interest rates, our guests may have lower disposable income and reduce the frequency of their dining occasions, may spend less on each dining occasion or may choose more inexpensive food options.\nFurthermore, we cannot predict the effects that actual or threatened armed conflicts, including the ongoing armed conflicts in the Ukraine and the Middle East, terrorist attacks, efforts to combat terrorism, heightened security requirements, or a failure to protect information systems for critical infrastructure, such as the electrical grid and telecommunications systems, could have on our operations, the economy or consumer confidence generally. Any of these events could affect consumer spending patterns or result in increased costs for us due to security measures.\nUnfavorable changes in the above factors or in other business and economic conditions affecting our guests could increase our costs, reduce traffic in some or all of our restaurants or impose practical limits on pricing, any of which could lower our profit margins and have a material adverse effect on our sales, financial condition and results of operations.\nRisks Related to Human Capital\nThe inability to hire, train, reward and retain restaurant team members and determine and maintain adequate staffing may impact our ability to achieve our operating, growth and financial objectives.\nOur long-term growth depends substantially on our ability to recruit and retain high-quality team members to work in and manage our restaurants.  Adequate staffing and retention of qualified restaurant team members is a critical factor impacting our \n15\nguests’ experience in our restaurants.  Maintaining adequate staffing in our existing restaurants and hiring and training staff for our new restaurants require precise workforce planning which has been complicated by the competitive labor market in the United States.  The market for the most qualified talent continues to be competitive, and we must provide competitive wages, benefits and workplace conditions to maintain our most qualified team members. \n \nA shortage of qualified candidates who meet all legal citizenship or work authorization requirements, failure to recruit and retain new team members in a timely manner or higher than expected turnover levels all could affect our ability to open new restaurants, grow sales at existing restaurants or meet our labor cost objectives. Anticipated changes in immigration laws and regulations could decrease the pool of candidates with legal work authorizations, cause disruption in the workforce for all companies that rely on hourly workers and increase the costs, time and requirements to hire new employees. An inability to adequately monitor and proactively respond to team member dissatisfaction could lead to poor guest satisfaction, higher turnover, litigation and unionization, which could jeopardize our ability to meet our growth targets or impact our results of operations.\nA failure to recruit, develop and retain effective leaders or the loss or shortage of personnel with key capacities and skills could impact our strategic direction and jeopardize our ability to meet our business performance expectations and growth targets.\nOur future growth depends substantially on the contributions and abilities of key executives and other leadership team members. We must continue to recruit, retain and motivate management team members in order to achieve our current business objectives and support our projected growth.  Unplanned changes in senior management could expose us to significant changes in strategic direction and initiatives.  A failure to maintain appropriate organizational capacity and capability to support leadership excellence (adequate resources, innovative skill sets and expectations) and build adequate bench strength required for growth or a loss of key skill sets could jeopardize our ability to meet our business performance expectations and growth targets.\nWe may be subject to increased labor and insurance costs.\nOur restaurant operations are subject to United States and Canadian federal, state and local laws governing such matters as minimum wages, working conditions, overtime and tip credits.  As federal, state and local minimum wage rates increase, we may need to increase not only the wages of our minimum wage employees, but also the wages paid to employees at wage rates that are above minimum wage.  Labor shortages, increased employee turnover and health care and other benefit or working condition regulations also have increased and may continue to increase our labor costs.  These increased costs could, in turn, lead us to increase our menu prices, which could negatively impact our sales. Conversely, if competitive pressures or other factors prevent us from offsetting increased labor costs by increases in menu prices, our profitability may decline. In addition, the current premiums that we pay for our insurance (including workers’ compensation, general liability, property, health, and directors’ and officers’ liability) may increase at any time, thereby further increasing our costs.  The dollar amount of claims that we experience under our workers’ compensation and general liability insurance, for which we carry high per-claim deductibles, may also increase at any time, thereby further increasing our costs. Further, the decreased availability of property and liability insurance has the potential to negatively impact the cost of premiums and the magnitude of uninsured losses.\nRisks Relating to Health and Safet\ny\nHealth concerns arising from food-related pandemics, outbreaks of flu, viruses or other diseases may have an adverse effect on our business.\nThe United States and other countries have experienced, or may experience in the future, outbreaks of viruses, such as the novel coronavirus that caused COVID-19, norovirus, avian flu or “SARS,” “MERS,” H1N1 or “swine flu,” or other diseases.  To the extent that a virus or disease is food-borne, or perceived to be food-borne, future outbreaks may adversely affect the price and availability of certain food products and cause our guests to eat less of a product, or could reduce public confidence in food handling and/or public assembly.  For example, public concern over avian flu may cause fear about the consumption of chicken, eggs and other products derived from poultry, and the inability to serve poultry-based products would restrict our ability to provide a variety of menu items to our guests. If we change a restaurant menu in response to such concerns, we may lose guests who do not prefer the new menu, and we may not be able to attract a sufficient new guest base to produce the sales needed to make the restaurant profitable. We also may have different or additional competitors for our intended guests as a result of such a change and may not be able to successfully compete against such competitors.  If a virus is transmitted by human contact or respiratory transmission, our employees or guests could become infected, or could choose, or be advised, to avoid gathering in public places, any of which could adversely affect our restaurant guest traffic and our ability to adequately staff our restaurants, receive deliveries on a timely basis or perform functions at the corporate level. We also could be adversely affected if the World Health Organization and/or The United States Centers for Disease Control were to restrict travel to affected geographic areas where we source our products, thus possibly impacting the continuity of supply.  Additionally, jurisdictions in which we have restaurants may impose mandatory closures, seek voluntary closures or impose restrictions on operations.  Even if such measures are not implemented and a virus or other disease does not spread significantly, the perceived risk of infection or significant health risk may cause guests to choose other alternatives to dining out in our restaurants which may adversely affect our business.\n16\nA failure to maintain food safety throughout the supply chain and food-borne illness concerns may have an adverse effect on our business.\nFood safety is a top priority for us, and we dedicate substantial resources to ensuring that our guests enjoy safe, quality food products.  Even with strong preventative interventions and controls, food safety issues could be caused at the source or by food suppliers or distributors and, as a result, may be out of our control and require prompt action to mitigate impact.  In addition, regardless of the source or cause, any report of food-borne illnesses caused by pathogens such as E. coli, hepatitis A, norovirus, listeria or salmonella, or other food safety issues including food tampering or contamination at one of our restaurants could adversely affect the reputation of our brands and have a negative impact on our sales. Even instances of food-borne illness, food tampering or food contamination occurring solely at our competitors’ restaurants, suppliers or distributors (even if we do not work with them) could result in negative publicity about the food service industry generally and adversely impact our sales. Social media has dramatically increased the speed with which negative publicity, including actual or perceived food safety incidents, is disseminated before there is any meaningful opportunity to investigate, respond to and address an issue.  The occurrence of food-borne illnesses or food safety issues could also adversely affect the price and availability of affected ingredients, resulting in higher costs and lower margins.\nRisks Relating to Information Technology, Cybersecurity and Privacy\nWe rely heavily on information technology in our operations, and insufficient guest or employee facing technology or a failure to maintain a continuous and secure cyber network, free from material failure, interruption or security breach, could harm our ability to effectively operate our business and/or result in the loss of respected relationships with our guests or employees.\nWe rely heavily on information systems across our operations, including for e-commerce, marketing programs, employee engagement, management of our supply chain, the point-of-sale processing system in our restaurants, and various other processes and transactions. Our ability to effectively manage our business and coordinate the production, distribution and sale of our products depends significantly on the reliability, security and capacity of these systems.  In addition, we must effectively respond to changing guest expectations and new technological developments, and if we fail to implement emerging technologies as quickly and efficiently as our competitors, we may lose guests or employees. As technology continues to play an increasing role in our guests’ experiences, disruptions, failures or other performance issues with guest-facing technology systems could impair the benefits that they provide to our business and negatively affect our relationship with our guests.  The failure of these systems to operate effectively, problems with transitioning to upgraded or replacement systems, or any other failure to maintain a continuous and secure cyber network could result in substantial harm or inconvenience to the Company, our team members or guests.  This could include the theft of our intellectual property, trade secrets or sensitive personal or financial information.  Some of these essential business processes that are dependent on technology are outsourced to third parties.  While we make efforts to ensure that our providers are observing proper standards and controls, we cannot guarantee that breaches or failures caused by these outsourced providers will not occur.  \nFrom time to time, we and our third party service providers and suppliers experience unauthorized attempts to infiltrate and interrupt information systems. To date, interruptions of these information systems as a result of unauthorized infiltration attempts have not had a material impact on our operations. However, because technology is increasingly complex and cyber-attacks are increasingly sophisticated and more frequent, there can be no assurance that such incidents will not have a material adverse effect on us in the future. In addition, the rapid evolution and increased adoption of artificial intelligence technologies may intensify our and our service providers’ and key suppliers’ cybersecurity risks. Unauthorized access, theft, use, destruction or other compromises are becoming increasingly sophisticated, more difficult to detect, contain and mitigate, and may occur through a variety of methods, including attacks using malicious code, vulnerabilities in software, hardware or other infrastructure (including systems used by our supply chain), system misconfigurations, phishing or social engineering. Failure of our or our service providers’ information systems to function as intended, or cyber-attacks or security breaches, could result in loss of revenue, assets, personal data, intellectual property, trade secrets or other sensitive and confidential data, violation of applicable privacy and data security laws, reputational harm to the companies and their brands, operational disruptions, legal challenges and significant remediation and other costs, all of which could have a material adverse effect on our business.\nAny such failures or disruptions, whether caused by system failures or threat actors attempting to infiltrate our systems, may cause delays in guest service, reduce efficiency in our operations, require significant capital investments to remediate the problem, result in customer, employee or advertiser dissatisfaction or otherwise result in negative publicity that could harm our reputation.\n \nWe could also be subjected to litigation, regulatory investigations or the imposition of penalties.\n \nSuch security breaches also could result in a violation of applicable U.S. and international privacy, cyber and other laws or trigger data breach notification laws, including new disclosure rules promulgated by the SEC, and subject us to private third party or securities litigation and governmental investigations and proceedings, any of which could result in our exposure to material civil or criminal liability. As information security laws and regulations change and cyber risks evolve, we may be required to make significant capital \n17\ninvestments and other expenditures to comply with new legal requirements, investigate security incidents, remedy cybersecurity issues, recuperate lost data, prevent future compromises and adapt systems and practices to react to the changing threat environment.\nWe may incur increased costs to comply with privacy and data protection laws, and, if we fail to comply or our systems are compromised, we could be subject to government enforcement actions, private litigation and adverse publicity.\nWe receive and maintain certain personal, financial and other information about our customers, employees, vendors and suppliers.  In addition, certain of our vendors receive and maintain certain personal, financial and other information about our employees and customers.  The use and handling, including security, of this information is regulated by evolving and increasingly demanding data privacy laws and regulations in various jurisdictions, as well as by certain third-party contracts and industry standards.  Complying with existing and newly developed laws and regulations, which are subject to change and uncertain interpretations and may be inconsistent from jurisdiction to jurisdiction, may lead to a decline in guest engagement or cause us to incur substantial costs or modifications to our operations or business practices to comply.  The increasingly complex and evolving regulatory environment related to data privacy and data protection laws may result in significant costs arising from compliance and from any non-compliance, whether or not due to our negligence, and could affect our brand reputation and our results of operations. We have and expect to continue to have significant expenses arising from compliance with these regulatory regimes due to changes in the techniques and sophistication used to conduct cyber-attacks and breaches. In addition, if our security and information systems are compromised as a result of data corruption or loss, cyber-attack or a network security incident, or if our employees or vendors fail to comply with these laws and regulations or fail to meet industry standards and this information is obtained by unauthorized persons or used inappropriately, it could result in liabilities and penalties and could damage our reputation, cause interruption of normal business performance, cause us to incur substantial costs and result in a loss of customer confidence, which could adversely affect our results of operations and financial condition.  Additionally, we could be subject to litigation and government enforcement actions as a result of any such failure.\nRisks Related to the Integration of Chuy’s\nThe inability to successfully integrate the Chuy’s brand’s operations into our business could harm our ability to achieve the sales growth, cost savings and other benefits we expect to be able to realize from Chuy’s operations.\nThe integration of the Chuy’s business into our operations is a complex, costly and time-consuming process that may not be successful. The primary areas of focus for successfully combining the business of Chuy’s with our operations include, among others: retaining and integrating management and other key employees; integrating information, communications and other systems; and managing the growth of the combined company.\nEven if we successfully integrate the business of Chuy’s into our operations, there can be no assurance that we will realize the anticipated benefits. We expect that the acquisition of Chuy’s will result in various benefits for the combined company including, among others, business and growth opportunities and significant synergies from increased efficiency in purchasing, distribution and other restaurant and corporate support. Increased competition and/or deterioration in business conditions may limit or delay our ability to expand this business. As such, we may not be able to realize the synergies, goodwill, business opportunities and growth prospects anticipated in connection with the acquisition of Chuy’s.\nRisks Related to the Restaurant Industry\nWe are subject to a number of risks relating to public policy changes and federal, state and local regulation of our business, including in the areas of environmental matters, minimum wage, employee benefit regulations, unionization, menu labeling, immigration requirements and taxes, and an insufficient or ineffective response to legislation or government regulation may adversely impact our cost structure, operational efficiencies and talent availability. \nThe restaurant industry is subject to extensive federal, state, local and international laws and regulations.  The development and operation of restaurants depends  on the selection and acquisition of suitable sites to a significant extent, which are subject to building, zoning, land use, environmental, traffic and other regulations and requirements.  We are subject to licensing and regulation by state and local authorities relating to health, sanitation, safety and fire standards and the sale of alcoholic beverages. We are subject to laws and regulations relating to the preparation and sale of food, including regulations regarding product safety, nutritional content and menu labeling. We are subject to federal, state, and local laws governing employment practices and working conditions.   These laws cover minimum wage rates, wage and hour practices, labor relations, paid and family leave, workplace safety, and immigration, among others.  The myriad of laws and regulations being passed at the state and local level creates unique challenges for a multi-state employer as different standards apply to different locations, sometimes with conflicting requirements.  We must continue to monitor and adapt our employment practices to comply with these various laws and regulations. \n18\nWe also are subject to federal and state laws which prohibit discrimination and other laws regulating the design and operation of facilities, such as the ADA.  Compliance with these laws and regulations can be costly and increase our exposure to litigation and governmental proceedings, and a failure or perceived failure to comply with these laws could result in negative publicity that could harm our reputation.  New or changing laws and regulations relating to union organizing rights and activities may impact our operations at the restaurant level and increase our labor costs. \nWe are subject to a variety of federal, state and local laws and regulations relating to the use, storage, discharge, emission and disposal of hazardous materials. There also has been increasing focus by United States and overseas governmental authorities on other environmental matters, such as climate change, the reduction of greenhouse gas emissions and water consumption. This increased focus may lead to new initiatives directed at regulating a yet to be specified array of environmental matters.  Legislative, regulatory or other efforts to combat climate change or other environmental concerns could result in future increases in the cost of raw materials, taxes, compliance, risk management, transportation and utilities, which could decrease our operating profits and necessitate future investments in facilities and equipment.\nWe are subject to laws relating to information security, cashless payments and consumer credit, protection and fraud.  Compliance with these laws and regulations can be costly, and any failure or perceived failure to comply with these laws or any breach of our systems could harm our reputation or lead to litigation, which could adversely affect our financial condition or results of operations.\nThe impact of current laws and regulations, the effect of future changes in laws or regulations that impose additional requirements and the consequences of litigation relating to current or future laws and regulations, or an insufficient or ineffective response to significant regulatory or public policy issues, could negatively impact our cost structure, operational efficiencies and talent availability, and therefore have an adverse effect on our results of operations. Failure to comply with the laws and regulatory requirements of federal, state and local authorities could result in, among other things, revocation of required licenses, administrative enforcement actions, fines and civil and criminal liability. Compliance with these laws and regulations can be costly and can increase our exposure to litigation or governmental investigations or proceedings.\nWe face intense competition, and if we have an insufficient strategy or focus on competition and the consumer landscape, our business, financial condition and results of operations could be adversely affected.\nThe full-service dining sector of the restaurant industry is intensely competitive with respect to pricing, service, location, personnel, take-out and delivery options and type and quality of food, and there are many well-established competitors. We compete within each market with national and regional restaurant chains and locally-owned restaurants. We also face growing competition as a result of the trend toward convergence in grocery, deli and restaurant services, particularly in the supermarket industry which offers “convenient meals” in the form of improved entrées, side dishes or meal preparation kits from the deli or prepared foods sections.  Furthermore, delivery aggregators and food delivery services provide consumers with convenient access to a broad range of competing restaurant chains and food retailers, particularly in urbanized areas, and may form a closer relationship with our customers and increase costs to us. We compete primarily on the quality, variety and value perception of menu items. The number and location of restaurants, type of brand, quality and efficiency of service, attractiveness of facilities and effectiveness of advertising and marketing programs are also important factors. We anticipate that intense competition will continue with respect to all of these factors. We may be unable to successfully respond to changing consumer preferences, including with respect to new technologies and alternative methods of engaging with our brands, like delivery. In addition, online platforms and aggregators may direct potential customers to other options based on paid placements, online reviews or other factors.  If we are unable to continue to compete effectively, our business, financial condition and results of operations could be adversely affected.\nWe are subject to changes in consumer preferences that may adversely affect demand for food at our restaurants. \nConsumers are continually changing health and dietary preferences.  As a result, our diverse portfolio of restaurant brands are continually challenged to evolve our menu offerings to appeal to these changing customer preferences, while maintaining our brand character and retaining popular menu items.  During periods of high public health risk such as during the COVID-19 pandemic, many consumers choose to order food To Go or for delivery rather than dining in at full-service restaurants.  If other future public health issues cause these preferences to increase, we may need to further adapt our offerings to respond to these additional changes.  New information or changes in dietary, nutritional, allergen or health guidelines or environmental or sustainability concerns, whether issued by government agencies, academic studies, advocacy organizations or similar groups, may cause some groups of consumers to select foods other than those that are offered by our restaurants.  If we fail to anticipate changing trends or other consumer preferences, our business, financial condition and results of operations could be adversely affected. \n19\nOur inability or failure to recognize, respond to and effectively manage the accelerated impact of social media could have a material adverse impact on our business.\n \nThe proliferation and utilization of existing and innovative social media platforms allows individuals and businesses access to a broad audience of consumers and other interested persons. Many social media platforms immediately publish the content their subscribers and participants post, often without filters or checks on accuracy of the content posted. Information posted on such platforms at any time may be adverse to our interests or may be inaccurate, each of which may harm our performance, prospects, or business.  The harm may be immediate without affording us an opportunity for redress or correction.  The dissemination of information online could harm our business, prospects, financial condition, and results of operations, regardless of the information’s accuracy.\n \nOur competitors are constantly expanding their use of social media and new social media platforms are rapidly being developed, potentially making more traditional social media platforms obsolete.  As a result, we need to continuously innovate and develop our social media strategies in order to maintain broad appeal with guests and brand relevance. As part of our marketing efforts, we rely on social media platforms and search engine marketing to attract and retain guests.  We also continue to invest in other digital marketing initiatives that allow us to reach our guests across multiple digital channels and build their awareness of, engagement with, and loyalty to our brands. These initiatives may not be successful, resulting in expenses incurred without the benefit of higher revenues, increased employee engagement or brand recognition.  In addition, a variety of risks are associated with the use of social media, including the improper disclosure of proprietary information, negative comments about us, exposure of personally identifiable information, fraud, or out-of-date information.  The inappropriate use of social media vehicles by our guests or employees could increase our costs, lead to litigation or result in negative publicity that could damage our reputation.\nA failure to identify and execute innovative marketing and guest relationship tactics, ineffective or improper use of other marketing initiatives, and increased advertising and marketing costs could adversely affect our sales and results of operations.\nIf our competitors increase their spending on advertising and promotions, if our advertising, media or marketing expenses increase, if our advertising and promotions become less effective than those of our competitors, or if we do not adequately leverage technology and data analytic capabilities needed to generate concise competitive insight, we could experience a material adverse effect on our sales and our results of operations.   A failure to sufficiently innovate, develop guest relationship initiatives, or maintain adequate and effective advertising could inhibit our ability to maintain brand relevance and drive increased sales.    \nAs part of our marketing efforts, we rely on social media platforms and search engine marketing to attract and retain guests.  These initiatives may not be successful, and pose a variety of other risks, as discussed above under the heading:\n “Our inability or failure to recognize, respond to and effectively manage the accelerated impact of social media could have a material adverse impact on our business.”\nClimate change, adverse weather conditions and natural disasters could adversely affect our sales or results of operations.\nThe long-term effects of climate change and global warming will result in more severe, volatile weather or extended droughts, which could increase the frequency and duration of weather impacts on our operations.  Adverse weather conditions have in the past and may continue to impact guest traffic at our restaurants, cause the temporary underutilization of outdoor patio seating and, in more severe cases such as hurricanes, tornadoes, wildfires or other natural disasters, cause property damage and temporary closures, sometimes for prolonged periods, which could negatively impact our sales or costs.  Climate change and government regulation relating to climate change, including regulation of greenhouse gas emissions, could result in construction delays and increased costs, interruptions to the availability or increases in the cost of utilities, and shortages or interruptions in the supply or increases to the costs of food items and other supplies.  \nRisks Relating to Our Business Model and Strategy\nA majority of our restaurants are operated in leased properties and as a result, we are committed to long-term lease obligations that we may not be able to cancel if we want to close a restaurant location and we may be unable to renew the leases that we may want to extend at the end of their terms.\nAs of May 25, 2025, 2,065 of our 2,159 restaurants operating in the United States and Canada operate in leased locations, and the leases are generally non-cancellable for some period of time.  If we close a restaurant in a leased location, we may remain committed to perform our obligations under the applicable lease, which would include, among other things, payment of the base rent for the balance of the lease term. Additionally, the potential losses associated with our inability to cancel leases may result in our keeping open restaurant locations that are performing significantly below targeted levels. As a result, ongoing lease obligations at closed or underperforming restaurant locations could impair our results of operations.  In addition, at the end of the lease term and expiration of all renewal periods, we may be unable to renew the lease without substantial additional cost, if at all. \n20\nAs a result, we may be required to close or relocate a restaurant, which could subject us to construction and other costs and risks that may have an adverse effect on our operating performance.\nOur inability or failure to execute on a comprehensive business continuity plan following a major natural disaster, such as a hurricane or manmade disaster, at our corporate facility could have a materially adverse impact on our business.\nMany of our corporate systems and processes and corporate support for our restaurant operations are centralized at one Florida location.\n \nWe have disaster recovery procedures and business continuity plans in place to address most events of a crisis nature, including hurricanes and other natural or manmade disasters, and back up and off-site locations for recovery of electronic and other forms of data and information. However, if we are unable to fully implement our disaster recovery plans, we may experience delays in recovery of data, inability to perform vital corporate functions, tardiness in required reporting and compliance, failures to adequately support field operations and other breakdowns in normal communication and operating procedures that could have a material adverse effect on our financial condition, results of operations and exposure to administrative and other legal claims.\nWe may lose sales or incur increased costs if our restaurants experience shortages, delays or interruptions in the delivery of food and other products from our third party vendors and suppliers.\nWe have a limited number of suppliers and distributors for certain of our products and services.  Shortages, delays or interruptions in the supply of food items and other supplies to our restaurants may be caused by severe weather; natural disasters such as hurricanes, tornadoes, floods, droughts, wildfires and earthquakes; macroeconomic conditions (such as tariffs and trade disputes) resulting in disruptions to the shipping and transportation industries; labor issues such as increased costs or worker shortages or other operational disruptions at our suppliers, vendors or other service providers; the inability of our vendors or service providers to manage adverse business conditions, obtain credit or remain solvent; or other conditions beyond our control.  Such shortages, delays or interruptions could adversely affect the availability, quality and cost of the items we buy and the operations of our restaurants.  Supply chain disruptions have increased some of our costs and limited the availability of certain products for our restaurants in the past and may continue to do so.  Consumers at our restaurants may be sensitive to price increases, and if we increase menu prices as a result of increased food costs or remove menu items due to shortages, such responses may negatively impact our sales.  If we temporarily close a restaurant or remove popular items from a restaurant’s menu, that restaurant may experience a significant reduction in sales during the time affected by the shortage or thereafter as a result of our guests changing their dining habits.\nOur failure to drive both short-term and long-term profitable sales growth through brand relevance, operating excellence, opening new restaurants of existing brands, and acquiring new restaurant brands could result in poor financial performance.\nAs part of our business strategy, we intend to drive profitable sales growth by increasing same-restaurant sales at existing restaurants, continuing to expand our current portfolio of restaurant brands, and acquiring additional brands that can be expanded profitably. This strategy involves numerous risks, and we may not be able to achieve our growth objectives.  \nAt existing brands, we may not be able to maintain brand relevance and restaurant operating excellence to achieve sustainable same-restaurant sales growth and warrant new unit growth. Failure to maintain such brand and operating excellence may also result in restaurant closures.  Existing brand short-term sales growth could be impacted if we are unable to drive near-term guest count and sales growth, and long-term sales growth could be impacted if we fail to extend our existing brands in ways that are relevant to our guests.  A failure to innovate and extend our existing brands in ways that are relevant to guests and occasions in order to generate sustainable same-restaurant traffic growth and produce non-traditional sales and earnings growth opportunities, insufficient focus on our competition, or failure to adequately address declines in the casual dining industry, could have an adverse effect on our results of operations.  In addition, we may not be able to support sustained new unit growth or open all of our planned new restaurants, and the new restaurants that we open may not be profitable or as profitable as our existing restaurants. New restaurants typically experience an adjustment period before sales levels and operating margins normalize, and even sales at successful newly-opened restaurants generally do not make a significant contribution to profitability in their initial months of operation.  The opening of new restaurants can also have an adverse effect on guest counts and sales levels at existing restaurants. \nThe ability to open and profitably operate restaurants is subject to various risks, such as the identification and availability of suitable and economically viable locations; the negotiation of acceptable lease or purchase terms for new locations; the need to obtain all required governmental permits (including zoning approvals and liquor licenses) on a timely basis; the need to comply with other regulatory requirements; the availability of necessary contractors and subcontractors; the ability to meet construction schedules and budgets; the ability to manage union activities such as picketing or hand billing which could delay construction; increases in labor and building material costs; supply chain disruptions; the availability of financing at acceptable rates and terms; changes in patterns or severity of weather or other acts of God that could result in construction delays and adversely affect the \n21\nresults of one or more restaurants for an indeterminate amount of time; and our ability to hire and train qualified management personnel and general economic and business conditions.  At each potential location, we compete with other restaurants and retail businesses for desirable development sites, construction contractors, management personnel, hourly employees and other resources.  If we are unable to successfully manage these risks, we could face increased costs and lower than anticipated sales and earnings in future periods.\nWe also may not be able to identify and successfully acquire and integrate additional brands that are as profitable as our existing restaurants or that provide potential for further growth.\nA lack of availability of suitable locations for new restaurants or a decline in the quality of the locations of our current restaurants may adversely affect our sales and results of operations.\nThe success of our restaurants depends in large part on their locations.  As demographic and economic patterns change, current locations may not continue to be attractive or profitable. Possible declines in neighborhoods where our restaurants are located or adverse economic conditions in areas surrounding those neighborhoods could result in reduced sales in those locations. In addition, desirable locations for new restaurant openings or for the relocation of existing restaurants may not be available at an acceptable cost when we identify a particular opportunity for a new restaurant or relocation.  The occurrence of one or more of these events could have a significant adverse effect on our sales and results of operations.\nWe may experience higher-than-anticipated costs or delays associated with the opening of new restaurants or with the closing, relocating and remodeling of existing restaurants, which may adversely affect our results of operations.\nOur sales and expenses can be impacted significantly by the number and timing of the opening of new restaurants and the closing, relocating and remodeling of existing restaurants.  We incur substantial pre-opening expenses each time we open a new restaurant and other expenses when we close, relocate or remodel existing restaurants and we have experienced higher than usual costs and expenses in recent years.  The expenses of opening, closing, relocating or remodeling any of our restaurants may be higher than anticipated.  Increases in the time to procure or shortages of construction labor and materials and capital equipment, or permitting delays, may impact the time it takes to open new restaurants.  An increase in such expenses or delays in the timeline to complete construction could have an adverse effect on our results of operations.\nWe face a variety of risks associated with doing business with franchisees and licensees.\nCertain of our domestic and all of our international locations other than in Canada are operated by franchisees or licensees.  We believe that we have selected high-caliber operating partners and franchisees with significant experience in restaurant operations, and we are providing them with training and support.  However, the probability of opening, ultimate success and quality of any franchise or licensed restaurant rests principally with the franchisee or licensee.  If the franchisee or licensee does not successfully open and operate its restaurants in a manner consistent with our standards, or guests have negative experiences due to issues with food quality or operational execution, our brand values could suffer, which could have an adverse effect on our business.\nWe face a variety of risks associated with doing business with business partners and vendors in foreign markets.\nWe are making efforts to expand our brands overseas through licensing and franchising relationships.  There is no assurance that international operations will be profitable or that international growth will continue.  Our international operations are subject to all of the same risks associated with our domestic operations, as well as a number of additional risks. These include, among other things, international economic and political conditions, foreign currency fluctuations, trade disputes, potential increases in tariffs and differing cultures and consumer preferences.  In addition, expansion into international markets could create risks to our brands and reputation. \nWe also are subject to governmental regulations throughout the world that impact the way we do business with our international franchisees and vendors. These include antitrust and tax requirements, anti-boycott regulations, import/export/customs regulations and other international trade regulations, the USA Patriot Act, the Foreign Corrupt Practices Act, and applicable local law.  Failure to comply with any such legal requirements could subject us to monetary liabilities and other sanctions, which could harm our business, results of operations and financial condition.\nVolatility in the market value of derivatives we may use to hedge exposures to fluctuations in commodity and broader market prices may cause volatility in our gross margins and net earnings.\nWe use or may use derivatives to hedge price risk for some of our principal ingredient, labor and energy costs, including but not limited to coffee, butter, wheat, soybean oil, pork, beef, diesel fuel, gasoline and natural gas. Changes in the values of these derivatives may be recorded in earnings currently, resulting in volatility in both gross margin and net earnings.  These gains and \n22\nlosses are reported as a component of cost of sales in our Consolidated Statements of Earnings included in our consolidated financial statements.\nVolatility in the United States equity markets affects our ability to efficiently hedge exposures to our market risk related to equity-based compensation awards.\nThe equity markets in the United States have experienced recent periods of volatility due to the impacts of macroeconomic conditions, geopolitical concerns and the unpredictability of the impact on the United States economy as a result of these factors.  Market volatility has contributed to and may continue to contribute to fluctuations in the Company’s stock price. We have equity hedges in place to protect the Company from exposure to market risk related to future payout of equity-based compensation awards. However, because these hedges also net settle on a cash basis quarterly, we have been and may in the future be required to make cash payments at those quarterly settlement dates and the amounts of those payments are difficult to predict during periods of extreme volatility in the equity markets. These cash payments may ultimately be offset by payments to us from the hedge counterparties or reductions in expected payouts to employees when those equity hedges finally fully settle and the related equity awards pay out.\nFailure to protect our service marks or other intellectual property could harm our business.\nWe regard our Olive Garden\n®\n, LongHorn Steakhouse\n®\n, Cheddar’s Scratch Kitchen\n®\n, Chuy’s\n®\n, Yard House\n®\n, Ruth’s Chris Steak House\n®\n, The Capital Grille\n®\n, Seasons 52\n®\n,  Eddie V’s Prime Seafood\n®\n, Bahama Breeze\n®\n, The Capital Burger \n®\n, Darden\n® \nand Darden Restaurants\n® \nservice marks, and other service marks and trademarks related to our restaurant businesses, as having significant value and being important to our marketing efforts. We rely on a combination of protections provided by contracts, copyrights, patents, trademarks, service marks and other common law rights, such as trade secret and unfair competition laws, to protect our restaurants and services from infringement.  We have registered certain trademarks and service marks in the United States and foreign jurisdictions.  However, we are aware of names and marks identical or similar to our service marks being used from time to time by other persons.  Although our policy is to oppose any such infringement, further or unknown unauthorized uses or other misappropriation of our trademarks or service marks could diminish the value of our brands and adversely affect our business.  In addition, effective intellectual property protection may not be available in every country in which we have or intend to open or franchise a restaurant.  Although we believe we have taken appropriate measures to protect our intellectual property, there can be no assurance that these protections will be adequate, and defending or enforcing our service marks and other intellectual property could result in the expenditure of significant resources.\nEnvironmental, Social, and Governance (ESG) matters, our reporting of such matters, or sustainability ratings could negatively impact our business, results of operations and financial condition.\nESG related matters have received increased focus recently from investors, employees, ratings agencies, governmental agencies and other stakeholders. From time to time, we may publish statements relating to our commitment to responsible business, including commitments relating to greenhouse gas emissions. Such statements reflect the Company’s current plans and aspirations at the time they are made, and should not be construed as guarantees or that we will be able to achieve them. Our failure to adequately update, accomplish or accurately track and report on these commitments on a timely basis, or at all, could adversely affect our reputation, financial performance and growth, and expose us to increased scrutiny from the investment community, special interest groups and enforcement authorities. In addition, as an “anti-ESG” sentiment exists among some individuals and government institutions, we may also face scrutiny, reputational risk, lawsuits or market access restrictions from these parties regarding our ESG initiatives. Additionally, we may face increased scrutiny related to any third party sustainability ratings we receive, which could adversely affect our reputation, business, and results of operations.\nGeneral Risks\nLitigation, including allegations of illegal, unfair or inconsistent employment practices, may adversely affect our business, financial condition and results of operations.\nOur business is subject to the risk of litigation by employees, guests, suppliers, business partners, shareholders, government agencies or others through private actions, class actions, administrative proceedings, regulatory actions or other litigation.  These actions and proceedings may involve allegations of illegal, unfair or inconsistent employment practices, including wage and hour violations and employment discrimination; guest discrimination; food safety issues including poor food quality, food-borne illness, food tampering, food contamination, and adverse health effects from consumption of various food products or high-calorie foods (including obesity); other personal injury; violation of “dram shop” laws (providing an injured party with recourse against an establishment that serves alcoholic beverages to an intoxicated party who then causes injury to himself or a third party); trademark infringement; violation of federal securities laws; or other concerns.  The outcome of litigation, particularly class action lawsuits and regulatory actions, is difficult to assess or quantify.  Plaintiffs in these types of lawsuits may seek recovery of very \n23\nlarge or indeterminate amounts, and the magnitude of the potential loss relating to such lawsuits may remain unknown for substantial periods of time.  The cost to defend litigation may be significant. There may also be adverse publicity associated with litigation that could decrease guest acceptance of our brands, regardless of whether the allegations are valid or we ultimately are found liable. Litigation could impact our operations in other ways as well.  Allegations of illegal, unfair or inconsistent employment practices, for example, could adversely affect employee acquisition and retention.  As a result, litigation may adversely affect our business, financial condition and results of operations.\nUnfavorable publicity, or a failure to respond effectively to adverse publicity, could harm our reputation and adversely impact our guest counts and sales.\nThe good reputation of our restaurant brands is a key factor in the success of our business.  Actual or alleged incidents at any of our restaurants could result in negative publicity that could harm our brands.  Even incidents occurring at restaurants operated by our competitors or in the supply chain generally could result in negative publicity that could harm the restaurant industry overall and, indirectly, our own brands.  Negative publicity may result from allegations of illegal, unfair or inconsistent employment practices, employee dissatisfaction, guest discrimination, illness, injury, or any of the other matters discussed above that could give rise to litigation.  Reputational value is also based on perceptions, and broad access to social media makes it easy for anyone to provide public feedback that can influence perceptions of us, our brands, and our properties, and it may be difficult to control or effectively manage negative publicity, regardless of whether it is accurate. While reputations may take decades to build, negative incidents can quickly erode trust and confidence, particularly if they result in adverse mainstream and social media publicity, governmental investigations, proceedings or penalties, or litigation.  Regardless of whether the allegations or complaints are valid, unfavorable publicity relating to a limited number of our restaurants, or to only a single restaurant, could adversely affect public perception of the entire brand.  Negative publicity, including through social media, also may result from health concerns including food safety and flu or virus outbreaks, publication of government or industry findings concerning food products, environmental disasters, crime incidents, data security breaches, scandals involving our employees, or operational problems at our restaurants, all of which could make our brands and menu offerings less appealing to our guests and negatively impact our guest counts and sales.  Adverse publicity and its effect on overall consumer perceptions of our brands, or our failure to respond effectively to adverse publicity, could have a material adverse effect on our business.\nDisruptions in the financial and credit markets may adversely impact consumer spending patterns and affect the availability and cost of credit.\nOur ability to make scheduled payments or to refinance our debt and to obtain financing for acquisitions or other general corporate and commercial purposes will depend on our operating and financial performance, which in turn is subject to prevailing economic conditions and to financial, business and other factors beyond our control. Turmoil in global credit markets could adversely impact the availability of credit already arranged, and the availability and cost of credit in the future. There can be no assurances that we will be able to arrange credit on terms we believe are acceptable or that permit us to finance our business with historical margins.  A lack of credit could have an adverse impact on certain of our suppliers, landlords and other tenants in retail centers in which we are located.  If these issues occur, they could negatively affect our financial results.  Any new disruptions in the financial markets may also adversely affect the U.S. and world economy, which could negatively impact consumer spending patterns. \nImpairment of the carrying value of our goodwill or other intangible assets could adversely affect our financial condition and results of operations.\nGoodwill represents the difference between the purchase price of acquired companies and the related fair values of net assets acquired.  A significant amount of judgment is involved in determining if an indication of impairment of goodwill exists. Factors may include, among others: a significant decline in our expected future cash flows; a sustained, significant decline in our stock price and market capitalization; a significant adverse change in legal factors or in the business climate; unanticipated competition; the testing for recoverability of a significant asset group within a reporting unit; and slower growth rates.  Any adverse change in these factors could have a significant impact on the recoverability of these assets and negatively affect our financial condition and results of operations. We compute the amount of impairment by comparing the fair value of the reporting unit with the carrying amount of that reporting unit. We are required to record a non-cash impairment charge if the testing performed indicates that goodwill has been impaired.\nWe evaluate the useful lives of our other intangible assets, primarily the LongHorn Steakhouse\n®\n, Cheddar’s Scratch Kitchen\n®\n,\n \nThe Capital Grille\n®\n, Ruth’s Chris Steak House\n®\n, Yard House\n® \nand Eddie V’s Prime Seafood\n®\n trademarks, to determine if they are definite or indefinite-lived.  Reaching a determination on useful life requires significant judgments and assumptions regarding the future effects of obsolescence, demand, competition, other economic factors (such as the stability of the industry, legislative action that results in an uncertain or changing regulatory environment, and expected changes in distribution channels), the level of required maintenance expenditures, and the expected lives of other related groups of assets.\n24\nAs with goodwill, we test our indefinite-lived intangible assets (primarily trademarks) for impairment annually and whenever events or changes in circumstances indicate that their carrying value may not be recoverable. We cannot accurately predict the amount and timing of any impairments of these or other assets. Should the value of goodwill or other intangible assets become impaired, there could be an adverse effect on our financial condition and results of operations.\nChanges in tax laws and unanticipated tax liabilities could adversely affect our financial results.\nWe are primarily subject to income and other taxes in the United States. Our effective income tax rate and other taxes in the future could be adversely affected by a number of factors, including changes in the valuation of deferred tax assets and liabilities, changes in tax laws or other legislative changes and the outcome of income tax or other tax audits. Although we believe our tax estimates are reasonable, the final determination of tax audits could be materially different from our historical tax accruals and income tax provisions. The results of a tax audit could have a material effect on our results of operations or cash flows in the period or periods for which that determination is made. In addition, our effective income tax rate and our results may be impacted by our ability to realize deferred tax benefits and by any increases or decreases of our valuation allowances applied to our existing deferred tax assets. \nFailure of our internal controls over financial reporting and future changes in accounting standards may cause adverse unexpected operating results, affect our reported results of operations or otherwise harm our business and financial results.\nOur management is responsible for establishing and maintaining effective internal control over financial reporting.  Internal control over financial reporting is a process to provide reasonable assurance regarding the reliability of financial reporting for external purposes in accordance with accounting principles generally accepted in the United States. Because of its inherent limitations, internal control over financial reporting is not intended to provide absolute assurance that we would prevent or detect a misstatement of our financial statements or fraud.  Our growth and acquisition of other restaurant companies with procedures not identical to our own could place significant additional pressure on our system of internal control over financial reporting.  Any failure to maintain an effective system of internal control over financial reporting could limit our ability to report our financial results accurately and timely or to detect and prevent fraud.  A significant financial reporting failure or material weakness in internal control over financial reporting could cause a loss of investor confidence and decline in the market price of our common stock, increase our costs, lead to litigation or result in negative publicity that could damage our reputation.\nA change in accounting standards can have a significant effect on our reported results and may affect our reporting of transactions before the change is effective.  New pronouncements and varying interpretations of pronouncements have occurred and may occur in the future.  Changes to existing accounting rules or the application of current accounting practices may adversely affect our reported financial results.  Additionally, our assumptions, estimates and judgments related to complex accounting matters could significantly affect our financial results. Generally accepted accounting principles and related accounting pronouncements, implementation guidelines and interpretations with regard to a wide range of matters that are relevant to our business, including but not limited to, revenue recognition, fair value of investments, impairment of long-lived assets, leases and related economic transactions, derivatives, pension and post-retirement benefits, intangibles, self-insurance, income taxes, property and equipment, unclaimed property laws and litigation, and stock-based compensation are highly complex and involve many subjective assumptions, estimates and judgments by us.  Changes in these rules or their interpretation or changes in underlying assumptions, estimates or judgments by us could significantly change our reported or expected financial performance.\nItem 1B.  UNRESOLVED STAFF COMMENTS\nNone.\nItem 1C.  Cybersecurity\nRisk Management and Strategy\nWe have implemented policies and procedures intended to manage and reduce cybersecurity risk that are \nintegrated with the Enterprise Risk Management (“ERM”) framework\n utilized by management and the Audit Committee to oversee our various top enterprise risks.\n We maintain an incident response plan that is designed to protect against, identify, evaluate, respond to and recover from a cybersecurity related incident. The plan provides for the creation of an incident response team in the event of an incident and it is designed to be flexible enough to accommodate a broad array of potential scenarios. The incident response team is a cross-functional group that may be composed of both Company personnel and external service providers, and that is tailored to a particular incident so that individuals with appropriate experience and expertise are available. We conduct regular exercises to help ensure the plan’s effectiveness and our overall response preparedness.\n25\nWe have also invested in various tools to protect our data and information technology. We maintain a robust system of data protection and cybersecurity resources, technology and processes, and we regularly evaluate new and emerging risks and ever-changing legal and compliance requirements. We make ongoing strategic investments to address these risks, including maintaining insurance coverage to mitigate the potential financial consequences of cybersecurity incidents, and compliance requirements and help keep Company, guest and team member data secure. We monitor risks of sensitive information compromise at our business partners, where relevant, and reevaluate these risks on a periodic basis. In addition, we have a cybersecurity training program designed to educate and train employees how to identify and report cybersecurity threats. Training programs are conducted on a periodic\n \nbasis and are focused on giving employees the awareness and tools to manage the most relevant and prevalent cybersecurity risks to us. We also provide specialized training for employees in more sensitive roles.\n \nFor example, we perform annual and ongoing cybersecurity awareness training for our restaurant management and restaurant support center team members. In addition, we provide annual credit card handling training following Payment Card Industry (PCI) guidelines to all team members that handle guest credit cards. We conduct regular drills, such as tabletop exercises led by third party consultants, to support our overall preparedness for a variety of scenarios. \nWe take measures to regularly update and improve our cybersecurity program, including conducting independent program assessments, penetration testing and scanning of our systems for vulnerabilities. \nWe periodically engage third parties to perform cybersecurity audits to measure the maturity of our cybersecurity program against the National Institute of Standards and Technology (NIST) Framework. We also engage third parties to conduct security reviews of our network, processes and systems on a regular basis to identify opportunities and enhancements to strengthen our policies and practices.\n \nWith respect to third-party service providers, our information security program includes conducting due diligence of relevant service providers’ information security programs prior to onboarding and we continue to reassess vendors using a risk-based approach. We also contractually require third-party service providers with access to our information technology systems, sensitive business data or personal information to implement and maintain appropriate security controls and contractually restrict their ability to use our data, including personal information, for purposes other than to provide services to us, except as required by law. To oversee the risks associated with these service providers, we work with them to help ensure that their cybersecurity protocols are appropriate to the risk presented by their access to or use of our systems and/or data, including notification and coordination concerning incidents occurring on third-party systems that may affect us.\n Our service providers are contractually required to notify us promptly of information security incidents occurring on their systems that may affect our systems or data, including personal information.\nAlthough we have invested in the protection of our data and information technology and monitor our systems on an ongoing basis, there can be no assurance that such efforts will prevent material compromises to our information technology systems in the future that could have a material adverse effect on our business.  \nAs of the date of this filing, we are not aware of any current cybersecurity threats or incidents that have materially affected or are reasonably likely to materially affect our business, results of operations or financial condition.\n For further discussion of the risks related to cybersecurity, see the risk factors discussed under “Risks Relating to Information Technology, Cybersecurity and Privacy” in our Risk Factors in"
}