{
  "ticker": "DUK",
  "cik": "0001326160",
  "company_name": "Duke Energy CORP",
  "filing_date": "2025-02-27",
  "accession": "0001326160-25-000072",
  "primary_doc": "duk-20241231.htm",
  "item1_text": "Item 1, \"Business – Information about Our Executive Officers,\" in this Annual Report. Duke Energy will provide information that is responsive to the remainder of this Item 10 in its definitive proxy statement or in an amendment to this Annual Report not later than 120 days after the end of the fiscal year covered by this Annual Report. That information is incorporated in this Item 10 by reference.\nInsider Trading Policy\nWe have adopted \ntrading policies and procedures\n governing the purchase, sale, and/or other dispositions of Duke Energy's securities by directors, officers and employees or the Company itself that are reasonably designed to promote compliance with insider trading laws, rules and regulations, and any listing standards applicable to the Company. A copy of our Securities Trading Policy is filed as Exhibit 19 to this Annual Report on Form 10-K.\nITEM 11. EXECUTIVE COMPENSATION\nDuke Energy will provide information that is responsive to this Item 11 in its definitive proxy statement or in an amendment to this Annual Report not later than 120 days after the end of the fiscal year covered by this Annual Report. That information is incorporated in this Item 11 by reference.\nPolicies Related to Stock Option Grants and Similar Option-Like Instruments\nThe Compensation and People Development Committee of the Board of Directors (the Compensation Committee) maintains an equity grant policy which establishes the specific procedures for the timing of equity awards. We have not granted stock options to our employees since 2013, so the policy currently governs the timing of RSUs and performance shares granted to our employees and stock awards granted to our independent directors. Under this policy, annual grants may be made at any previously scheduled meeting of the Compensation Committee or the Board of Directors, provided that reasonable efforts will be made to make such grants at the first regularly scheduled meeting of each calendar year, and annual grants to independent directors may be made by the Board of Directors at any previously scheduled meeting of the Board of Directors, provided that reasonable efforts will be made to make such grants at the regularly scheduled meeting of the Board of Directors that is held in conjunction with the annual meeting each year. Other stock award grants may be made during any \"open window period\" as defined in our securities trading policy or on the same day as any previously scheduled meeting of the Board of Directors or the Compensation Committee. We have not timed the release of material non-public information for the purpose of affecting the value of any executive or director compensation, and we have no plan to do so.\n237\nOTHER INFORMATION\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nEquity Compensation Plan Information\nThe following table shows information as of December 31, 2024, about securities to be issued upon exercise of outstanding options, warrants and rights under Duke Energy's equity compensation plans, along with the weighted average exercise price of the outstanding options, warrants and rights and the number of securities remaining available for future issuance under the plans.\nPlan Category\nNumber of securities \nto be issued upon \nexercise of \noutstanding options, \nwarrants and rights\n(a)\nWeighted average \nexercise price of \noutstanding options, \nwarrants and rights \n(b)\n(1)\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\n(c)\nEquity compensation plans approved by security holders\n3,680,932 \n(2)\nn/a\n13,585,751\n(3)\nEquity compensation plans not approved by security holders\n99,986 \n(4)\nn/a\nn/a\n(5)\nTotal\n3,780,918 \nn/a\n13,585,751\n(1)    As of December 31, 2024, no options were outstanding under equity compensation plans.\n(2)    Includes RSUs and performance shares (assuming the maximum payout level) granted under the Duke Energy Corporation 2015 Long-Term Incentive Plan or the Duke Energy Corporation 2023 Long-Term Incentive Plan, as well as shares that could be payable with respect to certain compensation deferred under the Duke Energy Corporation Executive Savings Plan (Executive Savings Plan) or the Duke Energy Corporation Directors’ Savings Plan (Directors' Savings Plan). \n(3)    Includes shares remaining available for issuance pursuant to stock awards under the Duke Energy Corporation 2023 Long-Term Incentive Plan. The Duke Energy Corporation 2015 Long-Term Incentive Plan is no longer available for the grant of additional stock awards.\n(4)    Includes shares that could be payable with respect to certain compensation deferred under the Executive Savings Plan or the Directors' Savings Plan, each of which is a non-qualified deferred compensation plan described in more detail below.\n(5)    The number of shares remaining available for future issuance under equity compensation plans not approved by security holders cannot be determined because it is based on the amount of future voluntary deferrals, if any, under the Executive Savings Plan and the Directors' Savings Plan.\nUnder the Executive Savings Plan, participants can elect to defer a portion of their base salary and short‑term incentive compensation. Participants also receive a company matching contribution in excess of the contribution limits prescribed by the Internal Revenue Code under the Duke Energy Retirement Savings Plan, which is the 401(k) plan in which employees are generally eligible to participate. Eligible participants may also earn pay credits based on age and length of service on eligible earnings that exceed limits prescribed by the Internal Revenue Code.\nIn general, payments are made following termination of employment or death in the form of a lump sum or installments, as selected by the participant. Participants may direct the deemed investment of their accounts (with certain exceptions) among investment options available under the Duke Energy Retirement Savings Plan, including the Duke Energy Common Stock Fund. Participants may change their investment elections on a daily basis. Deferrals of equity awards are credited with earnings and losses based on the performance of the Duke Energy Common Stock Fund. The benefits payable under the plan are unfunded and subject to the claims of Duke Energy’s creditors.\nUnder the Directors’ Savings Plan, outside directors may elect to defer all or a portion of their annual compensation, generally consisting of retainers. Deferred amounts are credited to an unfunded account, the balance of which is adjusted for the performance of phantom investment options, including the Duke Energy Common Stock Fund, as elected by the director, and generally are paid when the director terminates his or her service from the Board of Directors.\nDuke Energy will provide additional information that is responsive to this Item 12 in its definitive proxy statement or in an amendment to this Annual Report not later than 120 days after the end of the fiscal year covered by this Annual Report. That information is incorporated in this Item 12 by reference.\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nDuke Energy will provide information that is responsive to this Item 13 in its definitive proxy statement or in an amendment to this Annual Report not later than 120 days after the end of the fiscal year covered by this Annual Report. That information is incorporated in this Item 13 by reference.\n238\nOTHER INFORMATION\nITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nDeloitte provided professional services to the Duke Energy Registrants. The following tables present the Deloitte fees for services rendered to the Duke Energy Registrants during 2024 and 2023.\n \nYear Ended December 31, 2024\nDuke\nDuke\nDuke\nDuke\nDuke\nDuke\nEnergy\nProgress\nEnergy\nEnergy\nEnergy\nEnergy\n(in millions)\nEnergy\nCarolinas\nEnergy\nProgress\nFlorida\nOhio\nIndiana\nPiedmont\nTypes of Fees\n \n \n \n \n \n \n \nAudit Fees\n(a)\n$\n14.7\n \n$\n3.4\n \n$\n5.2\n \n$\n2.7\n \n$\n2.5\n \n$\n2.2\n \n$\n1.9\n \n$\n1.4\n \nAudit-Related Fees\n(b)\n0.7\n \n0.1\n \n0.4\n \n0.3\n \n0.1\n \n0.2\n \n—\n \n—\n \nTotal Fees \n$\n15.4\n \n$\n3.5\n \n$\n5.6\n \n$\n3.0\n \n$\n2.6\n \n$\n2.4\n \n$\n1.9\n \n$\n1.4\n \n \nYear Ended December 31, 2023\nDuke\nDuke\nDuke\nDuke\nDuke\nDuke\nEnergy\nProgress\nEnergy\nEnergy\nEnergy\nEnergy\n(in millions)\nEnergy\nCarolinas\nEnergy\nProgress\nFlorida\nOhio\nIndiana\nPiedmont\nTypes of Fees\n \n \n \n \n \n \n \nAudit Fees\n(a)\n$\n14.0 \n$\n3.3 \n$\n5.0 \n$\n2.5 \n$\n2.5 \n$\n2.1 \n$\n1.8 \n$\n1.4 \nAudit-Related Fees\n(b)\n0.5 \n0.1 \n0.2 \n0.1 \n0.1 \n0.2 \n— \n— \nTotal Fees \n$\n14.5 \n$\n3.4 \n$\n5.2 \n$\n2.6 \n$\n2.6 \n$\n2.3 \n$\n1.8 \n$\n1.4 \n(a)    Audit Fees are fees billed, or expected to be billed, by Deloitte for professional services for the financial statement audits, audit of the Duke Energy Registrants’ financial statements included in Duke Energy's Annual Report on Form 10-K, reviews of financial statements included in Quarterly Reports on Form 10‑Q, and services associated with securities filings such as comfort letters and consents. \n(b)    Audit-Related Fees are fees billed, or expected to be billed, by Deloitte for assurance and related services that are reasonably related to the performance of an audit or review of financial statements, including statutory reporting requirements.\nTo safeguard the continued independence of the independent auditor, the Audit Committee of Duke Energy adopted a policy that all services provided by the independent auditor require preapproval by the Audit Committee. Pursuant to the policy, certain audit services, audit-related services, tax services and other services have been specifically preapproved up to fee limits. In the event the cost of any of these services may exceed the fee limits, the Audit Committee must specifically approve the service. All services performed in 2024 and 2023 by the independent accountant were approved by the Audit Committee pursuant to the preapproval policy.\n239\nEXHIBITS\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)     Consolidated Financial Statements and Supplemental Schedules included in Part II of this Annual Report are as follows:\nDuke Energy Corporation\nConsolidated Financial Statements\nConsolidated Statements of Operations for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Balance Sheets as of December 31, 2024, and 2023 \nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Changes in Equity for the Years Ended December 31, 2024, 2023 and 2022 \nNotes to the Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nAll other schedules are omitted because they are not required, or because the required information is included in the Consolidated Financial Statements or Notes.\nDuke Energy Carolinas, LLC\nConsolidated Financial Statements\nConsolidated Statements of Operations and Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Balance Sheets as of December 31, 2024, and 2023 \nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Changes in Equity for the Years Ended December 31, 2024, 2023 and 2022 \nNotes to the Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nAll other schedules are omitted because they are not required, or because the required information is included in the Consolidated Financial Statements or Notes.\nProgress Energy, Inc.\nConsolidated Financial Statements\nConsolidated Statements of Operations and Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Balance Sheets as of December 31, 2024, and 2023 \nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Changes in Equity for the Years Ended December 31, 2024, 2023 and 2022 \nNotes to the Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nAll other schedules are omitted because they are not required, or because the required information is included in the Consolidated Financial Statements or Notes.\nDuke Energy Progress, LLC \nConsolidated Financial Statements\nConsolidated Statements of Operations and Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Balance Sheets as of December 31, 2024, and 2023 \nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Changes in Equity for the Years Ended December 31, 2024, 2023 and 2022 \nNotes to the Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nAll other schedules are omitted because they are not required, or because the required information is included in the Consolidated Financial Statements or Notes.\nDuke Energy Florida, LLC \nConsolidated Financial Statements\nConsolidated Statements of Operations and Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Balance Sheets as of December 31, 2024, and 2023 \nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Changes in Equity for the Years Ended December 31, 2024, 2023 and 2022 \nNotes to the Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nAll other schedules are omitted because they are not required, or because the required information is included in the Consolidated Financial Statements or Notes.\nDuke Energy Ohio, Inc.\nConsolidated Financial Statements\nConsolidated Statements of Operations and Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Balance Sheets as of December 31, 2024, and 2023 \nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Changes in Equity for the Years Ended December 31, 2024, 2023 and 2022 \nNotes to the Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nAll other schedules are omitted because they are not required, or because the required information is included in the Consolidated Financial Statements or Notes.\n240\nEXHIBITS\nDuke Energy Indiana, LLC\nConsolidated Financial Statements\nConsolidated Statements of Operations and Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Balance Sheets as of December 31, 2024, and 2023 \nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022 \nConsolidated Statements of Changes in Equity for the Years Ended December 31, 2024, 2023 and 2022 \nNotes to the Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nAll other schedules are omitted because they are not required, or because the required information is included in the Consolidated Financial Statements or Notes.\nPiedmont Natural Gas Company, Inc.\nConsolidated Financial Statements\nConsolidated Statements of Operations and Comprehensive Income for the Years Ended December 31, 2024, 2023 and 2022\nConsolidated Balance Sheets as of December 31, 2024, and 2023 \nConsolidated Statements of Cash Flows for the Years Ended December 31, 2024, 2023 and 2022\nConsolidated Statements of Changes in Equity for the Years Ended December 31, 2024, 2023 and 2022\nNotes to the Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nAll other schedules are omitted because they are not required, or because the required information is included in the Consolidated Financial Statements or Notes.\n241\nEXHIBITS\nEXHIBIT INDEX\nExhibits filed herewith are designated by an asterisk (*). All exhibits not so designated are incorporated by reference to a prior filing, as indicated. Items constituting management contracts or compensatory plans or arrangements are designated by a double asterisk (**). The Company agrees to furnish upon request to the commission a copy of any omitted schedules or exhibits upon request on all items designated by a triple asterisk (***). \nDuke\nDuke\nDuke\nDuke\nDuke\nExhibit\nDuke\nEnergy\nProgress\nEnergy\nEnergy\nEnergy\nEnergy\nNumber\nEnergy\nCarolinas\nEnergy\nProgress\nFlorida\nOhio\nIndiana\nPiedmont\n2.1\nAgreement and Plan of Merger between Duke Energy Corporation, Diamond Acquisition Corporation and Progress Energy, Inc., dated as of January 8, 2011 (incorporated by reference to Exhibit 2.1 to \nD\nu\nk\ne\n \nE\nn\ne\nr\ng\ny\n \nC\no\nr\np\no\nr\na\nt\ni\no\nn\n'\ns\n Current Report on Form 8-K filed on January 11, 2011, File No. 1-32853).\nX\n \n \n \nX \n \n \n \n \n \n \n \n \n2.2\nAgreement and Plan of Merger between Piedmont Natural Gas Company, Duke Energy Corporation and Forest Subsidiary, Inc. (incorporated by reference to Exhibit 2.1 to Duke Energy Corporation's Current Report on Form 8-K filed on October 26, 2015, File No. 1-32853).\n \nX\nX\n3.1\nAmended and Restated Certificate of Incorporation\n of Duke Energy Corporation\n (incorporated by reference to Exhibit 3.1 to \nregistrant's\n Current Report on Form 8-K filed on May 20, 2014, File No. 1-32853).\nX\n3.2\nAmended and Restated By-Laws\n \nof Duke Energy Corporation\n, effective as of May 8, 202\n4 \n(incorporated by reference to Exhibit 3.1 to \nregistra\nnt's \nCurrent Report on Form 8-K filed on May 13, 2024, File No. 1-32853).\nX\n3.3\nArticles of Organization including Articles of Conversion \nof \nDuke Energy Carolina's, LLC \n(incorporated by reference to Exhibit 3.1 to \nregistrant's\n Current Report on Form 8-K filed on April 7, 2006, File No. 1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n3.3.1\nAmended Articles of Organization\n of Duke Energy Carolinas, LLC\n, effective October 1, 2006 (incorporated by reference to Exhibit 3.1 to \nregistrant'\ns \nQuarterly Report on Form 10-Q for the quarter ended September 30, 2006, filed on November 13, 2006, File No. 1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n3.4\nAmended Articles of Incorporation of Duke Energy Ohio, Inc. (formerly The Cincinnati Gas & Electric Company), effective October 23, 1996, (incorporated by reference to Exhibit 3(a) to registrant's Quarterly Report on Form 10-Q for the quarter ended September 30, 1996, filed on November 13, 1996, File No. 1-1232).\n \n \n \n \n \n \n \n \n \n \nX\n \n \n3.4.1\nAmended Articles of Incorporation, effective September 19, 2006 (incorporated by reference to Exhibit 3.1 to Duke Energy Ohio, Inc.'s (formerly The Cincinnati Gas & Electric Company) Quarterly Report on Form 10-Q for the quarter ended September 30, 2006, filed on November 17, 2006, File No. 1-1232).\n \n \n \n \n \n \n \n \n \n \nX\n \n \n3.5\nCertificate of Conversion of Duke Energy Indiana, LLC (incorporated by reference to Exhibit 3.1 to registrant's Current Report on Form 8-K filed on January 4, 2016, File No. 1-3543). \n \n \n \n \n \n \n \n \n \n \n \n \nX\n3.5.1\nArticles of Entity Conversion of Duke Energy Indiana, LLC (incorporated by reference to Exhibit 3.2 to registrant's Current Report on Form 8-K filed on January 4, 2016, File No. 1-3543). \n \n \n \n \n \n \n \n \n \n \n \n \nX\n3.5.2\nPlan of Entity Conversion of Duke Energy Indiana, LLC (incorporated by reference to Exhibit 3.3 to registrant's Current Report on Form 8-K filed on January 4, 2016, File No. 1-3543). \n \n \n \n \n \n \n \n \n \n \n \n \nX\n3.5.3\nArticles of Organization of Duke Energy Indiana, LLC (incorporated by reference to Exhibit 3.4 to registrant's Current Report on Form 8-K filed on January 4, 2016, File No. 1-3543).\nX\n3.5.4\nAmended and Restated Limited Liability Company Operating Agreement of Duke Energy Indiana, LLC, dated August 25, 2021 (incorporated by reference to Exhibit 3.1 to registrant's Quarterly Report on Form 10-Q for the quarter ended September 30, 2021, filed on November 4, 2021, File No. 1-3543).\nX\n3.6\nLimited Liability Company Operating Agreement of Duke Energy Carolinas, LLC (incorporated by reference to Exhibit 3.2 to registrant's Current Report on Form 8-K filed on April 7, 2006, File No. 1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n3.7\nRegulations of Duke Energy Ohio, Inc. (formerly The Cincinnati Gas & Electric Company), effective July 23, 2003 (incorporated by reference to Exhibit 3.2 to registrant's Quarterly Report on Form 10-Q for the quarter ended June 30, 2003, filed on August 13, 2003, File No. 1-1232).\n \n \n \n \n \n \n \n \n \n \nX\n \n \n3.8\nArticles of Organization including Articles of Conversion for Duke Energy Progress, LLC (incorporated by reference to Exhibit 3.1 to registrant's Current Report on Form 8-K filed on August 4, 2015, File No. 1-3382).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n3.8.1\nPlan of Conversion of Duke Energy Progress, Inc. (incorporated by reference to Exhibit 3.2 to registrant's Current Report on Form 8-K filed on August 4, 2015, File No. 1-3382).\nX\n3.8.2\nLimited Liability Company Operating Agreement of Duke Energy Progress, LLC (incorporated by reference to Exhibit 3.3 to registrant's Current Report on Form 8-K filed on August 4, 2015, File No. 1-3382).  \nX\n*3.9\nArticles of Merger of Diamond Acquisition Corporation into Progress Energy, Inc. and Articles of Incorporation of Progress Energy, Inc., effective July 2, 2012.\nX\n*3.10\nBy-Laws of Progress Energy, Inc. (formerly Diamond Acquisition Corporation), effective July 2, 2012.\nX\n3.11\nArticles of Conversion for Duke Energy Florida, LLC (incorporated by reference to Exhibit 3.4 to registrant's Current Report on Form 8-K filed on August 4, 2015, File No. 1-3274). \n \n \n \n \n \n \n \n \nX\n \n \n \n \n3.11.1\nArticles of Organization for Duke Energy Florida, LLC (incorporated by reference to Exhibit 3.5 to registrant's Current Report on Form 8-K filed on August 4, 2015, File No. 1-3274). \n \n \n \n \n \n \n \nX\n \n \n \n \n \n3.11.2\nPlan of Conversion of Duke Energy Florida, Inc. (incorporated by reference to Exhibit 3.6 to registrant's Current Report on Form 8-K filed on August 4, 2015, File No. 1-3274). \n \n \n \n \n \n \n \n \nX\n \n \n \n \n3.11.3\nLimited Liability Company Operating Agreement of Duke Energy Florida, LLC (incorporated by reference to Exhibit 3.7 to registrant's Current Report on Form 8-K filed on August 4, 2015, File No. 1-3274). \nX\n3.12\nAmended and Restated Articles of Incorporation of Piedmont Natural Gas Company, Inc., dated as of October 3, 2016 (incorporated by reference to Exhibit 3.1 to registrant's Annual Report on Form 10-K for the fiscal year ended October 31, 2016, filed on December 22, 2016, File No. 001-06196).\nX\n3.12.1\nBy\n-L\naws of Piedmont Natural Gas Company, Inc., as amended and restated effective October 3, 2016 (incorporated by reference to Exhibit 3.2 to registrant's Current Report on Form 8-K filed on October 3, 2016, File No. 1-06196). \nX\n3.13\nCertificate of Designations with respect to Series A Preferred Stock, dated March 28, 2019 (incorporated by reference to Exhibit 3.1 to registrant’s Current Report on Form 8-K filed on March 29, 2019, File No. 1-32853). \nX\n3.14\nCertificate of Designation with respect to the Series B Preferred Stock, dated September 11, 2019 (incorporated by reference to Exhibit 3.1 to registrant’s Current Report on Form 8-K filed on September 12, 2019, File No. 1-32853).\nX\n3.15\nDescription of Registered Securities (incorporated by reference from the registrant's prospectus contained in Form S-3 filed on September 23, 2019, File No. 333-233896,under the headings \"Description of Common Stock,\" \"Description of Preferred Stock,\" \"Description of Depositary Shares,\" \"Description of Stock Purchase Contracts and Stock Purchase Units,\" and \"Description of Debt Securities\").\nX\n3.16\nDescription of Registered Securities (incorporated by reference from the registrant’s prospectus contained in Form S-3 filed on September 23, 2019, File No. 333-233896-01, under the heading \"Description of Debt Securities\").\nX\n3.17\nDescription of Registered Securities (incorporated by reference from the registrant’s prospectus contained in Form S-3 filed on September 23, 2019, File No. 333-233896-02, under the headings \"Description of First Mortgage Bonds\" and \"Description of Debt Securities\").\nX\n3.18\nDescription of Registered Securities (incorporated by reference from the registrant’s prospectus contained in Form S-3 filed on September 23, 2019, File No. 333-233896-03, under the headings \"Description of First Mortgage Bonds\" and \"Description of Unsecured Debt Securities\"). \nX\n3.19\nDescription of Registered Securities (incorporated by reference from the registrant’s prospectus contained in Form S-3 filed on September 23, 2019, File No. 333-233896-04, under the headings \"Description of First Mortgage Bonds\" and \"Description of Unsecured Debt Securities\"). \nX\n3.20\nDescription of Registered Securities (incorporated by reference from the registrant’s prospectus contained in Form S-3 filed on September 23, 2019, File No. 333-233896-05, under the headings \"Description of First Mortgage Bonds\" and \"Description of Debt Securities\"). \nX\n3.21\nDescription of Registered Securities (incorporated by reference from the registrant’s prospectus contained in Form S-3 filed on September 23, 2019, File No. 333-233896-06, under the headings \"Description of First and Refunding Mortgage Bonds,\" \"Description of Senior Notes,\" and \"Description of Subordinate Notes\"). \nX\n4.1\nIndenture between Duke Energy Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, dated as of June 3, 2008 (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Current Report on Form 8-K filed on June 16, 2008, File No. 1-32853).\nX\n \n \n \n \n \n \n \n \n \n \n \n \n4.1.1\nFirst Supplemental Indenture, dated as of June 16, 2008 (incorporated by reference to Exhibit 4.2 to Duke Energy Corporation's Current Report on Form 8-K filed on June 16, 2008, File No. 1-32853).\nX\n \n \n \n \n \n \n \n \n \n \n \n \n4.1.2\nSecond Supplemental Indenture, dated as of January 26, 2009 (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Current Report on Form 8-K filed on January 26, 2009, File No. 1-32853).\nX\n \n \n \n \n \n \n \n \n \n \n \n \n4.1.3\nThird Supplemental Indenture, dated as of August 28, 2009 (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Current Report on Form 8-K filed on August 28, 2009, File No. 1-32853).\nX\n \n \n \n \n \n \n \n \n \n \n \n \n4.1.4\nFourth Supplemental Indenture, dated as of March 25, 2010 (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Current Report on Form 8-K filed on March 25, 2010, File No. 1-32853).\nX\n \n \n \n \n \n \n \n \n \n \n \n \n4.1.5\nFifth Supplemental Indenture, dated as of August 25, 2011 (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Current Report on Form 8-K filed on August 25, 2011, File No. 1-32853).\nX\n \n \n \n \n \n \n \n \n \n \n \n \n4.1.6\nSixth Supplemental Indenture, dated as of November 17, 2011 (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Current Report on Form 8-K filed on November 17, 2011, File No. 1-32853).\nX\n \n \n \n \n \n \n \n \n \n \n \n \n4.1.7\nSeventh Supplemental Indenture, dated as of August 16, 2012 (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Current Report on Form 8-K filed on August 16, 2012, File No. 1-32853).\nX\n \n \n \n \n \n \n \n \n \n \n \n \n4.1.8\nEighth Supplemental Indenture, dated as of January 14, 2013 (incorporated by reference to Exhibit 2 to the Registration Statement o\nn\n Form 8-A of Duke Energy Corporation filed on January 14, 2013, File No. 1-32853).\nX\n \n \n \n \n \n \n \n \n \n \n \n \n4.1.9\nNinth Supplemental Indenture, dated as of June 13, 2013 (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Current Report on Form 8-K filed on June 13, 2013, File No. 1-32853).\nX\n \n \n \n \n \n \n \n \n \n \n \n \n4.1.10\nTenth Supplemental Indenture, dated as of October 11, 2013 (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Current Report on Form 8-K filed on October 11, 2013, File No. 1-32853).\nX\n \n \n \n \n \n \n \n \n \n \n \n \n4.1.11\nEleventh Supplemental Indenture, dated as of April 4, 2014 (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Current Report on Form 8-K filed on April 4, 2014, File No. 1-32853).\n \nX\n4.1.12\nTwelfth Supplemental Indenture, dated as of November 19, 2015 (incorporated by reference to Exhibit 4.2 to Duke Energy Corporation's Current Report on Form 8-K filed on November 19, 2015, File No. 1-32853). \nX\n4.1.13\nThirteenth Supplemental Indenture, dated as of April 18, 2016, to the indenture dated as of June 3, 2008, between Duke Energy Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the quarter ended March 31, 2016, filed on May 5, 2016, File No. 1-32853).\nX\n4.1.14\nFourteenth Supplemental Indenture, dated as of August 12, 2016 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on August 12, 2016, File No. 1-32853). \nX\n4.1.15\nFifteenth Supplemental Indenture, dated as of April 11, 2017 (incorporated by reference to Exhibit 4.2 to registrant's Quarterly Report on Form 10-Q for the quarter ended March 31, 2017, filed on May 9, 2017, File No. 1-32853).\nX\n4.1.16\nSixteenth Supplemental Indenture, dated as of June 13, 2017 (incorporated by reference to Exhibit 4.1 to registrant's Quarterly Report on Form 10-Q for the quarter ended June 30, 2017, filed on August 3, 2017, File No. 1-32853). \nX\n4.1.17\nSeventeenth Supplemental Indenture, dated as of August 10, 2017 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on August 10, 2017, File No. 1-32853). \nX\n4.1.18\nEighteenth Supplemental Indenture, dated as of March 29, 2018 (incorporated by reference to Exhibit 4.2 to registrant's Quarterly Report on Form 10-Q for the quarter ended March 31, 2018, filed on May 10, 2018, File No. 1-32853).\nX\n4.1.19\nNineteenth Supplemental Indenture, dated as of May 16, 2018 (incorporated by reference to Exhibit 4.1 to registrant's Quarterly Report on Form 10-Q for the quarter ended June 30, 2018, filed on August 2, 2018, File No. 1-32853). \nX\n4.1.20\nTwentieth Supplemental Indenture (incorporated by reference to Exhibit 4.2 to registrant's Registration Statement on Form 8-A filed on September 17, 2018, File No. 1-32853).\nX\n4.1.21\nTwenty-first Supplemental Indenture (incorporated by reference to Exhibit 4.1 to registrant’s Current Report on Form 8-K filed on March 11, 2019, File no. 1-32853).\nX\n4.1.22\nTwenty-second Supplemental Indenture, dated as of June 7, 2019 (incorporated by reference to Exhibit 4.1 to registrant’s Current Report on Form 8-K filed on June 7, 2019, File No. 1-32853).\nX\n4.1.23\nTwenty-third Supplemental Indenture, dated as of May 15, 2020 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on May 15, 2020, File No. 1-32853). \nX\n4.1.24\nTwenty-fourth Supplemental Indenture, dated as of September 11, 2020 (incorporated by reference to Exhibit 4.2 to registrant's Current Report on Form 8-K filed on September 11, 2020, File No. 1-32853).\nX\n4.1.25\nTwenty-fifth Supplemental Indenture, dated as of June 10, 2021 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on June 10, 2021, File No. 1-32853).\nX\n4.1.26\nTwenty-sixth Supplemental Indenture, dated as of September 28, 2021 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on September 28, 2021, File No. 1-32853).\n \nX\n4.1.27\nTwenty-seventh Supplemental Indenture, dated as of June 15, 2022, to the indenture, dated as of June 3, 2008, between Duke Energy Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on June 15, 2022, File No. 1-32853).\nX\n4.1.28\nTwenty-eighth Supplemental Indenture, dated as of August 11, 2022, to the indenture, dated as of June 3, 2008, between Duke Energy Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, and forms of global notes included therein (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on August 11, 2022, File No. 1-32853).\nX\n4.1.29\nTwenty-ninth Supplemental Indenture, dated as of December 8, 2022, to the Indenture, dated as of June 3, 2008, between Duke Energy Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, and forms of global notes included therein (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on December 8, 2022, File No. 1-32853).\nX\n4.1.30\nThirtieth Supplemental Indenture, dated as of September 8, 2023, to the Indenture, dated as of June 3, 2008, between Duke Energy Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, and forms of global notes included therein (incorporated by reference to exhibit 4.1 to registrant's Current Report on Form 8-K filed on September 8, 2023, File No. 1-32853).\nX\n4.1.31\nThirty-second Supplemental Indenture, dated as of April 12, 2024, to the indenture, dated as of June 3, 2008, between the registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee, and form of global note (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on April 12, 2024, File No. 1-32853).\nX\n4.1.32\nThirty-third Supplemental Indenture, dated as of June 7, 2024, to the Indenture, dated as of June 3, 2008, between the registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee, and forms of global notes (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on June 7, 2024, File No. 1-32853).\nX\n4.1.33\nThirty-fourth Supplemental Indenture, dated as of August 22, 2024, between the registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee, and form of global debenture included therein (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on August 22, 2024, File No. 1-32853).\nX\n4.2\nIndenture, dated as of April 6, 2023, by and between Duke Energy Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, and form of global note included therein (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on April 6, 2023, File No. 1-32853).\nX\n4.3\nSenior Indenture between Duke Energy Carolinas, LLC and The Bank of New York Mellon Trust Company, N.A., as successor trustee to JPMorgan Chase Bank (formerly known as The Chase Manhattan Bank), dated as of September 1, 1998 (incorporated by reference to Exhibit 4-D-1 to registrant's Post-Effective Amendment No. 2 to Registration Statement on Form S-3 filed on April 7, 1999, File No. 333-14209).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.3.1\nFifteenth Supplemental Indenture, dated as of April 3, 2006 (incorporated by reference to Exhibit 4.4.1 to registrant's Registration Statement on Form S-3 filed on October 3, 2007, File No. 333-146483-03).\n \nX\n \n \n \n \n \n \n \n \n \n \n4.3.2\nSixteenth Supplemental Indenture, dated as of June 5, 2007 (incorporated by reference to Exhibit 4.1 registrant's Current Report on Form 8-K filed on June 6, 2007, File No. 1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4\nFirst and Refunding Mortgage from Duke Energy Carolinas, LLC to The Bank of New York Mellon Trust Company, N.A., successor trustee to Guaranty Trust Company of New York, dated as of December 1, 1927 (incorporated by reference to Exhibit 7(a) to registrant's Form S-1, effective October 15, 1947, File No. 2-7224).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.1\nInstrument of Resignation, Appointment and Acceptance among Duke Energy Carolinas, LLC, JPMorgan Chase Bank, N.A., as Trustee, and The Bank of New York Mellon Trust Company, N.A., as Successor Trustee, dated as of September 24, 2007, (incorporated by reference to Exhibit 4.6.1 to registrant's Registration Statement on Form S-3 filed on October 3, 2007, File No. 333-146483).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.2\nNinth Supplemental Indenture, dated as of February 1, 1949 (incorporated by reference to Exhibit 7(j) to registrant's Form S-1 filed on February 3, 1949, File No. 2-7808).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.3\nTwentieth Supplemental Indenture, dated as of June 15, 1964 (incorporated by reference to Exhibit 4-B-20 to registrant's Form S-1 filed on August 23, 1966, File No. 2-25367).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.4\nTwenty-third Supplemental Indenture, dated as of February 1, 1968 (incorporated by reference to Exhibit 2-B-26 to registrant's Form S-9 filed on January 21, 1969, File No. 2-31304).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.5\nSixtieth Supplemental Indenture, dated as of March 1, 1990 (incorporated by reference to Exhibit 4-B-61 to registrant's Annual Report on Form 10-K for the year ended December 31, 1990, File No.1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.6\nSixty-third Supplemental Indenture, dated as of July 1, 1991 (incorporated by reference to Exhibit 4-B-64 to registrant's Registration Statement on Form S-3 filed on February 13, 1992, File No. 33-45501).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.7\nEighty-fourth Supplemental Indenture, dated as of March 20, 2006 (incorporated by reference to Exhibit 4.6.9 to registrant's Registration Statement on Form S-3 filed on October 3, 2007, File No. 333-146483-03).\n \nX \n \n \n \n \n \n \n \n \n \n \n4.4.8\nEighty-fifth Supplemental Indenture, dated as of January 10, 2008 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC’s Current Report on Form 8-K filed on January 11, 2008, File No.1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.9\nEighty-seventh Supplemental Indenture, dated as of April 14, 2008 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC’s Current Report on Form 8-K filed on April 15, 2008, File No.1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.10\nEighty-eighth Supplemental Indenture, dated as of November 17, 2008 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC’s Current Report on Form 8-K filed on November 20, 2008, File No.1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.11\nNinetieth Supplemental Indenture, dated as of November 19, 2009 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC’s Current Report on Form 8-K filed on November 19, 2009, File No.1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.12\nNinety-first Supplemental Indenture, dated as of June 7, 2010 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC’s Current Report on Form 8-K filed on June 7, 2010, File No.1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.13\nNinety-third Supplemental Indenture, dated as of May 19, 2011 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC’s Current Report on Form 8-K filed on May 19, 2011, File No.1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.14\nNinety-fourth Supplemental Indenture, dated as of December 8, 2011 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC’s Current Report on Form 8-K filed on December 8, 2011, File No.1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.15\nNinety-fifth Supplemental Indenture, dated as of September 21, 2012 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC’s Current Report on Form 8-K filed on September 21, 2012, File No.1-4928).\n \n \nX\n \n \n \n \n \n \n \n \n \n \n4.4.16\nNinety-sixth Supplemental Indenture, dated as of March 12, 2015, between Duke Energy Carolinas, LLC and The Bank of New York Mellon Trust Company, N.A., as Trustee (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC's Current Report on Form 8-K filed on March 12, 2015, File No. 1-4928). \nX\n4.4.17\nNinety-seventh Supplemental Indenture, dated as of March 11, 2016 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC's Current Report on Form 8-K filed on March 11, 2016, File No. 1-4928). \nX\n4.4.18\nNinety-eighth Supplemental Indenture, dated as of November 17, 2016 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC's Current Report on Form 8-K filed on November 17, 2016, File No. 1-4928). \nX\n4.4.19\nNinety-ninth Supplemental Indenture, dated as of November 14, 2017 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC Current Report on Form 8-K filed on November 14, 2017, File No. 1-4928).\nX\n4.4.20\nOne Hundredth Supplemental Indenture, dated as of March 1, 2018 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 1, 2018, File No. 1-4928).\nX\n4.4.21\nOne-\nh\nundred and \ns\necond Supplemental Indenture, dated as of August 14, 2019 (incorporated by reference to Exhibit 4.1 to registrant’s Current Report on Form 8-K filed on August 14, 2019, File No. 1-4928).\nX\n4.4.22\nOne-\nh\nundred and \nt\nhird Supplemental Indenture, dated as of January 8, 2020 (incorporated by reference to Exhibit 4.2 to registrant's Current Report on Form 8-K filed on January 8, 2020, File No. 1-4928).\nX\n4.4.23\nOne-\nh\nundred and \nf\nourth Supplemental Indenture, dated as of January 8, 2020 (incorporated by reference to Exhibit 4.3 to registrant's Current Report on Form 8-K filed on January 8, 2020, File No. 1-4928).\nX\n4.4.24\nOne-\nh\nundred and \nf\nifth Supplemental Indenture, dated as of April 1, 2021 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on April 1, 2021, File No. 1-4928).\nX\n4.4.25\nOne-\nh\nundred and \ns\nixth Supplemental Indenture, dated as of March 4, 2022 between the registrant and The Bank of New York Mellon Trust Company, N.A., as Trustee, and forms of global bonds representing the First and Refunding Mortgage Bonds, 2.85% Series due 2032 and First and Refunding Mortgage Bonds, 3.55% Series due 2052 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 4, 2022, File No. 1-32853).\nX\n4.4.26\nOne-\nh\nundred and \ns\neventh Supplemental Indenture, dated as of January 6, 2023, between Duke Energy Carolinas, LLC and The Bank of New York Mellon Trust Company, N.A., as Trustee (incorporated by reference to Exhibit 4.1 to registrant’s Current Report on Form 8-K filed on January 6, 2023, File No. 1-04928).\nX\n4.4.27\nOne-\nh\nundred and \ne\nighth Supplemental Indenture, dated as of June 15, 2023, between Duke Energy Carolinas, LLC and The Bank of New York Mellon Trust Company, N.A., as Trustee (incorporated by reference to Exhibit 4.2 to registrant’s Current Report on Form 8-K filed on June 15, 2023, File No. 1-04928).\nX\n4.4.28\nOne-\nh\nundred and \nn\ninth Supplemental Indenture, dated as of June 15, 2023, between Duke Energy Carolinas, LLC and The Bank of New York Mellon Trust Company, N.A., as Trustee (incorporated by reference to Exhibit 4.3 to registrant’s Current Report on Form 8-K filed on June 15, 2023, File No. 1-04928).\nX\n4.4.29\nOne-hundred and tenth Supplemental Indenture, dated as of January 5, 2024, between \nDuke Energy Carolinas, LLC\n and The Bank of New York Mellon Trust Company, N.A., as Trustee (incorporated by reference to Exhibit 4.2 to registrant's Current Report on Form 8-K, filed on January 5, 2024, File No. 1-04928).\nX\n4.4.30\nOne-\nh\nundred and \ne\nleventh Supplemental Indenture, dated as of January 5, 2024, between \nDuke Energy Carolinas, LLC\n and The Bank of New York Mellon Trust Company, N.A., as Trustee, and a form of global bonds representing the First and Refunding Mortgage Bonds, 4.85% Series due 2034 (incorporated by reference to Exhibit 4.3 to registrant's Current Report on Form 8-K, filed on January 5, 2024, File No. 1-04928).\nX\n4.5\nMortgage and Deed of Trust between Duke Energy Progress, Inc. (formerly Carolina Power & Light Company) and The Bank of New York Mellon (formerly Irving Trust Company) and Frederick G. Herbst (Tina D. Gonzalez, successor), as Trustees, dated as of May 1, 1940.\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.5.1\nFirst through Fifth Supplemental Indentures thereto (incorporated by reference to Exhibit 2(b), File No. 2-64189). \nX\n4.5.2\nSixth Supplemental Indenture dated April 1, 1960 (incorporated by reference to Exhibit 2(b)-5, File No. 2-16210).\nX\n4.5.3\nSeventh Supplemental Indenture dated November 1, 1961 (incorporated by reference to Exhibit 2(b)-6, File No. 2-16210).\nX\n4.5.4\nEighth Supplemental Indenture dated July 1, 1964 (incorporated by reference to Exhibit 4(b)-8, File No. 2-19118).\nX\n4.5.5\nNinth Supplemental Indenture dated April 1, 1966 (incorporated by reference to Exhibit 4(b)-2, File No. 2-22439).\nX\n4.5.6\nTenth Supplemental Indenture dated October 1, 1967 (incorporated by reference to Exhibit 4(b)-2, File No. 2-24624).\nX\n4.5.7\nEleventh Supplemental Indenture dated October 1, 1968 (incorporated by reference to Exhibit 2(c), File No. 2-27297).\nX\n4.5.8\nTwelfth Supplemental Indenture dated January 1, 1970 (incorporated by reference to Exhibit 2(c), File No. 2-30172).\nX\n4.5.9\nThirteenth Supplemental Indenture dated August 1, 1970 (incorporated by reference to Exhibit 2(c), File No. 2-35694).\nX\n4.5.10\nFourteenth Supplemental Indenture dated January 1, 1971 (incorporated by reference to Exhibit 2(c), File No. 2-37505).\nX\n4.5.11\nFifteenth Supplemental Indenture dated October 1, 1971 (incorporated by reference to Exhibit 2(c), File No. 2-39002).\nX\n4.5.12\nSixteenth Supplemental Indenture dated May 1, 1972 (incorporated by reference to Exhibit 2(c), File No. 2-41738).\nX\n4.5.13\nSeventeenth Supplemental Indenture dated November 1, 1973 (incorporated by reference to Exhibit 2(c), File No. 2-43439).\nX\n4.5.14\nEighteenth Supplemental Indenture dated (incorporated by reference to Exhibit 2(c), File No. 2-47751).\nX\n4.5.15\nNineteenth Supplemental Indenture dated May 1, 1974 (incorporated by reference to Exhibit 2(c), File No. 2-49347).\nX\n4.5.16\nTwentieth Supplemental Indenture dated December 1, 1974 (incorporated by reference to Exhibit 2(c), File No. 2-53113).\nX\n4.5.17\nTwenty-first Supplemental Indenture dated April 15, 1975 (incorporated by reference to Exhibit 2(d), File No. 2-53113).\nX\n4.5.18\nTwenty-second Supplemental Indenture dated October 1, 1977 (incorporated by reference to Exhibit 2(c), File No. 2-59511).\nX\n4.5.19\nTwenty-third Supplemental Indenture dated June 1, 1978 (incorporated by reference to Exhibit 2(c), File No. 2-61611).\nX\n4.5.20\nTwenty-fourth Supplemental Indenture dated May 15, 1979 (incorporated by reference to Exhibit 2(d), File No. 2-64189).\nX\n4.5.21\nTwenty-fifth Supplemental Indenture dated November 1, 1979 (incorporated by reference to Exhibit 2(c), File No. 2-65514).\nX\n4.5.22\nTwenty-sixth Supplemental Indenture dated November 1, 1979 (incorporated by reference to Exhibit 2(c), File No. 2-66851).\nX\n4.5.23\nTwenty-seventh Supplemental Indenture dated April 1, 1980 (incorporated by reference to Exhibit 2 (d), File No. 2-66851).\nX\n4.5.24\nTwenty-eighth Supplemental Indenture dated October 1, 1980 (incorporated by reference to Exhibit 4(b)-1, File No. 2-81299).\nX\n4.5.25\nTwenty-ninth Supplemental Indenture dated October 1, 1980 (incorporated by reference to Exhibit 4(b)-2, File No. 2-81299).\nX\n4.5.26\nThirtieth Supplemental Indenture dated December 1, 1982 (incorporated by reference to Exhibit 4(b)- 3, File No. 2-81299).\nX\n4.5.27\nThirty-first Supplemental Indenture dated March 15, 1983 (incorporated by reference to Exhibit 4(c)-1, File No. 2-95505).\nX\n4.5.28\nThirty-second Supplemental Indenture dated March 15, 1983 (incorporated by reference to Exhibit 4(c)-2, File No. 2-95505).\nX\n4.5.29\nThirty-third Supplemental Indenture dated December 1, 1983 (incorporated by reference to Exhibit 4(c)-3, File No. 2-95505).\nX\n4.5.30\nThirty-fourth Supplemental Indenture dated December 15, 1983 (incorporated by reference to Exhibit 4(c)-4, File No. 2-95505).\nX\n4.5.31\nThirty-fifth Supplemental Indenture dated April 1, 1984 (incorporated by reference to Exhibit 4(c)-5, File No. 2-95505).\nX\n4.5.32\nThirty-sixth Supplemental Indenture dated June 1, 1984 (incorporated by reference to Exhibit 4(c)-6, File No. 2-95505).\nX\n4.5.33\nThirty-seventh Supplemental Indenture dated June 1, 1984 (incorporated by reference to Exhibit 4(c)-7, File No. 2-95505).\nX\n4.5.34\nThirty-eighth Supplemental Indenture dated June 1, 1984 (incorporated by reference to Exhibit 4(c)- 8, File No. 2-95505).\nX\n4.5.35\nThirty-ninth Supplemental Indenture dated April 1, 1985 (incorporated by reference to Exhibit 4(b), File No. 33-25560).\nX\n4.5.36\nFortieth Supplemental Indenture dated October 1, 1985 (incorporated by reference to Exhibit 4(c), File No. 33-25560).\nX\n4.5.37\nForty-first Supplemental Indenture dated March 1, 1986 (incorporated by reference to Exhibit 4(d), File No. 33-25560).\nX\n4.5.38\nForty-second Supplemental Indenture dated July 1, 1986 (incorporated by reference to Exhibit 4(e), File No. 33-25560).\nX\n4.5.39\nForty-third Supplemental Indenture dated January 1, 1987 (incorporated by reference to Exhibit 4(f), File No. 33-25560).\nX\n4.5.40\nForty-fourth Supplemental Indenture dated December 1, 1987 (incorporated by reference to Exhibit 4(g), File No. 33-25560).\nX\n4.5.41\nForty-fifth Supplemental Indenture dated September 1, 1988 (incorporated by reference to Exhibit 4(h), File No. 33-25560).\nX\n4.5.42\nForty-sixth Supplemental Indenture dated April 1, 1989 (incorporated by reference to Exhibit 4(b), File No. 33-33431).\nX\n4.5.43\nForty-seventh Supplemental Indenture dated August 1, 1989 (incorporated by reference to Exhibit 4(c), File No. 33-33431).\nX\n4.5.44\nForty-eighth Supplemental Indenture dated November 15, 1990 (incorporated by reference to Exhibit 4(b), File No. 33-38298).\nX\n4.5.45\nForty-ninth Supplemental Indenture dated November 15, 1990 (incorporated by reference to Exhibit 4(c), File No. 33-38298).\nX\n4.5.46\nFiftieth Supplemental Indenture dated February 15, 1991 (incorporated by reference to Exhibit 4(h), File No. 33-42869).\nX\n4.5.47\nFifty-first Supplemental Indenture dated April 1, 1991 (incorporated by reference to Exhibit 4(i), File No. 33-42869).\nX\n4.5.48\nFifty-second Supplemental Indenture dated September 15, 1991(incorporated by reference to Exhibit 4(e), File No. 33-48607).\nX\n4.5.49\nFifty-third Supplemental Indenture dated January 1, 1992 (incorporated by reference to Exhibit 4(f), File No. 33-48607).\nX\n4.5.50\nFifty-fourth Supplemental Indenture dated April 15, 1992 (incorporated by reference to Exhibit 4 (g), File No. 33-48607).\nX\n4.5.51\nFifty-fifth Supplemental Indenture dated July 1, 1992 (incorporated by reference to Exhibit 4(e), File No. 33-55060).\nX\n4.5.52\nFifty-sixth Supplemental Indenture dated October 1, 1992 (incorporated by reference to Exhibit 4(f), File No. 33-55060).\nX\n4.5.53\nFifty-seventh Supplemental Indenture dated February 1, 1993 (incorporated by reference to Exhibit 4(e), File No. 33-60014).\nX\n4.5.54\nFifty-eighth Supplemental Indenture dated March 1, 1993 (incorporated by reference to Exhibit 4(f), File No. 33-60014).\nX\n4.5.55\nFifty-ninth Supplemental Indenture dated July 1, 1993 (incorporated by reference to Exhibit 4(a) to Post-Effective Amendment No. 1, File No. 33-38349).\nX\n4.5.56\nSixtieth Supplemental Indenture dated July 1, 1993 (incorporated by reference to Exhibit 4(b) to Post-Effective Amendment No. 1, File No. 33-38349).\nX\n4.5.57\nSixty-first Supplemental Indenture dated August 15, 1993 (incorporated by reference to Exhibit 4(e), File No. 33-50597).\nX\n4.5.58\nSixty-second Supplemental Indenture dated January 15, 1994 (incorporated by reference to Exhibit 4 to Duke Energy Progress’ Current Report on Form 8-K dated January 19, 1994, File No. 1-3382).\nX\n4.5.59\nSixty-third Supplemental Indenture dated May 1, 1994 (incorporated by reference to Exhibit 4(f) \nto\n Duke Energy Progress’ \nRegistration Statement on \nForm S-3, File No. 033-57835).\nX\n4.5.60\nSixty-fourth Supplemental Indenture dated August 15, 1997 (incorporated by reference to Exhibit to Duke Energy Progress’ Current Report on Form 8-K dated August 26, 1997, File No. 1-3382).\nX\n4.5.61\nSixty-fifth Supplemental Indenture dated April 1, 1998 (incorporated by reference to Exhibit 4(b) \nto\n Duke Energy Progress’ Registration Statement on Form S-3 filed December 18, 1998, File No. 333-69237).\nX\n4.5.62\nSixty-sixth Supplemental Indenture dated March 1, 1999 (incorporated by reference to Exhibit 4(c) to Duke Energy Progress’ Current Report on Form 8-K filed on March 19, 1999, File No. 1-3382).\nX\n4.5.63\nForm of Carolina Power & Light Company First Mortgage Bond, 6.80% Series Due August 15, 2007 (incorporated by reference to Exhibit 4 to Duke Energy Progress’ \nQuarterly Report on \nForm 10-Q for the period ended September 30, 1998, File No. 1-3382).\nX\n4.5.64\nSixty-eighth Supplemental Indenture dated April 1, 2000 (incorporated by reference to Exhibit No. 4(b) to Duke Energy Progress’ Current Report on Form 8-K filed on  April 20, 2000, File No. 1-3382).\nX\n4.5.65\nSixty-ninth Supplemental Indenture dated June 1, 2000 (incorporated by reference to Exhibit No. 4b(2) to Duke Energy Progress’ Annual Report on Form 10-K for the year ended December 31, 2000, filed on \nMarch 29, 2001, File No. 1-3382).\nX\n4.5.66\nSeventieth Supplemental Indenture dated July 1, 2000 (incorporated by reference to Exhibit 4b(3) to Duke Energy Progress’ Annual Report on Form 10-K for the year ended December 31, 2000, filed on\n March 29, 2001, File No. 1-3382)\n.\nX\n4.5.67\nSeventy-first Supplemental Indenture dated February 1, 2002 (incorporated by reference to Exhibit 4b(2) to Duke Energy Progress’ Annual Report on Form 10-K for the year ended December 31, 2001, filed on March 28, 2002, File No. 1-3382 and 1-15929). \nX\n4.5.68\nSeventy-second Supplemental Indenture, dated as of September 1, 2003 (incorporated by reference to Exhibit 4 to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Current Report on Form 8-K filed on September 12, 2003, File No. 1-3382).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.5.69\nSeventy-third Supplemental Indenture, dated as of March 1, 2005 (incorporated by reference to Exhibit 4 to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Current Report on Form 8-K filed on March 22, 2005, File No. 1-3382).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.5.70\nSeventy-fourth Supplemental Indenture, dated as of November 1, 2005 (incorporated by reference to Exhibit 4 to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Current Report on Form 8-K filed on November 30, 2005, File No. 1-3382).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.5.71\nSeventy-fifth Supplemental Indenture, dated as of March 1, 2008 (incorporated by reference to Exhibit 4 to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Current Report on Form 8-K filed on March 13, 2008, File No. 1-3382).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.5.72\nSeventy-sixth Supplemental Indenture, dated as of January 1, 2009 (incorporated by reference to Exhibit 4 to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Current Report on Form 8-K filed on January 15, 2009, File No. 1-3382).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.5.73\nSeventy-seventh Supplemental Indenture, dated as of June 18, 2009 (incorporated by reference to Exhibit 4 to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Current Report on Form 8-K filed on June 23, 2009, File No. 1-3382).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.5.74\nSeventy-eighth Supplemental Indenture, dated as of September 1, 2011 (incorporated by reference to Exhibit 4 to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Current Report on Form 8-K filed on September 15, 2011, File No. 1-3382).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.5.75\nSeventy-ninth Supplemental Indenture, dated as of May 1, 2012 (incorporated by reference to Exhibit 4 to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Current Report on Form 8-K filed on May 18, 2012, File No. 1-3382).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.5.76\nEightieth Supplemental Indenture, dated as of March 1, 2013 (incorporated by reference to Exhibit 4.1 to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Current Report on Form 8-K filed on March 12, 2013, File No. 1-3382).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.5.77\nEighty-second Supplemental Indenture, dated as of March 1, 2014, between Duke Energy Progress, Inc. and The Bank of New York Mellon (formerly Irving Trust Company) and Tina D. Gonzalez (successor to Frederick G. Herbst) and forms of global notes (incorporated by reference to Exhibit 4.1 to Duke Energy Progress, Inc.'s Current Report on Form 8-K filed on March 6, 2014, File No. 1-3382).\nX\n4.5.78\nEighty-third Supplemental Indenture, dated as of November 1, 2014, between Duke Energy Progress, Inc. and The Bank of New York Mellon (formerly Irving Trust Company) and Tina D. Gonzalez (successor to Frederick G. Herbst) and forms of global notes (incorporated by reference to Exhibit 4.1 to Duke Energy Progress, Inc.'s Current Report on Form 8-K filed on November 20, 2014, File No. 1-3382).\nX\n4.5.79\nEighty-fifth Supplemental Indenture, dated as of August 1, 2015 (incorporated by reference to Exhibit 4.1 to Duke Energy Progress, LLC's Current Report on Form 8-K filed on August 13, 2015, File No. 1-3382).\nX\n4.5.80\nEighty-sixth Supplemental Indenture, dated as of September 1, 2016 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on September 16, 2016, File No. 1-\n3382\n).\nX\n4.5.81\nEighty-seventh Supplemental Indenture, dated as of September 1, 2017 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on September 8, 2017, File No. 1-3382).\nX\n4.5.82\nEighty-ninth Supplemental Indenture (incorporated by reference to Exhibit 4.1 to registrant’s Current Report on Form 8-K filed on March 7, 2019, File no. 1-3382).\nX\n4.5.83\nNinetieth Supplemental Indenture, dated as of August 1, 2020 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on August 20, 2020, File No. 1-3382).\nX\n4.5.84\nNinety-first Supplemental Indenture, dated as of August 1, 2021 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on August 12, 2021, File No. 1-3382).\n \nX\n4.5.85\nNinety-second Supplemental Indenture, dated as of March 1, 2022\n \n(incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 17, 2022, File No. 1-3382).\nX\n4.5.86\nNinety-fourth Supplemental Indenture, dated as of March 1, 2023 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 9, 2023, File No. 1-3382).\nX\n4.5.87\nNinety-fifth Supplemental Indenture, dated as of March 1, 2024\n \n(incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 14, 2024, File No. 1-3382).\nX\n4.5.88\nFirst Supplemental Indenture, dated as of August 1, 2020 (incorporated by reference to Exhibit 4.2 to registrant's Current Report on Form 8-K filed on August 20, 2020, File No. 1-3382).\nX\n4.6\nIndenture (for Debt Securities) between Duke Energy Progress, Inc. (formerly Carolina Power & Light Company) and The Bank of New York Mellon (successor in interest to The Chase Manhattan Bank), as Trustee (incorporated by reference to Exhibit 4(a) to registrant's Current Report on Form 8-K filed on November 5, 1999, File No. 1-3382).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.7\nIndenture (for [Subordinated] Debt Securities) (open ended) (incorporated by reference to Exhibit 4(a)(2) to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Registration Statement on Form S-3 filed on November 18, 2008, File No. 333-155418).\n \n \n \n \n \n \nX\n \n \n \n \n \n \n4.8\nIndenture (for First Mortgage Bonds) between Duke Energy Florida, Inc. (formerly Florida Power Corporation) and The Bank of New York Mellon (as successor to Guaranty Trust Company of New York and The Florida National Bank of Jacksonville), as Trustee, dated as of January 1, 1944, (incorporated by reference to Exhibit B-18 to registrant's Form A-2, File No. 2-5293).\n \n \n \n \n \n \n \n \nX\n \n \n \n \n4.8.1\nSeventh Supplemental Indenture (incorporated by reference to Exhibit 4(b) to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation) Registration Statement on Form S-3 filed on September 27, 1991, File No. 33-16788).\n \n \n \n \n \n \n \n \nX\n \n \n \n \n4.8.2\nEighth Supplemental Indenture (incorporated by reference to Exhibit 4(c) to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation) Registration Statement on Form S-3 filed on September 27, 1991, File No. 33-16788).\n \n \n \n \n \n \n \n \nX\n \n \n \n \n4.8.3\nSixteenth Supplemental Indenture (incorporated by reference to Exhibit 4(d) to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation) Registration Statement on Form S-3 filed on September 27, 1991, File No. 33-16788).\n \n \n \n \n \n \n \n \nX\n \n \n \n \n4.8.4\nTwenty-ninth Supplemental Indenture (incorporated by reference to Exhibit 4(c) to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation) Registration Statement on Form S-3 filed on September 17, 1982, File No. 2-79832).\n \n \n \n \n \n \n \n \nX\n \n \n \n \n4.8.5\nThirty-eighth Supplemental Indenture, dated as of July 25, 1994 (incorporated by reference to exhibit 4(f) to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation) Registration Statement on Form S-3 filed on August 29, 1994, File No. 33-55273).\n \n \n \n \n \n \n \n \nX\n \n \n \n \n4.8.6\nForty-first Supplemental Indenture, dated as of February 1, 2003 (incorporated by reference to Exhibit 4 to Duke Energy Florida, Inc.'s (formerly Duke Energy Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) Current Report on Form 8-K filed on February 21, 2003, File No. 1-3274)\n.\n \n \n \n \n \n \n \n \nX\n \n \n \n \n4.8.7\nForty-second Supplemental Indenture, dated as of April 1, 2003 (incorporated by reference to Exhibit 4 to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) Quarterly Report on Form 10-Q for the quarter ended June 30, 2003, filed on August 11, 2003, File No. 1-3274).\n \nX\n4.8.8\nForty-third Supplemental Indenture, dated as of November 1, 2003 (incorporated by reference to Exhibit 4 to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) Current Report on Form 8-K filed on November 21, 2003, File No. 1-3274).\nX\n4.8.9\nForty-fourth Supplemental Indenture, dated as of August 1, 2004 (incorporated by reference to Exhibit 4(m) to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) Annual Report on Form 10-K for the year ended December 31, 2004, filed on March 16, 2005, File No. 1-3274).\nX\n4.8.10\nForty-sixth Supplemental Indenture, dated as of September 1, 2007 (incorporated by reference to Exhibit 4 to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) Current Report on Form 8-K filed on September 19, 2007, File No. 1-3274).\nX\n4.8.11\nForty-seventh Supplemental Indenture, dated as of December 1, 2007 (incorporated by reference to Exhibit 4 to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) Current Report on Form 8-K filed on December 13, 2007, File No. 1-3274).\nX\n4.8.12\nForty-eighth Supplemental Indenture, dated as of June 1, 2008 (incorporated by reference to Exhibit 4 to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) Current Report on Form 8-K filed on June 18, 2008, File No. 1-3274).\nX\n4.8.13\nForty-ninth Supplemental Indenture, dated as of March 1, 2010 (incorporated by reference to Exhibit 4 to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) Current Report on Form 8-K filed on March 25, 2010, File No. 1-3274).\nX\n4.8.14\nFiftieth Supplemental Indenture, dated as of August 11, 2011 (incorporated by reference to Exhibit 4 to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) Current Report on Form 8-K filed on August 18, 2011, File No. 1-3274).\nX\n4.8.15\nFifty-first Supplemental Indenture, dated as of November 1, 2012 (incorporated by reference to Exhibit 4.1 to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) Current Report on Form 8-K filed on November 20, 2012, File No. 1-3274).\nX\n4.8.16\nFifty-third Supplemental Indenture, dated as of September 1, 2016 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on September 9, 2016, File No. 1-03274). \nX\n4.8.17\nFifty-fifth Supplemental Indenture, dated as of June 1, 2018 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on June 21, 2018, File No. 1-3274).\nX\n4.8.18\nFifty-sixth Supplemental Indenture, dated as of November 1, 2019 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on November 26, 2019, File No. 1-3274). \nX\n4.8.19\nFifty-seventh Supplemental Indenture, dated as of June 1, 2020 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on June 11, 2020, File No. 1-3274).\nX\n4.8.20\nFifty-eighth Supplemental Indenture, dated as of November 1, 2021 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on December 2, 2021, File No. 1-3274).\n \nX\n4.8.21\nFifty-ninth Supplemental Indenture, dated as of November 1, 2022 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on November 10, 2022, File No. 1-3274).\n \nX\n4.8.22\nSixtieth Supplemental Indenture, dated as of September 1, 2023, between Duke Energy Florida, LLC and The Bank of New York Mellon, as successor Trustee and Calculation Agent (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on September 29, 2023, File No. 1-3274).\nX\n4.8.23\nSixty-first Supplemental Indenture, dated as of November 1, 2023, between Duke Energy Florida, LLC and The Bank of New York Mellon, as successor Trustee (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on November 9, 2023, File No. 1-3274). \nX\n4.8.24\nSixty-second Supplemental Indenture, dated as of April 1, 2024, between \nDuke Energy Florida, LLC\n and The Bank of New York Mellon, as successor Trustee and Calculation Agent\n (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on April 5, 2024, File No. 1-3274).\nX\n4.9\nIndenture (for Debt Securities) between Duke Energy Florida, Inc. (formerly Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) and The Bank of New York Mellon Trust Company, National Association (successor in interest to J.P. Morgan Trust Company, National Association), as Trustee, dated as of December 7, 2005 (incorporated by reference to Exhibit 4(a) to registrant's Current Report on Form 8-K filed on December 13, 2005, File No. 1-3274).\nX\n4.9.1\nFirst Supplemental Indenture, dated as of December 12, 2017 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on December 12, 2017, File No. 1-03274).\nX\n4.9.2\nSecond Supplemental Indenture, dated as of November 26, 2019 (incorporated by reference to Exhibit 4.2 to registrant’s Current Report on Form 8-K filed on November 26, 2019, File No. 1-3274).\nX\n4.10\nIndenture (for [Subordinated] Debt Securities) (open ended) (incorporated by reference to Exhibit 4(a)(2) Duke Energy Florida, Inc.'s (formerly Florida Power Corporation (d/b/a Progress Energy Florida, Inc.)) Registration Statement on Form S-3 filed on November 18, 2008, File No. 333-155418).\nX\n4.11\nOriginal Indenture (Unsecured Debt Securities) between Duke Energy Ohio, Inc. (formerly The Cincinnati Gas & Electric Company) and The Bank of New York Mellon Trust Company, N.A., as Successor Trustee, dated as of May 15, 1995 (incorporated by reference to Exhibit 3 to registrant's Form 8-A filed on July 27, 1995, File No. 1-1232).\nX\n4.11.1\nFirst Supplemental Indenture, dated as of June 1, 1995 (incorporated by reference to Exhibit 4 B to Duke Energy Ohio, Inc.'s (formerly The Cincinnati Gas & Electric Company) Quarterly Report on Form 10-Q for the quarter ended June 30, 1995, filed on August 11, 1995, File No. 1-1232).\nX\n4.11.2\nSeventh Supplemental Indenture, dated as of June 15, 2003 (incorporated by reference to Exhibit 4.1 to Duke Energy Ohio, Inc.'s (formerly The Cincinnati Gas & Electric Company) Quarterly Report on Form 10-Q for the quarter ended June 30, 2003, filed on August 13, 2003, File No. 1-1232).\nX\n4.12\nOriginal Indenture (First Mortgage Bonds) between Duke Energy Ohio, Inc. (formerly The Cincinnati Gas & Electric Company) and The Bank of New York Mellon Trust Company, N.A., as Successor Trustee, dated as of August 1, 1936 (incorporated by reference to an exhibit to registrant's Registration Statement No. 2-2374).\nX\n4.12.1\nFortieth Supplemental Indenture, dated as of March 23, 2009 (incorporated by reference to Exhibit 4.1 to Duke Energy Ohio, Inc.’s (formerly The Cincinnati Gas & Electric Company) Current Report on Form 8-K filed on March 24, 2009, File No. 1-1232).\nX\n4.12.2\nForty-second Supplemental Indenture, dated as of September 6, 2013 (incorporated by reference to Exhibit 4.1 to Duke Energy Ohio, Inc.’s (formerly The Cincinnati Gas & Electric Company) Current Report on Form 8-K filed on September 6, 2013, File No. 1-1232).\nX\n4.12.3\nForty-fourth Supplemental Indenture, dated as of June 23, 2016 (incorporated by reference to Exhibit 4.1 registrant's Current Report on Form 8-K filed on June 23, 2016, File No. 1-1232). \nX\n4.12.4\nForty-fifth Supplemental Indenture, dated as of March 27, 2017 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 27,2017, File No. 1-01232).\nX\n4.12.5\nForty-sixth Supplemental Indenture, dated as of January 8, 2019 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on January 8, 2019, File No. 1-1232). \nX\n4.12.6\nForty-seventh Supplemental Indenture, dated as of May 21, 2020 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on May 21, 2020, File No. 1-1232). \nX\n4.12.7\nForty-eighth Supplemental Indenture, dated as of March 22, 2023 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 22, 2023, File No. 1-1232).\nX\n4.12.8\nForty-ninth Supplemental Indenture, dated as of March 14, 2024\n \n(incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 14, 2024, File No. 1-1232).\nX\n4.13\nIndenture between Duke Energy Indiana, LLC (formerly PSI Energy, Inc.) and The Bank of New York Mellon Trust Company, N.A., as Successor Trustee, dated as of November 15, 1996 (incorporated by reference to Exhibit 4(v) to the Cinergy Corp. Form 10-K for the year ended December 31, 1996, filed on March 27, 1997, File No. 1-11377).\nX\n4.13.1\nThird Supplemental Indenture, dated as of March 15, 1998 (incorporated by reference to Exhibit 4-w to Cinergy Corp.’s Annual Report on Form 10-K for the year ended December 31, 1997, filed on March 27, 1998, File No. 1-11377).\nX\n4.13.2\nEighth Supplemental Indenture, dated as of September 23, 2003 (incorporated by reference to Exhibit 4.2 to Duke Energy Indiana, LLC's (formerly PSI Energy, Inc.) Quarterly Report on Form 10-Q for the quarter ended September 30, 2003, filed on November 13, 2003, File No. 1-3543).\nX\n4.133\nNinth Supplemental Indenture, dated as of October 21, 2005 (incorporated by reference to Exhibit 4.7.3 to Duke Energy Indiana, LLC's (formerly PSI Energy, Inc.) Registration Statement on Form S-3 filed on September 29, 2010, File No. 333-169633).\nX\n4.13.4\nTenth Supplemental Indenture, dated as of June 9, 2006 (incorporated by reference to Exhibit 4.1 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Current Report on Form 8-K filed on June 15, 2006, File No. 1-3543).\nX\n4.14\nOriginal Indenture (First Mortgage Bonds) between Duke Energy Indiana, LLC (formerly PSI Energy, Inc.) and Deutsche Bank National Trust Company, as Successor Trustee, dated as of September 1, 1939, (filed as an exhibit in File No. 70-258).\nX\n4.14.1\nTenth Supplemental Indenture, dated as of July 1, 1952, (filed as an exhibit in File No. 2-9687).\nX\n4.14.2\nTwenty-third Supplemental Indenture, dated as of January 1, 1977, (filed as an exhibit in File No. 2-57828).\nX\n4.14.3\nTwenty-fifth Supplemental Indenture, dated as of September 1, 1978, (filed as an exhibit in File No. 2-62543).\nX\n4.14.4\nTwenty-sixth Supplemental Indenture, dated as of September 1, 1978, (filed as an exhibit in File No. 2-62543).\nX\n4.14.5\nThirtieth Supplemental Indenture, dated as of August 1, 1980, (filed as an exhibit in File No. 2-68562).\nX\n4.14.6\nThirty-fifth Supplemental Indenture, dated as of March 30, 1984, (filed as an exhibit to registrant's Annual Report on Form 10-K for the year ended December 31, 1984, File No. 1-3543).\nX\n4.14.7\nForty-sixth Supplemental Indenture, dated as of June 1, 1990, (filed as an exhibit to registrant's Annual Report on Form 10-K for the year ended December 31, 1991, File No. 1-3543).\nX\n4.14.8\nForty-seventh Supplemental Indenture, dated as of July 15, 1991, (filed as an exhibit to registrant's Annual Report on Form 10-K for the year ended December 31, 1991, File No. 1-3543).\nX\n4.14.9\nForty-eighth Supplemental Indenture, dated as of July 15, 1992, (filed as an exhibit to registrant's Annual Report on Form 10-K for the year ended December 31, 1992, File No. 1-3543).\nX\n4.14.10\nFifty-second Supplemental Indenture, dated as of April 30, 1999 (incorporated by reference to Exhibit 4 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Quarterly Report on Form 10-Q for the quarter ended March 31, 1999, filed on May 13, 1999, File No. 1-3543).\nX\n4.14.11\nFifty-seventh Supplemental Indenture, dated as of August 21, 2008 (incorporated by reference to Exhibit 4.1 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Current Report Form 8-K filed on August 21, 2008, File No. 1-3543).\nX\n4.14.12\nFifty-eighth Supplemental Indenture, dated as of December 19, 2008 (incorporated by reference to Exhibit 4.8.12 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Registration Statement on Form S-3 filed on September 29, 2010, File No. 333-169633-02).\nX\n4.14.13\nFifty-ninth Supplemental Indenture, dated as of March 23, 2009 (incorporated by reference to Exhibit 4.1 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Current Report on Form 8-K filed on March 24, 2009, File No. 1-3543).\nX\n4.14.14\nSixtieth Supplemental Indenture, dated as of June 1, 2009 (incorporated by reference to Exhibit 4.8.14 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Registration Statement on Form S-3 filed on September 29, 2010, File No. 333-169633-02).\nX\n4.14.15\nSixty-first Supplemental Indenture, dated as of October 1, 2009 (incorporated by reference to Exhibit 4.8.15 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Registration Statement on Form S-3 filed on September 29, 2010, File No. 333-169633-02).\nX\n4.14.16\nSixty-second Supplemental Indenture, dated as of July 9, 2010 (incorporated by reference to Exhibit 4.1 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Current Report on Form 8-K filed on July 9, 2010, File No. 1-3543). \nX\n4.14.17\nSixty-third Supplemental Indenture, dated as of September 23, 2010 (incorporated by reference to Exhibit 4.8.17 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Registration Statement on Form S-3 filed on September 29, 2010, File No. 333-169633-02).\nX\n4.14.18\nSixty-fourth Supplemental Indenture, dated as of December 1, 2011 (incorporated by reference to Exhibit 4(d)(2)(xviii) to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Registration Statement on Form S-3 filed on September 30, 2013, File No. 333-191462-03).\nX\n4.14.19\nSixty-fifth Supplemental Indenture, dated as of March 15, 2012 (incorporated by reference to Exhibit 4.1 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Current Report on Form 8-K filed on March 15, 2012, File No. 1-3543).\nX\n4.14.20\nSixty-sixth Supplemental Indenture, dated as of July 11, 2013 (incorporated by reference to Exhibit 4.1 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Current Report on Form 8-K filed on July 11, 2013, File No. 1-3543).\nX\n4.14.21\nSixty-seventh Supplemental Indenture, dated as of January 1, 2016, between Duke Energy Indiana, Inc. and Deutsche Bank National Trust Company, as Trustee, supplementing and amending the Indenture of Mortgage or Deed of Trust, dated September 1, 1939, between Duke Energy Indiana, Inc. and Deutsche Bank National Trust Company, as Trustee (incorporated by reference to Exhibit 4.2 to Duke Energy Indiana, LLC's (formerly PSI Energy, Inc.) Quarterly Report on Form 10-Q for the quarter ended March 31, 2016, filed on May 5, 2016, File No. 1-3543).\nX\n4.14.22\nSixty-eighth Supplemental Indenture, dated as of May 12, 2016 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on May 12, 2016, File No. 1-3543).\nX\n4.14.23\nSixty-ninth Supplemental Indenture, dated as of September 27, 2019 (incorporated by reference to Exhibit 4.1 to registrant’s Current Report on Form 8-K filed on September 27, 2019, File No. 1-3543).\nX\n4.14.24\nSeventieth Supplemental Indenture, dated as of March 12, 2020 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 12, 2020, File No. 1-3543). \nX\n4.14.25\nSeventy-first Supplemental Indenture, dated as of March 23, 2023 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 23, 2023, File No. 1-3543).\nX\n4.14.26\nSeventy-second Supplemental Indenture, dated as of March 1, 2024, between \nDuke Energy Indiana, LLC\n and Deutsche Bank National Trust Company, as Trustee\n (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 1, 2024, File No. 1-3543).\nX\n4.15\nRepayment Agreement between Duke Energy Ohio, Inc. (formerly The Cincinnati Gas & Electric Company) and The Dayton Power and Light Company, dated as of December 23, 1992, (filed with registrant's Annual Report on Form 10-K for the year ended December 31, 1992, File No. 1-1232).\nX\n4.16\nUnsecured Promissory Note between Duke Energy Indiana, LLC (formerly PSI Energy, Inc.) and the Rural Utilities Service, dated as of October 14, 1998 (incorporated by reference to Exhibit 4 to registrant's Annual Report on Form 10-K for the year ended December 31, 1998, filed on March 8, 1999, File No. 1-3543).\nX\n4.17\nIndenture (for Debt Securities) dated as of February 15, 2001 between Progress Energy, Inc. and The Bank of New York Mellon Trust Company, National Association (successor in interest to Bank One Trust Company, N.A.), as Trustee (incorporated by reference to Exhibit 4(a) to Progress Energy, Inc.’s Current Report on Form 8-K filed on February 27, 2001, File No. 1-15929).\nX\n4.18\nForm of 3.47% Series A Senior Notes due July 16, 2027 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 29, 2012, File No. 1-06196).\nX\n4.19\nForm of 3.57% Series B Senior Notes due July 16, 2027 (incorporated by reference to Exhibit 4.2 to registrant's Current Report on Form 8-K filed on March 29, 2012, File No. 1-06196).\nX\n4.20\nForm of 4.65% Senior Notes due 2043 (incorporated by reference to Exhibit 4.2 to registrant's Current Report on Form 8-K filed on August 1, 2013, File No. 1-06196).\nX\n4.21\nForm of 4.10% Senior Notes due 2034 (incorporated by reference to Exhibit 4.2 to registrant's Current Report on Form 8-K filed on September 18, 2014, File No. 1-06196).\nX\n4.22\nForm of 3.60% Senior Notes due 2025 (incorporated by reference to Exhibit 4.2 to registrant's Current Report on Form 8-K filed on September 14, 2015, File No. 1-06196).\nX\n4.23\nForm of 3.64% Senior Notes due 2046 (incorporated by reference to Exhibit 4.2 to registrant's Current Report on Form 8-K filed on July 28, 2016, File No. 1-06196).\nX\n4.24\nIndenture, dated as of April 1, 1993, between Piedmont and The Bank of New York Mellon Trust Company, N.A. (as successor to Citibank, N.A.), Trustee (incorporated by reference to Exhibit 4.1 to registrant's Registration Statement on Form S-3 filed on May 16, 1995, File No. 33-59369).\nX\n4.24.1\nSecond Supplemental Indenture, dated as of June 15, 2003, between Piedmont and Citibank, N.A., Trustee (incorporated by reference to Exhibit 4.3 to registrant's Registration Statement on Form S-3 filed on June 19, 2003, File No. 333-106268).\nX\n4.24.2\nFourth Supplemental Indenture, dated as of May 6, 2011, between Piedmont Natural Gas Company, Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 to registrant's Registration Statement on Form S-3-ASR filed on July 7, 2011, File No. 333-175386).\nX\n4.24.3\nSixth Supplemental Indenture, dated September 18, 2014, between \nPiedmont Natural Gas Company\n, Inc\n. \nand The Bank of New York Mellon Trust Company, N.A. (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on September 18, 2014, File No. 1-06196).\nX\n4.24.4\nSeventh Supplemental Indenture, dated September 14, 2015, between \nPiedmont Natural Gas Company, Inc.\n and The Bank of New York Mellon Trust Company, N.A. (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on September 14, 2015, File No. 1-06196).\nX\n4.24.5\nEighth Supplemental Indenture, dated July 28, 2016, between \nPiedmont Natura\nl Gas Company\n, Inc.\n and The Bank of New York Mellon Trust Company, N.A. (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on July 28, 2016, File No. 1-06196).\nX\n4.24.6\nNinth Supplemental Indenture, dated as of May 24, 2019 (incorporated by reference to Exhibit 4.1 to registrant’s Current Report on Form 8-K filed on May 24, 2019, File No. 1-6196).\nX\n4.24.7\nTenth Supplemental Indenture, dated as of May 21, 2020 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on May 21, 2020, File No. 1-6196). \nX\n4.24.8\nEleventh Supplemental Indenture, dated as of March 11, 2021 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on March 11, 2021, File No. 1-6196).\nX\n4.24.9\nTwelfth Supplemental Indenture dated as of May 13, 2022 between Piedmont Natural Gas Company, Inc. and The Bank of New York Mellon Trust Company, N.A., as successor to Citibank, N.A.\n \n(incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on May 13, 2022, File No. 1-6196).\nX\n4.24.10\nThirteenth Supplemental Indenture, dated as of June 8, 2023 between Piedmont Natural Gas Company, Inc. and The Bank of New York Mellon Trust Company, N.A., as successor to Citibank, N.A. (incorporated by reference to exhibit 4.1 to registrant’s Current Report on Form 8-K filed on June 8, 2023, File No. 1-6196).\nX\n4.24.11\nFourteenth Supplemental Indenture, dated as of August 14, 2024, between the registrant and The Bank of New York Mellon Trust Company, N.A., as successor to Citibank, N.A.\n \n(incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on August 14, 2024, File No. 1-6196).\nX\n4.25\nMedium-Term Note, Series A, dated as of October 6, 1993 (incorporated by reference to Exhibit 4.8 to registrant's Annual Report on Form 10-K for the year ended October 31, 1993, File No. 1-06196).\nX\n4.26\nForm of 6% Medium-Term Note, Series E, dated as of December 19, 2003 (incorporated by reference to Exhibit 99.2 to registrant's Current Report on Form 8-K filed on December 23, 2003, File No. 1-06196).\nX\n4.27\nForm of Master Global Note (incorporated by reference to Exhibit 4.4 to registrant's Registration Statement on Form S-3 filed on April 30, 1997, File No. 333-26161).\nX\n4.28\nPricing Supplement of Medium-Term Notes, Series B, dated October 4, 1996 (incorporated by reference to Exhibit 4.11 to registrant's Annual Report on Form 10-K for the year ended October 31, 1996, File No. 1-06196).\nX\n4.29\nAgreement of Resignation, Appointment and Acceptance dated as of March 29, 2007, by and among Piedmont Natural Gas Company, Inc., Citibank, N.A., and The Bank of New York Trust Company, N.A. (incorporated by reference to Exhibit 4.1 to registrant's Quarterly Report on Form 10-Q for the \nQ\nuarter ended April 30, 2007, filed on June 8, 2007, File No. 1-06196).\nX\n4.30\nTerm Loan Credit Agreement, dated as of March 26, 2024, by and among Duke Energy Corporation\n, as Borrower\n, the lenders party thereto and PNC Bank, N.A.\n, as Administrative Agent\n (incorporat\ned by reference to Exhibit 4.6 to registrant's Quarterly Report on Form 10-Q for the \nQ\nuarter ended March 31, 2024, filed on Ma\ny 7, 2024, File No. 1-32853).\nX\n10.1\nAgreements with Piedmont Electric Membership Corporation, Rutherford Electric Membership Corporation and Blue Ridge Electric Membership Corporation (incorporated by reference to Exhibit 10.15 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the \nQ\nuarter ended June 30, 2006, filed on August 9, 2006, File No. 1-32853).\nX\n10.2\nAsset Purchase Agreement between Saluda River Electric Cooperative, Inc., as Seller, and Duke Energy Carolinas, LLC, as Purchaser, dated as of December 20, 2006 (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on December 27, 2006, File No. 1-4928).\nX\n10.3\nSettlement between Duke Energy Corporation, Duke Energy Carolinas, LLC and the U.S. Department of Justice resolving Duke Energy's used nuclear fuel litigation against the U.S. Department of Energy, dated as of March 6, 2007 (incorporated by reference to Item 8.01 to registrant's Current Report on Form 8-K filed on March 12, 2007, File No. 1-4928).\nX\n10.4\nLetter Agreement between Georgia Natural Gas Company and Piedmont Energy Company dated February 12, 2016 (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on February 18, 2016, File No. 1-06196).\nX\n10.5\nAssignment of Membership Interests dated as of October 3, 2016 between Piedmont ACP Company, LLC and Dominion Atlantic Coast Pipeline, LLC, (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on October 7, 2016, File No. 1-06196).\nX\n10.6\nAgreements between Piedmont Electric Membership Corporation, Rutherford Electric Membership Corporation and Blue Ridge Electric Membership Corporation (incorporated by reference to Exhibit 10.15 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the \nQ\nuarter ended June 30, 2006, filed on August 9, 2006, File No. 1-32853).\nX\n10.7\nConveyance and Assignment Agreement, dated as of October 3, 2016, by and between Piedmont Energy Company and Georgia Natural Gas Company (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on October 3, 2016, File No. 1-06196).\nX\n10.8\nEngineering, Procurement and Construction Management Agreement between Duke Energy Indiana, LLC (formerly PSI Energy, Inc.) and Bechtel Power Corporation, dated as of December 15, 2008 (incorporated by reference to Exhibit 10.16 to registrant's Annual Report on Form 10-K for the year ended December 31, 2008, filed on March 13, 2009, File No. 1-3543). (Portions of the exhibit have been omitted and filed separately with the Securities and Exchange Commission pursuant to a request for confidential treatment pursuant to Rule 24b-2 under the Securities Exchange Act of 1934, as amended.)\nX\n10.9\nFormation and Sale Agreement between Duke Ventures, LLC, Crescent Resources, LLC, Morgan Stanley Real Estate Fund V U.S. L.P., Morgan Stanley Real Estate Fund V Special U.S., L.P., Morgan Stanley Real Estate Investors V U.S., L.P., MSP Real Estate Fund V, L.P., and Morgan Stanley Strategic Investments, Inc., dated as of September 7, 2006 (incorporated by reference to Exhibit 10.3 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the quarter ended September 30, 2006, filed on November 9, 2006, File No. 1-32853).\nX\n10.10\nOperating Agreement of Pioneer Transmission, LLC (incorporated by reference to Exhibit 10.1 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the quarter ended September 30, 2008, filed on November 7, 2008, File No. 1-32853).\nX\n10.11**\nAmended and Restated Duke Energy Corporation Directors' Saving Plan, dated as of January 1, 2014 (incorporated by reference to Exhibit 10.32 to Duke Energy Corporation's Annual Report on Form 10-K for the year ended December 31, 2013, filed on February 28, 2014, File No. 1-32853).\nX\n10.12**\nAmendment to Duke Energy Corporation Directors' Savings Plan, effective as of December 16, 2021 (incorporated by reference to Exhibit 10.12 to Duke Energy Corporation's Annual Report on Form 10-K for the year ended December 31, 2021, filed on February 24, 2022, File No. 1-32853).\n \nX\n10.13\nEngineering, Procurement and Construction Management Agreement between Duke Energy Indiana, LLC (formerly PSI Energy, Inc.) and Bechtel Power Corporation, dated as of December 15, 2008 (incorporated by reference to Item 1.01 to registrant's Current Report on Form 8-K filed on December 19, 2008, File Nos. 1-32853 and 1-3543). (Portions of the exhibit have been omitted and filed separately with the Securities and Exchange Commission pursuant to a request for confidential treatment pursuant to Rule 24b-2 under the Securities Exchange Act of 1934, as amended\n).\nX\nX\n10.14**\nDuke Energy Corporation Executive Severance Plan (incorporated by reference to \nExhibit 10.1 to registrant's Current Report on Form \n8-K filed on January 13, 2011, File No. \n1-32853\n).\nX\n10.14.1**\nAmendment to Duke Energy Corporation Executive Officer Severance Plan\n (incorporated by reference to Exhibit\n 10.2 to registrant's \nQuarterly \nReport on Form \n10-Q\n for the quarter ended June 30, 2024, filed on August 6, 2024, File No. 1-32853).\nX\n10.15\n$6,000,000,000 Five-Year Credit Agreement between Duke Energy Corporation, Duke Energy Carolinas, LLC, Duke Energy Ohio, Inc., Duke Energy Indiana, LLC, Duke Energy Kentucky, Inc., Carolina Power and Light Company d/b/a Duke Energy Progress, Inc. and Florida Power Corporation, d/b/a Duke Energy Florida, Inc., as Borrowers, the lenders listed therein, Wells Fargo Bank, National Association, as Administrative Agent, Bank of America, N.A. and The Royal Bank of Scotland plc, as Co-Syndication Agents and Bank of China, New York Branch, Barclays Bank PLC, Citibank, N.A., Credit Suisse AG, Cayman Islands Branch, Industrial and Commercial Bank of China Limited, New York Branch, JPMorgan Chase Bank, N.A. and UBS Securities LLC, as Co-Documentation Agents, dated as of November 18, 2011 (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on November 25, 2011, File Nos. 1-32853, 1-4928, 1-1232 and 1-3543).\nX\nX\nX\nX\n10.15.1\nAmendment No. 1 and Consent between Duke Energy Corporation, Duke Energy Carolinas, LLC, Duke Energy Ohio, Inc., Duke Energy Indiana, LLC, Duke Energy Kentucky, Inc., Duke Energy Progress, Inc., Duke Energy Florida, Inc., and Wells Fargo Bank, National Association, dated as of December 18, 2013 (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on December 23, 2013, File Nos. 1-32853, 1-4928, 1-3382, 1-3274, 1-1232 and 1-3543).\nX\nX\nX\nX\nX\nX\n10.15.2\nAmendment No. 2 and Consent between Duke Energy Corporation, Duke Energy Carolinas, LLC, Duke Energy Ohio, Inc., Duke Energy Indiana, LLC, Duke Energy Kentucky, Inc., Duke Energy Progress, Inc., and Duke Energy Florida, Inc., the Lenders party hereto, the issuing Lenders party hereto, Wells Fargo Bank, National Association, as Administrative Agent and Swingline Lender, dated as of January 30, 2015 (incorporated by reference to Exhibit 10.1 of registrant's Current Report on Form 8-K filed on February 5, 2015, File Nos. 1-32853, 1-4928, 1-1232, 1-3543, 1-3382 and 1-3274).\nX\nX\nX\nX\nX\nX\n10.15.3\nAmendment No. 3 and Consent, dated as of March 16, 2017, among the registrants, the Lenders party thereto, the issuing Lenders party thereto, and Wells Fargo Bank, National Association, as Administrative Agent and Swingline Lender (incorporated by reference to Exhibit 10.1 to registrants' Current Report on Form 8-K filed on March 17, 2017, File Nos. 1-32853, 1-04928, 1-03382, 1-03274, 1-01232, 1-03543, 1-06196).\nX\nX\nX\nX\nX\nX\nX\n10.15.4\nAmendment No.4 and Consent, dated as of March 18, 2019, among Duke Energy Corporation, Duke Energy Carolinas, LLC, Duke Energy Ohio, Inc., Duke Energy Indiana, LLC, Duke Energy Kentucky, Inc., Duke Energy Progress, LLC, Duke Energy Florida, LLC, and Piedmont Natural Gas Company, Inc., the Lenders party thereto, the Issuing Lenders party thereto, and Wells Fargo Bank, National Association, as Administrative Agent and Swingline Lender (incorporated by reference to Exhibit 10.1 to registrants’ Current Report on Form 8-K filed on March 21, 2019, File Nos. 1-32853. 1-4928, 1-3382, 1-3274, 1-1232, 1-3543, 1-6196).\nX\nX\nX\nX\nX\nX\nX\n10.15.5\nAmendment No. 5 and Consent, dated as of March 16, 2020, among registrants', the Lenders party thereto, the Issuing Lenders party thereto, and Wells Fargo Bank, N.A., as Administrative Agent, and Swingline Lender (incorporated by reference to Exhibit 10.1 to registrants' Current Report on Form 8-K filed on March 17, 2020, File Nos. 1-32853, 1-4928, 1-3382, 1-3274, 1-1232, 1-3543, 1-6196). \nX\nX\nX\nX\nX\nX\nX\n10.16**\nDuke Energy Corporation 2015 Long-Term Incentive Plan (incorporated by reference to Appendix C to registrant's DEF 14A filed on March 26, 2015, File No. 1-32853).\nX\n10.16.1**\nAmendment to Duke Energy Corporation 2015 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.16.1 to Duke Energy Corporation's Annual Report on Form 10-K for the year ended December 31, 2018, filed on February 28, 2019, File No. 1-32853).\nX\n10.17**\nDuke Energy Corporation 2023 Long-Term Incentive Plan (incorporated by reference to Appendix C to registrant's DEF14A filed on March 23, 2023, File No.1-32853).\nX\n10.18**\nRestricted Stock Unit Award Agreement (incorporated by reference to Exhibit 10.4 to registrant's Quarterly Report on Form 10-Q for the quarter ended March 31, 2017 filed on May 9, 2017, File No. 1-32853).\nX\n10.19**\nRestricted Stock Unit Award Agreement (incorporated by reference to Exhibit 10.24 to Duke Energy Corporation's Annual Report on Form 10-K for the year ended December 31, 2017, filed on February 21, 2018, File No. 1-32853). \nX\n10.20**\nRestricted Stock Unit Award Agreement (incorporated by reference to Exhibit 10.3 to Duke Energy Corporation’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2019, filed on May 9, 2019, File No. 1-32853).\nX\n10.21**\nRestricted Stock Unit Award Agreement (incorporated by reference to Exhibit 10.4 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the quarter ended March 31, 2022, filed on May 9, 2022, File No. 1-32853).\nX\n10.22**\nRestricted Stock Unit Award Agreement (incorporated by reference to Exhibit 10.21 to registrant's Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 27, 2023, File No. 1-32853).\nX\n10.23**\nPerformance Share Award Agreement (incorporated by reference to Exhibit 10.2 to Duke Energy Corporation’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2019, filed on May 9, 2019, File No. 1-32853). \nX\n10.24**\nPerformance Share Award Agreement (incorporated by reference to Exhibit 10.4 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the quarter ended March 31, 2020, filed on May 12, 2020, File No. 1-32853).\nX\n10.25**\nPerformance Share Award Agreement (incorporated by reference to Exhibit 10.24 to registrant's Annual Report on Form 10-K for the year ended December 31, 2022, Filed on February 27, 2023, File No. 1-32853).\nX\n10.26\nSettlement Agreement between Duke Energy Corporation, the North Carolina Utilities Commission Staff and the North Carolina Public Staff, dated as of November 28, 2012 (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on November 29, 2012, File No. 1-32853).\nX\n10.27\nSettlement Agreement between Duke Energy Corporation and the North Carolina Attorney General, dated as of December 3, 2012 (incorporated by reference Item 7.01 to registrant's Current Report on Form 8-K filed on December 3, 2012, File No. 1-32853).\nX\n10.28\nSettlement Agreement between Duke Energy Carolinas, LLC, Duke Energy Progress, LLC, and The North Carolina Department of Environmental Quality, dated as of December 31, 2019 (incorporated by reference to Exhibit 10.1 to registrants' Current Report on Form 8-K filed on January 2, 2020, File Nos. 1-4928, 1-3382).\nX\nX\n10.29\nDuke Energy Carolinas Summary of Partial Settlement in North Carolina Rate Case (incorporated by reference to Exhibit 99.1 to registrant's Current Report on Form 8-K filed on March 26, 2020, File Nos. 1-32853, 1-4928, 1-3382).\nX\nX\nX\n10.30\nCoal Combustion Residuals Settlement Agreement between registrants and the Public Staff-North Carolina Utilities Commission, the North Carolina Attorney General's Office, and the Sierra Club, dated as of January 22, 2021 (incorporated by reference to Exhibit 10.1 to registrants' Quarterly Report on Form 10-Q for the quarter ended March 31, 2021, filed on May 10, 2021, File Nos. 1-32853, 1-4928, 1-3382).\nX\nX\nX\n10.31\nInvestment Agreement by and among Cinergy Corp., Duke Energy Indiana HoldCo, LLC, Duke Energy Corporation, and Epson Investment PTE. LTD,. dated as of January 28, 2021 (incorporated by reference to Exhibit 10.2 to registrants' Quarterly Report on Form 10-Q for the quarter ended March 31, 2021, filed on May 10, 2021, File Nos. 1-32853, 1-3543).\nX\nX\n10.32\nCooperation Agreement, dated as of November 13, 2021, by and among Duke Energy Corporation, Elliott Investment Management L.P., and Elliott International, L.P.(incorporated by reference to registrant's Current Report on Form 8-K filed on November 15, 2021, File No. 1-32853).\n \nX\n10.33**\nForm of Change-in-Control Agreement (incorporated by reference to Exhibit 10.58 to \nregistrant's\n Annual Report on Form 10-K for the year ended December 31, 2012, filed on March 1, 2013, File No. 1-32853).\nX\n10.33.1**\nAmendment to Duke Energy Corporation \nForm of Change\n-in-\nControl Agreement (\nincorporated by reference to Exhibit 10.1 to registrant\n's\n Quarterly Report on Form 10-Q for the quarter ended June 30, 2024, filed on August 6, 2024, File No. 1-32853).\nX\n10.33.2**\nAmendment to Duke Energy Corporation \nChange\n-in-Control Agreement\n by and among Duke Energy Corporation and Harry K. Sideris (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on January 13, 202\n5, File No. 1-32853).\nX\n10.34**\nAmended and Restated Duke Energy Corporation Executive Cash Balance Plan, dated as of January 1, 2014 (incorporated by reference to Exhibit 10.52 to Duke Energy Corporation's Annual Report on Form 10-K for the year ended December 31, 2013, filed on February 28, 2014, File No. 1-32852).\nX\n10.34.1**\nAmended and Restated Duke Energy Corporation Executive Cash Balance Plan, dated as of September 30, 2020 (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on September 25, 2020, File No. 1-32853).\nX\n10.35\nPurchase, Construction and Ownership Agreement, dated as of July 30, 1981, between Duke Energy Progress, Inc. (formerly Carolina Power & Light Company) and North Carolina Municipal Power Agency Number 3 and Exhibits, together with resolution, dated as of December 16, 1981, changing name to North Carolina Eastern Municipal Power Agency, amending letter, dated as of February 18, 1982, and amendment, dated as of February 24, 1982 (incorporated by reference to Exhibit 10(a) to registrant's File No. 33-25560).\nX\n10.36\nOperating and Fuel Agreement, dated as of July 30, 1981, between Duke Energy Progress, Inc. (formerly Carolina Power & Light Company) and North Carolina Municipal Power Agency Number 3 and Exhibits, together with resolution, dated as of December 16, 1981, changing name to North Carolina Eastern Municipal Power Agency, amending letters, dated as of August 21, 1981, and December 15, 1981, and amendment, dated as of February 24, 1982 (incorporated by reference to Exhibit 10(b) to registrant's File No. 33-25560).\nX\n10.37\nPower Coordination Agreement, dated as of July 30, 1981, between Duke Energy Progress, Inc. (formerly Carolina Power & Light Company) and North Carolina Municipal Power Agency Number 3 and Exhibits, together with resolution, dated as of December 16, 1981, changing name to North Carolina Eastern Municipal Power Agency and amending letter, dated as of January 29, 1982 (incorporated by reference to Exhibit 10(c) to registrant's File No. 33-25560).\nX\n10.38\nAmendment, dated as of December 16, 1982, to Purchase, Construction and Ownership Agreement, dated as of July 30, 1981, between Duke Energy Progress, Inc. (formerly Carolina Power & Light Company) and North Carolina Eastern Municipal Power Agency (incorporated by reference to Exhibit 10(d) to registrant's File No. 33-25560).\nX\n10.39\nPrecedent and Related Agreements between Duke Energy Florida, Inc. (formerly Florida Power Corporation d/b/a Progress Energy Florida, Inc. (“PEF”)), Southern Natural Gas Company, Florida Gas Transmission Company (“FGT”), and BG LNG Services, LLC (“BG”), including: a) Precedent Agreement between Southern Natural Gas Company and PEF, dated as of December 2, 2004; b) Gas Sale and Purchase Contract between BG and PEF, dated as of December 1, 2004; c) Interim Firm Transportation Service Agreement by and between FGT and PEF, dated as of December 2, 2004; d) Letter Agreement between FGT and PEF, dated as of December 2, 2004, and Firm Transportation Service Agreement between FGT and PEF to be entered into upon satisfaction of certain conditions precedent; e) Discount Agreement between FGT and PEF, dated as of December 2, 2004; f) Amendment to Gas Sale and Purchase Contract between BG and PEF, dated as of January 28, 2005; and g) Letter Agreement between FGT and PEF, dated as of January 31, 2005 (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K/A filed on March 15, 2005, File Nos. 1-15929 and 1-3274). (Portions of the exhibit have been omitted and filed separately with the Securities and Exchange Commission pursuant to a request for confidential treatment pursuant to Rule 24b-2 under the Securities Exchange Act of 1934, as amended.)\nX\nX\n10.40\nEngineering, Procurement and Construction Agreement between Duke Energy Florida, Inc. (formerly Florida Power Corporation d/b/a/ Progress Energy Florida, Inc.), as owner, and a consortium consisting of Westinghouse Electric Company LLC and Stone & Webster, Inc., as contractor, for a two-unit AP1000 Nuclear Power Plant, dated as of December 31, 2008 (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on March 2, 2009, File Nos. 1-15929 and 1-3274). (Portions of the exhibit have been omitted and filed separately with the Securities and Exchange Commission pursuant to a request for confidential treatment pursuant to Rule 24b-2 under the Securities Exchange Act of 1934, as amended.)\nX\nX\n10.41**\nEmployment Agreement between Duke Energy Corporation and Lynn J. Good, dated as of June 17, 2013 (incorporated by reference to Exhibit 10.1 to Duke Energy Corporation's Current Report on Form 8-K filed on June 18, 2013, File No. 1-32853).\nX\n10.41.1**\nAmendment to Employment Agreement between Duke Energy Corporation and Lynn J. Good, dated as of June 25, 2015 (incorporated by reference to Exhibit 10.1 to Duke Energy Corporation's Current Report on Form 8-K filed on June 29, 2015, File No. 1-32853). \nX\n10.42**\nAmended and Restated Duke Energy Corporation Executive Short-Term Incentive Plan, effective February 23, 2022 (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on February 24, 2022, File No. 1-32853).\nX\n10.43**\nDuke Energy Corporation 2017 Director Compensation Program Summary (incorporated by reference to Exhibit 10.3 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the quarter ended June 30, 2017, filed on August 3, 2017, File No. 1-32853).\nX\n10.44**\nDuke Energy Corporation 2022 Director Compensation Program Summary (incorporated by reference to Exhibit 10.5 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the quarter ended March 31, 2022, filed on May 9, 2022, File No. 1-32853).\nX\n10.45**\nDuke Energy Corporation 2023 Director Compensation Program Summary  (incorporated by reference to Exhibit 10.6 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the quarter ended March 31, 2023, filed on May 9, 2023, File No. 1-32853).\nX\n10.46**\nAmended and Restated Duke Energy Corporation Executive Savings Plan, dated as of January 1, 2014 (incorporated by reference to Exhibit 10.82 to Duke Energy Corporation's Annual Report on Form 10-K for the year ended December 31, 2013, filed on February 28, 2014, File No. 1-32853).\nX\n10.46.1**\nAmendment to Duke Energy Corporation Executive Savings Plan, dated as of January 1, 2014 (incorporated by reference to Exhibit 10.1 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the quarter ended September 30, 2017, filed on November 3, 2017, File No. 1-32853).\nX\n10.46.2**\nAmendment to Duke Energy Corporation Executive Savings Plan, dated as of October 1, 2020 (incorporated by reference to Exhibit 10.2 to Duke Energy Corporation's\n Current Report on Form 8-K filed on September 25, 2020, File No. 1-32853).\nX\n10.47**\nRetention Award Agreement (incorporated by reference to Exhibit 10.42 to Duke Energy Corporation's Annual Report on Form 10-K for the year ended December 31, 2021, filed on February 24, 2022, File No. 1-32853).\n \nX\n10.48\nAgreement between Duke Energy SAM, LLC, Duke Energy Ohio, Inc., Duke Energy Commercial Enterprise, Inc. and Dynegy Resource I, LLC, dated as of August 21, 2014 (incorporated by reference to Exhibit 10.61 to Duke Energy Corporation's Annual Report on Form 10-K for the year ended December 31, 2014, filed on March 2, 2015, File No. 1-32853). \nX\nX\n10.49\nAsset Purchase Agreement between Duke Energy Progress, Inc. and North Carolina Eastern Municipal Power Agency, dated as of September 5, 2014 (incorporated by reference to Exhibit 10.62 to Duke Energy Corporation's Annual Report on Form 10-K for the year ended December 31, 2014, filed on March 2, 2015, File No. 1-32853).\nX\nX\n10.50\nAccelerated Stock Repurchase Program executed by Goldman, Sachs & Co., and JPMorgan Chase Bank, N.A. on April 6, 2015, under an agreement with Duke Energy Corporation (incorporated by reference to Exhibit 10.1 to Duke Energy Corporation's Current Report on Form 8-K filed on April 6, 2015, File No. 1-32853). \nX\n10.51\nPlea Agreement between Duke Energy Corporation and the Court of the Eastern District of North Carolina in connection with the May 14, 2015, Dan River Grand Jury Settlement (incorporated by reference to Exhibit 10.3 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the quarter ended June 30, 2015, filed on August 7, 2015, File No. 1-32853). \nX\n10.52\nPlea Agreement between Duke Energy Corporation and the Court of the Eastern District of North Carolina in connection with the May 14, 2015, Dan River Grand Jury Settlement (incorporated by reference to Exhibit 10.4 to Duke Energy Corporation's Quarterly Report on Form 10-Q for the quarter ended June 30, 2015, filed on August 7, 2015, File No. 1-32853).\nX\n10.53\nPurchase and Sale Agreement by and among Duke Energy International Group S.à.r.l., Duke Energy International Brazil Holdings S.à.r.l. and China Three Gorges (Luxembourg) Energy S.à.r.l., dated as of October 10, 2016 (incorporated by reference to Exhibit 2.1 to registrant's Current Report on Form 8-K filed on October 13, 2016, File No. 1-32853). \nX\n10.54\nPurchase and Sale Agreement by and among Duke Energy Brazil Holdings II, C.V., Duke Energy International Uruguay Investments SRL, Duke Energy International Group S.à.r.l., Duke Energy International España Holdings SL, Duke Energy International Investments No. 2 Ltd., ISQ Enerlam Aggregator, L.P., and Enerlam (UK) Holdings Ltd., dated as of October 10, 2016 (incorporated by reference to Exhibit 2.2. to registrant's Current Report on Form 8-K filed on October 13, 2016, File No. 1-32853). \nX\n10.55\n$1,000,000,000 Credit Agreement, dated as of June 14, 2017, among Duke Energy Corporation, the Lenders listed therein, The Bank of Nova Scotia, as Administrative Agent, PNC Bank, N.A., Sumitomo Mitsui Banking Corporation, and TD Bank, N.A., as C\no\n-Syndication Agents, and Bank of China, New York Branch, BNP Paribas, Santander Bank, N.A. and U.S. Bank N.A., as Co-Documentation Agents (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on June 14, 2017, File No. 1-32853).\nX\n10.56\n$1,000,000,000 Credit Agreement, dated as of May 15, 2019, among Duke Energy Corporation, the Lenders party thereto, The Bank of Nova Scotia, as Administrative Agent, PNC Bank, N.A., Sumitomo Mitsui Banking Corporation, and TD Bank, N.A., as Co-Syndication Agents, and Bank of China, New York Branch, BNP Paribas, Santander Bank, N.A., and U.S. Bank, N.A., as Co-Documentation Agents (incorporated by reference to Exhibit 10.1 to registrant’s Current Report on Form 8-K filed on May 16, 2019, File No. 1-32853).\nX\n10.56.1\nFirst Amendment to $1,000,000,000 Credit Agreement, dated as of May 15, 2019, among Duke Energy Corporation, the Lenders party therein, The Bank of Nova Scotia, as Administrative Agent, PNC Bank, N.A., Sumitomo Mitsui Banking Corporation, and TD Bank, N.A., as Co-Syndication Agents, and Bank of China, New York Branch, BNP Paribas, Santander Bank, N.A., and U.S\n.\n Bank, N.A., as Co-Documentation Agents (incorporated by reference to Exhibit 10.3 to registrant's Quarterly Report on Form 10-Q for the quarter ended March 31, 2021, filed on May 10, 2021, File No. 1-32853).\nX\n10.57\nAmended and Restated Credit Agreement, dated as of March 18, 2022, among Duke Energy Corporation, Duke Energy Carolinas, LLC, Duke Energy Ohio, Inc., Duke Energy Indiana, LLC, Duke Energy Kentucky, Inc., Duke Energy Progress, LLC, Duke Energy Florida, LLC, and Piedmont Natural Gas Company, Inc., the Lenders party thereto, Wells Fargo Bank, National Association, as Administrative Agent and Swingline Lender and Wells Fargo Securities, LLC, as Joint Lead Arranger, Joint Bookrunner and Sustainability Structuring Agent. that increases the amount of the credit facility from $8B to $9B (incorporated by reference to Exhibit 10.1 to registrants' Current Report on Form 8-K filed on March 21, 2022, File Nos. 1-32853, 1-4928, 1-3382, 1-3274, 1-1232, 1-3543, 1-6196).\nX\nX\nX\nX\nX\nX\nX\n10.57.1\nAmendment No. 1, dated as of March 17, 2023, to Amended and Restated Credit Agreement, dated as of March 18, 2022 (incorporated by reference to Exhibit 10.1 to registrant's Quarterly Report on Form 10-Q for the quarter ended March 31, 2023, filed on May 9, 2023, File Nos. 1-32853, 1-4928, 1-3382, 1-3274, 1-1232, 1-3543, 1-6196).\nX\nX\nX\nX\nX\nX\nX\n10.58\n$800 million Credit Agreement, dated as of October 21, 2022, among Duke Energy Florida, LLC, as Borrower, the lenders listed therein, Truist Bank, as Administrative Agent, Truist Securities, Inc., Mizuho Bank Ltd., and TD Bank, N.A., as Joint Lead Arrangers, and Truist Securities, Inc., as Sole Bookrunner (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on October 21, 2022, File No. 1-3274\nX\n10.59\n$1.5 billion 364-Day Term Loan Credit Agreement, dated as of March 19, 2020, among the registrant, as Borrower, certain Lenders from time to time parties thereto, and PNC Bank, N.A., as Administrative Agent, and registrant's borrowing of the remaining $500 million under registrant's existing $1 billion revolving credit facility on March 17, 2020 (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on March 19, 2020, File No. 1-32853). \nX\n10.60\nJoinder Agreement, dated as of March 27, 2020, by and among, the registrant, each of the Incremental Lenders listed therein, and PNC Bank, N.A., as Administrative Agent (incorporated by reference to Exhibit 10.2.1 to registrant's Quarterly Report on Form 10-Q for the quarter ended March 31, 2020, filed on May 12, 2020, File No. 1-32853).\nX\n10.61\n$1,400,000,000 Term Loan Credit Facility, dated as of March 9, 2022, among the registrant, as Borrower, certain Lenders from time to time parties thereto, and The Bank of Nova Scotia as Administrative Agent and Coordinating Lead Arranger (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on March 22, 2022, File No. 1-32853).\nX\n10.61.1\nLender Waiver Letter, dated as of March 29, 2023, to Amended and Restated Term Loan Credit Agreement, dated as of March 9, 2022 (incorporated by reference to Exhibit 10.2 to registrant's Quarterly Report of Form 10-Q for the quarter ended March 31, 2023, filed on May 9, 2023, File Nos. 1-32853, 1-4928, 1-3382, 1-3274, 1-1232, 1-3543, 1-6196).\nX\nX\nX\nX\nX\nX\nX\n10.62\nNote Purchase Agreement, dated as of May 6, 2011, among Piedmont Natural Gas Company, Inc. and the Purchasers party thereto (incorporated by reference to Exhibit 10 to registrant's Current Report on Form 8-K filed on May 12, 2011, File No. 1-06196).\nX\n10.63\nAmended and Restated Limited Liability Company Agreement of Constitution Pipeline Company, LLC dated April 9, 2012, by and among Williams Partners Operating LLC and Cabot Pipeline Holdings LLC (incorporated by reference to Exhibit 10.1 to registrant's Quarterly Report on Form 10-Q for the quarter ended January 31, 2013, filed on March 6, 2013, File No. 1-06196).\nX\n10.63.1\nFirst Amendment to Amended and Restated Limited Liability Company Agreement of Constitution Pipeline Company, LLC, dated as of November 9, 2012, by and among Constitution Pipeline Company, LLC, Williams Partners Operating LLC, Cabot Pipeline Holdings LLC, and Piedmont Constitution Pipeline Company, LLC (incorporated by reference to Exhibit 10.2 to registrant's Quarterly Report on Form 10-Q for the quarter ended January 31, 2013, filed on March 6, 2013, File No. 1-06196).\nX\n10.63.2\nSecond Amendment to Amended and Restated Limited Liability Company Agreement of Constitution Pipeline Company, LLC, dated as of May 29, 2013, by and among Constitution Pipeline Company, LLC, Williams Partners Operating LLC, Cabot Pipeline Holdings LLC, Piedmont Constitution Pipeline Company, LLC, and Capitol Energy Ventures Corp. (incorporated by reference to Exhibit 99.1 to registrant's Current Report on Form 8-K filed on September 4, 2013, File No. 1-06196).\nX\n10.64\nSecond Amended and Restated Limited Liability Company Agreement of SouthStar Energy Services LLC, dated as of September 1, 2013, by and between Georgia Natural Gas Company and Piedmont Energy Company (incorporated by reference to Exhibit 10.39 to registrant's Annual Report on Form 10-K for the year ended October 31, 2013, filed on December 23, 2013, File No. 1-06196).\nX\n10.65\nLimited Liability Company Agreement of Atlantic Coast Pipeline, LLC, dated as of September 2, 2014, by and between Dominion Atlantic Coast Pipeline, LLC, Duke Energy ACP, LLC, Piedmont ACP Company, LLC, and Maple Enterprise Holdings, Inc. (incorporated by reference to Exhibit 10.35 to registrant's Annual Report on Form 10-K for the year ended October 31, 2014, filed on December 23, 2014, File No. 1-06196).\nX\n10.66\nAmended and Restated Limited Liability Company Operating Agreement of Duke Energy Indiana Holdco, LLC (incorporated by reference to Exhibit 10.1 to registrants' Current Report on Form 8-K filed on September 8, 2021, File Nos. 1-32853, 1-03543).\nX\nX\n10.67\nEngineering, Procurement and Construction Agreement between Duke Energy Business Services, LLC, as agent for and on behalf of Piedmont Natural Gas Company Inc. and Matrix Service, Inc., dated as of April 30, 2019 (incorporated by reference to Exhibit 10.1 to registrant’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2019, filed on August 6, 2019, File No. 1-06196). (Portions of the exhibit have been omitted for confidentiality.) \nX\n10.68\nDecommissioning Services Agreement between Duke Energy Florida, LLC, and ADP CR3, LLC, and ADP SF1, LLC (incorporated by reference to Exhibit 10.3 to registrant's Quarterly Report on Form 10-Q for the quarter ended June 30, 2019, filed on August 6, 2019, File No. 2-5293). (Portions of the exhibit have been omitted for confidentiality.)\nX\n10.69\nForm of Forward Sale Agreement (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on November 8, 2019, File No. 1-32853).\nX\n10.70\nLease Agreement dated as of December 23, 2019, between the registrant and CGA 525 South Tryon TIC 1, LLC, a Delaware limited liability company, CGA 525 South Tryon TIC 2, LLC, a Delaware limited liability company, and CK 525 South Tryon TIC, LLC, a Delaware limited liability company (incorporated by reference to Exhibit 10.64 to registrant's Annual Report on Form 10-K for the year ended December 31, 2019, filed on February 20, 2020, File No. 1-4928).\nX\n10.71\nConstruction Agency Agreement dated as of December 23, 2019, between the registrant and CGA 525 South Tryon TIC 1, LLC, a Delaware limited liability company, CGA 525 South Tryon TIC 2, LLC, a Delaware limited liability company, and CK 525 South Tryon TIC, LLC, a Delaware limited liability company (incorporated by reference to Exhibit 10.65 to registrant's Annual Report on Form 10-K for the year ended December 31, 2019, filed on February 20, 2020, File No. 1-4928).\nX\n10.72\nEquity Distribution Agreement, dated November 10, 2022, among Duke Energy Corporation and Barclays Capital, Inc., BofA Securities, Inc., Credit Suisse Securities (USA) LLC, Mizuho Securities USA LLC, Scotia Capital (USA) Inc. and SMBC Nikko Securities America, Inc., acting as sales agents, and Barclays Capital Inc., BofA Securities Inc., Credit Suisse Securities (USA) LLC, Mizuho Markets Americas LLC and Scotia Capital (USA) Inc. or their respective affiliates, acting as forward purchasers (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K, filed on November 10, 2022, File No. 1-32853\n).\nX\n*19\nDuke Energy Corporation Securities Trading Policy, as amended May 9, 2024\nX\n*21\nList of Subsidiaries\nX\n \n*23.1.1\nConsent of Independent Registered Public Accounting Firm.\nX\n \n*23.1.2\nConsent of Independent Registered Public Accounting Firm.\n \nX\n \n*23.1.3\nConsent of Independent Registered Public Accounting Firm.\n \n \nX\n \n*23.1.4\nConsent of Independent Registered Public Accounting Firm.\n \n \n \nX\n \n*23.1.5\nConsent of Independent Registered Public Accounting Firm.\n \n \n \nX\n \n*23.1.6\nConsent of Independent Registered Public Accounting Firm.\n \n \n \nX\n*23.1.7\nConsent of Independent Registered Public Accounting Firm.\nX\n*24.1\nPower of attorney authorizing Lynn J. Good and others to sign the Annual Report on behalf of the registrant and certain of its directors and officers.\nX\n*24.2\nCertified copy of resolution of the Board of Directors of the registrant authorizing power of attorney.\nX\n*31.1.1\nCertification of the Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.1.2\nCertification of the Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.1.3\nCertification of the Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.1.4\nCertification of the Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.1.5\nCertification of the Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.1.6\nCertification of the Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.1.7\nCertification of the Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.1.8\nCertification of the Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.2.1\nCertification of the Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.2.2\nCertification of the Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.2.3\nCertification of the Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.2.4\nCertification of the Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.2.5\nCertification of the Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.2.6\nCertification of the Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.2.7\nCertification of the Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*31.2.8\nCertification of the Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n*32.1.1\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.1.2\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.1.3\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.1.4\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.1.5\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.1.6\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.1.7\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.1.8\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.2.1\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.2.2\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.2.3\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.2.4\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.2.5\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.2.6\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.2.7\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*32.2.8\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\n*97**\nDuke Energy Corporation Clawback Policy\n \nX\n*101.INS\nXBRL Instance Document (this does not appear in the Interactive Data File because it's XBRL tags are embedded within the Inline XBRL document).\nX\nX\nX\nX\nX\nX\nX\nX\n*101.SCH\nXBRL Taxonomy Extension Schema Document\nX\nX\nX\nX\nX\nX\nX\nX\n*101.CAL\nXBRL Taxonomy Calculation Linkbase Document\nX\nX\nX\nX\nX\nX\nX\nX\n*101.LAB\nXBRL Taxonomy Label Linkbase Document\nX\nX\nX\nX\nX\nX\nX\nX\n*101.PRE\nXBRL Taxonomy Presentation Linkbase Document\nX\nX\nX\nX\nX\nX\nX\nX\n*101.DEF\nXBRL Taxonomy Definition Linkbase Document\nX\nX\nX\nX\nX\nX\nX\nX\n*104\nCover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101).\nX\nX\nX\nX\nX\nX\nX\nX\nThe total amount of securities of each respective registrant or its subsidiaries authorized under any instrument with respect to long-term debt not filed as an exhibit does not exceed 10% of the total assets of such registrant and its subsidiaries on a consolidated basis. Each registrant agrees, upon request of the SEC, to furnish copies of any or all of such instruments to it. \nE-1\nSIGNATURES\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrants have duly caused this report to be signed on their behalf by the undersigned, thereunto duly authorized.\nDate: February 27, 2025\nDUKE ENERGY CORPORATION\n(Registrant)\nBy:\n/s/ LYNN J. GOOD\nLynn J. Good\nChair and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated. \n(i)\n/s/ LYNN J. GOOD\n \nLynn J. Good\n \nChair and Chief Executive Officer (Principal Executive Officer and Director)\n \n \n(ii)\n/s/ BRIAN D. SAVOY\n \nBrian D. Savoy\n \nExecutive Vice President and Chief Financial Officer (Principal Financial Officer)\n \n \n(iii)\n/s/ CYNTHIA S. LEE\n \nCynthia S. Lee\n \nSenior Vice President, Chief Accounting Officer and Controller (Principal Accounting Officer)\n \n \n \n(iv)\nDirectors:\n \n \nDerrick Burks*\nLynn J. Good*\nAnnette K. Clayton*\nJohn T. Herron*\n \nTheodore F. Craver, Jr.*\nIdalene F. Kesner*\n \nRobert M. Davis*\nE. Marie McKee*\n \nCaroline D. Dorsa*\nMichael J. Pacilio*\nW. Roy Dunbar*\nThomas E. Skains*\n \nNicholas C. Fanandakis*\nWilliam E. Webster, Jr.*\n \n \nBrian D. Savoy, by signing his name hereto, does hereby sign this document on behalf of the registrant and on behalf of each of the above-named persons previously indicated by asterisk (*) pursuant to a power of attorney duly executed by the registrant and such persons, filed with the Securities and Exchange Commission as an exhibit hereto.\n \n \n \n \nBy:\n/s/ BRIAN D. SAVOY\n \nAttorney-In-Fact\n \n \n \n \n Date: February 27, 2025\nE-2\nSIGNATURES\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: February 27, 2025 \nDUKE ENERGY CAROLINAS, LLC\n(Registrant)\nBy:\n/s/ LYNN J. GOOD\nLynn J. Good\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated.\n \n \n \n(i)\n/s/ LYNN J. GOOD\n \nLynn J. Good\n \nChief Executive Officer (Principal Executive Officer)\n \n \n \n(ii)\n/s/ BRIAN D. SAVOY\n \nBrian D. Savoy\n \nExecutive Vice President and Chief Financial Officer (Principal Financial Officer)\n \n \n \n(iii)\n/s/ CYNTHIA S. LEE\n \nCynthia S. Lee\n \nSenior Vice President, Chief Accounting Officer and Controller (Principal Accounting Officer)\n \n \n \n(iv)\nDirectors:\n \n \n \n \n \n/s/ KODWO GHARTEY-TAGOE\n \n \nKodwo Ghartey-Tagoe\n \n \n \n \n \n/s/ LYNN J. GOOD\n \n \nLynn J. Good\n \n \n \n \n \n/s/ JULIA S. JANSON\n \n \nJulia S. Janson\n \nDate: February 27, 2025\nE-3\nSIGNATURES\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: February 27, 2025\nPROGRESS ENERGY, INC.\n(Registrant)\nBy:\n/s/ LYNN J. GOOD\nLynn J. Good\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated.\n \n \n \n(i)\n/s/ LYNN J. GOOD\n \n \nLynn J. Good\n \n \nChief Executive Officer (Principal Executive Officer)\n \n \n \n(ii)\n/s/ BRIAN D. SAVOY\n \nBrian D. Savoy\n \nExecutive Vice President and Chief Financial Officer (Principal Financial Officer)\n \n(iii)\n/s/ CYNTHIA S. LEE\n \nCynthia S. Lee\n \nSenior Vice President, Chief Accounting Officer and Controller (Principal Accounting Officer)\n \n \n \n(iv)\nDirectors:\n \n \n \n \n \n/s/ KODWO GHARTEY-TAGOE\n \n \nKodwo Ghartey-Tagoe\n \n \n \n \n \n/s/ LYNN J. GOOD\n \n \nLynn J. Good\n \nDate: February 27, 2025\nE-4\nSIGNATURES\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: February 27, 2025\nDUKE ENERGY PROGRESS, LLC\n(Registrant)\nBy:\n/s/ LYNN J. GOOD\nLynn J. Good\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated.\n(i)\n/s/ LYNN J. GOOD\n \nLynn J. Good\n \nChief Executive Officer (Principal Executive Officer)\n \n \n(ii)\n/s/ BRIAN D. SAVOY\n \nBrian D. Savoy\n \nExecutive Vice President and Chief Financial Officer (Principal Financial Officer)\n \n(iii)\n/s/ CYNTHIA S. LEE\n \nCynthia S. Lee\n \nSenior Vice President, Chief Accounting Officer and Controller (Principal Accounting Officer)\n \n \n(iv)\nDirectors:\n \n \n \n/s/ KODWO GHARTEY-TAGOE\n \nKodwo Ghartey-Tagoe\n \n \n/s/ T. PRESTON GILLESPIE JR.\nT. Preston Gillespie Jr.\n \n/s/ R. ALEXANDER GLENN\n \nR. Alexander Glenn\n \n \n \n/s/ LYNN J. GOOD\n \nLynn J. Good\n \n \n \n/s/ JULIA S. JANSON\n \nJulia S. Janson\nDate: February 27, 2025\nE-5\nSIGNATURES\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: February 27, 2025\nDUKE ENERGY FLORIDA, LLC\n(Registrant)\nBy:\n/s/ LYNN J. GOOD\nLynn J. Good\nChief Executive Officer\n \nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated.\n \n \n \n(i)\n/s/ LYNN J. GOOD\n \nLynn J. Good\n \nChief Executive Officer (Principal Executive Officer)\n \n \n \n(ii)\n/s/ BRIAN D. SAVOY\n \nBrian D. Savoy\n \nExecutive Vice President and Chief Financial Officer (Principal Financial Officer)\n \n \n \n(iii)\n/s/ CYNTHIA S. LEE\n \nCynthia S. Lee\n \nSenior Vice President, Chief Accounting Officer and Controller (Principal Accounting Officer)\n \n \n \n(iv)\nDirectors:\n \n \n/s/ KODWO GHARTEY-TAGOE\n \n \nKodwo Ghartey-Tagoe\n \n \n \n \n/s/ T. PRESTON GILLESPIE JR.\nT. Preston Gillespie Jr.\n \n/s/ R. ALEXANDER GLENN\n \nR. Alexander Glenn\n \n \n \n \n/s/ LYNN J. GOOD\n \nLynn J. Good\n \n \n \n \n/s/ JULIA S. JANSON\n \n \nJulia S. Janson\n \nDate: February 27, 2025\nE-6\nSIGNATURES\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: February 27, 2025\nDUKE ENERGY OHIO, INC.\n(Registrant)\nBy:\n/s/ LYNN J. GOOD\nLynn J. Good\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated.\n \n \n \n(i)\n/s/ LYNN J. GOOD\n \nLynn J. Good\n \nChief Executive Officer (Principal Executive Officer)\n \n(ii)\n/s/ BRIAN D. SAVOY\n \nBrian D. Savoy\n \nExecutive Vice President and Chief Financial Officer (Principal Financial Officer)\n \n(iii)\n/s/ CYNTHIA S. LEE\n \nCynthia S. Lee\n \nSenior Vice President, Chief Accounting Officer and Controller (Principal Accounting Officer)\n \n \n \n(iv)\nDirectors:\n \n/s/ KODWO GHARTEY-TAGOE\nKodwo Ghartey-Tagoe\n \n \n \n \n/s/ R. ALEXANDER GLENN\n \n \nR. Alexander Glenn\n \n \n \n \n \n/s/ LYNN J. GOOD\n \n \nLynn J. Good\n \nDate: February 27, 2025\nE-7\nSIGNATURES\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: February 27, 2025\nDUKE ENERGY INDIANA, LLC\n(Registrant)\nBy:\n/s/ LYNN J. GOOD\nLynn J. Good\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated.\n \n \n \n(i)\n/s/ LYNN J. GOOD\n \nLynn J. Good\n \nChief Executive Officer (Principal Executive Officer)\n \n(ii)\n/s/ BRIAN D. SAVOY\n \nBrian D. Savoy\n \nExecutive Vice President and Chief Financial Officer (Principal Financial Officer)\n \n(iii)\n/s/ CYNTHIA S. LEE\n \nCynthia S. Lee\n \nSenior Vice President, Chief Accounting Officer and Controller (Principal Accounting Officer)\n \n \n \n(iv)\nDirectors:\n \n \n \n \n \n/s/ R. ALEXANDER GLENN\nR. Alexander Glenn\n \n \n \n \n/s/ KELLEY A. KARN\nKelley A. Karn\n/s/ STAN PINEGAR\nStan Pinegar\nDate: February 27, 2025\nE-8\nSIGNATURES\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: February 27, 2025\nPIEDMONT NATURAL GAS COMPANY, INC.\n(Registrant)\nBy:\n/s/ LYNN J. GOOD\nLynn J. Good\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated.\n \n \n \n(i)\n/s/ LYNN J. GOOD\n \nLynn J. Good\n \nChief Executive Officer (Principal Executive Officer)\n \n(ii)\n/s/ BRIAN D. SAVOY\n \nBrian D. Savoy\n \nExecutive Vice President and Chief Financial Officer (Principal Financial Officer)\n \n(iii)\n/s/ CYNTHIA S. LEE\n \nCynthia S. Lee\n \nSenior Vice President, Chief Accounting Officer and Controller (Principal Accounting Officer)\n \n \n \n(iv)\nDirectors:\n \n \n/s/ KODWO GHARTEY-TAGOE\nKodwo Ghartey-Tagoe\n/s/ LYNN J. GOOD\nLynn J. Good\n/s/ BRIAN D. SAVOY\nBrian D. Savoy\nDate: February 27, 2025\nE-9"
}