{
  "ticker": "DVA",
  "cik": "0000927066",
  "company_name": "DAVITA INC.",
  "filing_date": "2025-02-13",
  "accession": "0000927066-25-000012",
  "primary_doc": "dva-20241231.htm",
  "item1_text": "Item 1. \"\nBusiness\n\" under the heading \"\nGovernment Regulation,\n\" certain provisions of California bill (AB 290), including the amount of reimbursement paid to certain providers for services provided to patients with commercial insurance who receive charitable premium assistance (reimbursement cap), could have negative consequences on our business if implemented in its proposed form. Depending on what provisions are implemented, organizations that provide charitable premium assistance may choose to withdraw from California, which would have an adverse impact on the ability of patients to afford Medicare premiums and Medicare supplemental and commercial coverage. We expect that such an adverse impact will in turn adversely impact our business, results of operations, financial condition and cash flows. In the past, bills similar to AB 290 have been introduced in other states, but none has become law. If these or similar bills are introduced and implemented in other jurisdictions, and organizations that provide charitable premium assistance in those jurisdictions are similarly impacted, it could in the aggregate have a material adverse impact on our business, results of operations, financial condition and cash flows. For additional information on risks associated with charitable premium assistance for ESRD patients and the potential impact of decreases to the percentage or number of our patients with commercial insurance, see the risk factor under the heading \n\"If the number or percentage of patients with higher-paying commercial insurance declines...\"\nAmong other things, legislation, regulations, regulatory guidance, ballot initiatives and any similar initiatives could result in a reduction in the percentage of our patients with commercial insurance; limit the scope or nature of coverage through the healthcare exchanges established by the ACA or other health insurance programs or otherwise reduce reimbursement rates for our services from commercial and/or government payors; restrict or prohibit the ability of patients with access to alternative coverage from selecting a marketplace plan on or off exchange; limit the amount of revenue that a dialysis provider can retain for caring for patients with commercial insurance; impose burdensome operational requirements; affect payments made to providers for services provided to patients who receive charitable premium assistance and/or otherwise restrict or prohibit the use of charitable premium assistance; or reduce the standards for network adequacy or require disclosure of certain pricing and patient responsibility information. In turn, these potential impacts could cause us to incur substantial costs to oppose any such proposed requirements or measures, impact our dialysis center development plans, and if passed and/or implemented, could materially reduce our revenues and increase our operating and other costs, adversely impact dialysis centers across the U.S. \n30\nmaking certain centers economically unviable, lead to the closure of certain centers, restrict the ability of dialysis patients to obtain and maintain optimal insurance coverage and reduce the number of patients that select commercial insurance plans or Medicare Advantage (MA) plans for their dialysis care, among other things. For additional details regarding insurance coverage for dialysis services, see the discussion in the risk factor under the heading \n\"If the number or percentage of patients with higher-paying commercial insurance declines...\" \nThe healthcare legislative and regulatory environment is dynamic and evolving, and any such proposed or issued laws, requirements, rules and guidance could impact our business, including as may be described above, and any failure on our part to adequately adjust to any resulting marketplace developments or regulatory compliance requirements, may, among other things, erode our patient base or reimbursement rates and could otherwise have a material adverse effect on our business, results of operations, financial condition and cash flows. \nTo the extent that the information above describes statutory and regulatory provisions, it is qualified in its entirety by reference to the particular statutory and regulatory provisions that are referenced. For additional information related to the laws, rules and other regulations described above, see Part I Item 1. \"\nBusiness\n\" under the heading \"\nGovernment Regulation.\n\"\nWe are, and may in the future be, a party to various lawsuits, demands, claims, \nqui tam\n suits, governmental investigations and audits and other legal matters, any of which could result in, among other things, substantial financial penalties\n \nor awards against us, mandated refunds, substantial payments made by us, required changes to our business practices, exclusion from future participation in Medicare, Medicaid and other healthcare programs and possible criminal penalties, any of which could have a material adverse effect on our business, results of operations, financial condition, cash flows, reputation and stock price.\nWe are, and may in the future be, subject to investigations and audits by governmental agencies, private civil \nqui tam\n complaints filed by relators and other lawsuits, demands, claims, legal proceedings and/or other actions alleging our failure to comply with a rule, regulation, law or practice of medicine. We are, and can be in the future, subject to audits from the government concerning the billing for our patients.\n \nIf, following the conclusion of any audit, the government were to require us to refund amounts and/or modify our business practices, and such amounts or changes are significant, it could have a material adverse effect on our business, results of operations, financial condition and cash flows. The healthcare industry is highly visible and politically charged, and any allegation against us, our personnel, representatives, third party vendors, or operations in such matters or matters that involve patients suffering adverse health outcomes, may, among other things harm our reputation, stock price, and it could impact our relationships and/or contracts related to our business, among other things. Each of these impacts may be material. \nResponding to subpoenas, investigations and other lawsuits, claims and legal proceedings, as well as defending ourselves in such matters, will continue to require management's attention and cause us to incur significant legal expense. Negative developments, findings or terms and conditions that we might agree to accept as part of a negotiated resolution of pending or future legal or regulatory matters, or have been forced upon us, could result in, among other things, harm to our reputation, substantial financial penalties or awards against us, substantial payments made by us, required changes to our business practices, impacts on our various relationships and/or contracts related to our business, exclusion from future participation in Medicare, Medicaid and other healthcare programs and, in certain cases, criminal penalties, any of which could have a material adverse effect on us. It is possible that criminal proceedings may be initiated against us and/or individuals in our business in connection with governmental investigations. Other than as may be described in Note 15 to the consolidated financial statements included in this report, we cannot predict the ultimate outcomes of the various legal proceedings and regulatory matters to which we are or may be subject from time to time, or the timing of their resolution or the ultimate losses or impact of developments in those matters, which could have a material adverse effect on our business, results of operations, financial condition, cash flows, reputation and stock price. See Note 15 to the consolidated financial statements included in this report for further details regarding these and other legal proceedings and regulatory matters.\nIf the number or percentage of patients with higher-paying commercial insurance declines, if the average rates that commercial payors pay us decline, if commercial plans subject patients to restriction in plan designs, or if we are unable to maintain contracts with payors with competitive terms, including, without limitation, reimbursement rates, scope and duration of coverage and in-network benefits, it could have a material adverse effect on our business, results of operations, financial condition and cash flows.\nA substantial portion of our U.S. dialysis patient service revenues are generated from patients who have commercial payors as their primary payor. The majority of these patients have insurance policies that pay us on terms and at rates that are generally significantly higher than Medicare rates. As such our revenue and net income levels are sensitive to the number of our patients with higher-paying commercial insurance coverage and the percentage of our patients under higher-paying commercial plans relative to government-based programs. The payments we receive from commercial payors generate nearly all of our profit and all of our nonacute dialysis profits come from commercial payors. \n31\nWhen traditional or original Medicare (Medicare) becomes the primary payor for a patient, the payment rate we receive for that patient decreases from the employer group health plan or commercial plan rate to the lower Medicare payment rate. There are a number of factors that could drive a decline in the number or percentage of our patients covered under commercial insurance plans, including, among other things, improved mortality, changes in the patient's or a family member's employment status, reduced availability of commercial health plans or reduced coverage by such plans through the ACA exchanges or otherwise due to changes to the laws, marketplace, healthcare regulatory system or otherwise. For example, certain premium tax credits available to patients who purchase health insurance on marketplaces developed under the ACA are scheduled to expire at the end of 2025 unless extended or made permanent by legislative action. The potential expiration of these tax credits may significantly reduce the affordability of commercial insurance plans, leading to fewer patients covered by such plans. This may, in turn, result in more patients shifting to Medicare or other government-based program, further decreasing the percentage of patients covered under commercial insurance plans. Commercial payors could also cease paying in the primary position after providing 30 months of coverage resulting in potentially material reductions in payment as the patient moves to Medicare primary. Declining macroeconomic conditions could also negatively impact the percentage of our patients covered under commercial insurance plans. To the extent there are job losses in the U.S., we could experience a decrease in the number of patients covered under commercial plans and/or an increase in uninsured and underinsured patients independent of whether general economic conditions improve. If we experience higher numbers of uninsured or underinsured patients, it also would result in an increase in uncollectible accounts.\nOur arrangements and negotiations with payors also impact the number or percentage of patients with higher-paying commercial insurance. We continuously are in the process of negotiating existing and potential new agreements with commercial payors who aggressively negotiate terms with us, and we can make no assurances about the ultimate results of these negotiations or the timing of any potential rate changes resulting from these negotiations. A material portion of both our commercial revenue and MA revenue is concentrated with a limited number of commercial payors, and any changes impacting our highest paying commercial payors or our relationships with these payors will have a disproportionate impact on us. Sometimes many significant agreements are being renegotiated at the same time. We believe payor consolidations have significantly increased the negotiating leverage of commercial payors, and ongoing consolidations may continue to increase this leverage in the future. In addition, our agreements and rates with commercial payors may be impacted by new business activities of these commercial payors as well as steps that these commercial payors have taken and may continue to take to control the cost of and/or the eligibility for access to the services that we provide, including, without limitation, relative to products on and off the healthcare exchanges. These efforts could impact the number of our patients who are eligible to enroll in commercial insurance plans, and remain on the plans, including plans offered through healthcare exchanges. We continue to experience downward pressure on some of our rates with commercial payors as a result of these and other general conditions in the market, including, among other things, as employers seek to shift to less expensive options for medical services or as commercial payors dedicate increased focus on dialysis services.\nOur negotiations with commercial payors may relate to commercial fee-for-service contracts and value-based care (VBC) contracts in which we share risk with commercial payors or other structures that allow the parties to share in cost savings upon the achievement of certain outcomes, as well as contracts to provide dialysis services to MA patients. If we fail to maintain contracts with payors and other healthcare providers with competitive or favorable terms, either with respect to commercial plans, commercial VBC contracts, MA plans or otherwise, including, without limitation, with respect to reimbursement rates, scope and duration of coverage and in-network benefits, contract term or termination rights, or if we fail to accurately estimate the price for and manage our medical costs in an effective manner, whether due to inflationary pressures or otherwise, such that the profitability of our commercial or other value-based products is negatively impacted, it could have a material adverse effect on our business, results of operations, financial condition and cash flows. The ultimate result of our negotiations with payors cannot be predicted as they occur in a highly competitive environment and are influenced by changes to payment rates set by CMS and other marketplace dynamics such as those previously discussed. Among other things, these negotiations may result in termination or non-renewals of existing agreements, decreases in contracted rates, and reduction in the number of our patients that are covered by commercial plans, and we may not be able to enter into new agreements on competitive terms or at all. In the event that our ongoing negotiations with commercial payors result in overall rate reductions in excess of overall rate increases, the cumulative effect could have a material adverse effect on our business, results of operations, financial condition and cash flows. In addition, to the extent that these negotiations result in a reduction in the number of our patients covered by plans with commercial payors, it could have a material adverse effect on our business, results of operations, financial condition and cash flows. \nCertain payors have been attempting to design and implement plans that restrict or limit coverage for treatment needed by ESRD patients in the commercial market. Among other things, these restrictive plan designs seek to limit the duration and/or the breadth of ESRD benefits, limit in-network providers, set arbitrary provider reimbursement rates, or otherwise restrict access to care, all of which may result in a decrease in the number of patients covered by commercial insurance or the reimbursement rate for ESRD services, among other things. Payors have also disputed the scope and duration of ESRD benefit \n32\ncoverage under their plans, and, among other things, have required patients to seek Medicare coverage for ESRD treatments. On June 21, 2022, the U.S. Supreme Court issued a decision in the matter of \nMarietta Memorial Hospital Employee Health Benefit Plan, et al. v. DaVita Inc., et al., \na case evaluating the current language of the Medicare Secondary Payor Act (MSPA), deciding that a group health plan that limits the benefits for outpatient dialysis, but does so uniformly for all plan participants, does not violate the terms of the MSPA because the plan treats all patients uniformly, regardless of whether a participant has ESRD and regardless of whether the participant is eligible for Medicare. We cannot reasonably estimate the ultimate impact of the U.S. Supreme Court’s decision at this time, as there is significant uncertainty as to, among other things, whether and to what extent payors, including, among others employer group health plans, may seek to design and implement plans to restrict access to ESRD in light of the decision; the results of proposed and pending legislative responses to the decision; how courts will interpret other anti-discriminatory provisions of the MSPA that may apply; whether there could be other potential negative impacts of the decision and any resultant plan behavior on our commercial or government mix or the number of our patients covered by commercial insurance; and the timing of each of these items. If more commercial or employer group health plans seek to implement or utilize plan designs that discourage or prevent ESRD patients from retaining their commercial coverage, during upcoming open enrollment periods or otherwise, it may lead to a decrease in the number of patients with commercial plans, the duration of benefits for patients under commercial plans and/or a decrease in the payment rates we receive, any of which could have a material adverse effect on our business, results of operations, financial condition and cash flows. \nIn addition, some commercial payors are pursuing or have incorporated policies into their provider manuals limiting or refusing to accept charitable premium assistance from non-profit organizations, such as the American Kidney Fund (AKF), which may impact the number of patients who are able to afford commercial plans. Paying for coverage is a significant financial burden for many patients, and ESRD disproportionately affects the low-income population. Charitable premium assistance supports continuity of coverage and access to care for patients, many of whom are unable to continue working full-time as a result of their severe health condition. Many patients with commercial and government insurance also rely on financial assistance from charitable organizations, such as the AKF. Certain payors have challenged our patients' and other providers' patients' ability to utilize assistance from charitable organizations for the payment of premiums, including, without limitation, through litigation and other legal proceedings. The use of charitable premium assistance for ESRD patients has also faced challenges and inquiries from legislators, regulators and other governmental authorities, including California AB 290 as described in the risk factor under the heading, \"\nChanges in federal and state legislation or regulations...\n\", and this may continue. In addition, CMS or another regulatory agency or legislative authority may issue a new rule or guidance that challenges or restricts charitable premium assistance. If any of these challenges to kidney patients' use of premium assistance is successful or restrictions are imposed on the use of financial assistance from such charitable organizations or if organizations providing such assistance are no longer available such that kidney patients are unable to obtain, or continue to receive or receive for a limited duration, such financial assistance, it may restrict the ability of dialysis patients to obtain and maintain optimal insurance coverage and could have a material adverse effect on our business, results of operations, financial condition and cash flows. In addition, if our assumptions about how kidney patients will respond to any change in financial assistance from charitable organizations are incorrect, it could have a material adverse effect on our business, results of operations, financial condition and cash flows.\nOur negotiations and relationships with payors may also be impacted by legislative or regulatory developments and associated legal rulings. For example, the final rules for the Cures Act, which are described in detail in Part I Item 1. \"\nBusiness\n\" under the heading \"\nGovernment Regulation,\n\"\n \nbroadened ESRD patient access to certain enhanced benefits offered by MA plans. While these rules increased our MA plan enrollment for ESRD benefits in their first year, the potential ultimate impact of this change in benefit eligibility remains subject to change as market participants continue to adjust to this regulatory environment, including such changes as, for example, the overall increases in MA plan enrollment for ESRD benefits or the removal of objective time and distance standards for network adequacy for outpatient dialysis centers. In addition, the ultimate impact of the price transparency regulations and \"Good Faith Estimate\" (GFE) requirements described in Part I Item 1. \"\nBusiness\n\" under the heading \"\nGovernment Regulation,\" \nremains uncertain at this time, in part due to ongoing rulemaking around the No Surprises Act as well as the delayed effective date of certain provisions of the GFE framework, and uncertainty around operational timeframes, potential penalties and patient reaction, among other things. While the ultimate impact of these requirements and the aforementioned price transparency rules remains uncertain, any changes by group health plans, health insurance issuers in the group and individual markets, or consumer choices resulting from these requirements could have a material adverse impact on our business, results of operations, and financial condition, and could materially harm our reputation. For additional details regarding these regulations and potential legislative or regulatory changes, the specific risks we face in connection with these regulations, and any decrease in payments we receive for services due to, for example, fewer patients being covered under commercial plans or an increase of patients covered under more restrictive commercial plans, or plans with lower reimbursement rates, see the discussion in the risk factor under the heading \n\"Changes in federal and state legislation or regulations...\n\"\n33\nAs noted, the foregoing dynamics of our arrangements and negotiations with commercial payors each may have an impact on, among other things, our ability to enter into and maintain contracts with payors with competitive terms, including, without limitation, reimbursement rates, scope and duration of coverage and in-network benefits as well as the number or percentage of our patients with higher-paying commercial insurance. If, as a result of these or other dynamics, we experience a decline in the average rates that commercial payors pay us or a reduction in the number of patients with ESRD coverage under higher-paying commercial plans either in total or relative to the number of patients under government-based programs that pay at lower rates or an increase in the number of patients that are uninsured or underinsured, it could have a material adverse effect on our business, results of operations, financial condition and cash flows. \nIf we are not able to successfully implement our strategy with respect to our integrated kidney care and value-based care initiatives, including maintaining our existing business and further developing our capabilities in a complex and highly regulated environment, \nit could result in a loss of our investments and have a material adverse effect on our growth strategy, could adversely impact our business, results of operations, financial condition and cash flows, and could materially harm our reputation\n.\nOur integrated kidney care business manages patients and coordinates their care through value-based care arrangements with commercial payors and through government programs. We have continued to grow this portion of our business both with commercial payors, including as MA has expanded, and with government programs as CMS and CMMI implement new payment models focused on comprehensive and integrated kidney care. A\ns part of our growth strategy, we have invested and expect to continue to invest substantial resources in the further development of our integrated care business and value-based care initiatives. There can be no assurances that we will be able to successfully implement our strategies with respect to integrated kidney care and value-based care in a complex, evolving and highly competitive and regulated environment, including, among other things, executing on initiatives to reduce the overall cost of care for our IKC patients; maintaining our existing business; recovering our investments; entering into agreements with payors, physicians, third party vendors and others on competitive terms, as appropriate, that prove actuarially sound; structuring these agreements and arrangements to comply with evolving rules and regulations, including, among other things, rules \nand regulations related to fraud and abuse and the use of protected health information. Implementing our expanded integrated kidney care strategies and value-based care initiatives at scale also increases certain execution and compliance risks associated with developing our operational, IT, billing and telehealth systems, including our ability to accurately capture relevant patient care data, among other things. \nFor additional details on risks associated with information systems and new technology generally, see the risk factor under the heading \n\"Failing to effectively maintain, operate or upgrade our information systems or those of third-party service providers upon which we rely...\"\nEmerging entrants are pursuing opportunities to participate in the CMMI payment models as well as broader risk arrangements with other payors, and with increasing investment and funding, these emerging entrants may adopt strategies that increase our costs to participate in these payment models and/or adversely impact our ability to enter into competitive arrangements with payors, physicians and hospitals. In addition, they may have the ability to operate without regard to regulations to which we comply. For additional detail on our evolving competitive environment, see the risk factor under the heading \n\"If we are unable to compete successfully...\" \nIf any of these or other of our integrated kidney care and value-based care initiatives are unsuccessful, it could result in a loss of our investments and have a material adverse effect on our growth strategy, could adversely impact our business, results of operations, financial condition and cash flows, and could materially harm our reputation.\nIn addition, future legislative or regulatory action related to, among other things, existing or future integrated kidney care initiatives, including among others, CMMI payment models, and/or full capitation demonstration\n for ESRD may impact our ability to provide a competitive and successful integrated care program at scale. There can be no assurances that any other legislation or regulation that aligns with our strategy and investments will be extended, passed into law or enacted. Additionally, the ultimate terms and conditions of any potential legislative or regulatory action impacting integrated kidney care, full capitation demonstrations or the existing CMMI payment models remain unclear. For example, the CKCC program is a 5-year demonstration that launched in 2022. CMMI continues to monitor the performance of these and other kidney care payment models, and there is no assurance that this program will be extended or modified in the future and, among other things, our costs of care could exceed our associated reimbursement rates under such legislation or regulation. Irrespective of whether such laws are passed or regulations enacted, there can be no assurances that we will be able to successfully execute on the required strategic initiatives that would allow us to maintain a competitive and successful integrated care program on a broad scale, and in the desired time frame. Any failure on our part to adequately implement strategic initiatives, including to adjust to any marketplace developments resulting from executive, legislative, regulatory or administrative changes, could have a material adverse impact on our business.\n34\nIf we are not able to successfully implement our strategy with respect to home-based dialysis, including maintaining our existing business and further developing our capabilities in a complex and highly regulated environment, it could have a material adverse effect on our business, results of operations, financial condition and cash flows, and could materially harm our reputation.\nOur home-based dialysis services, which include home hemodialysis and peritoneal dialysis (PD), represented approximately 19% of our U.S. dialysis patient service revenues for the year ended December 31, 2024, and have increasingly become an important part of our overall strategy. In addition, home-based dialysis recently has been the subject of increased legislative, regulatory, political and industry focus. For example, in connection with the 2019 Executive Order, HHS set out specific goals related to home dialysis and CMMI’s ESRD Treatment Choices (ETC) mandatory payment model and voluntary payment models included new incentives to encourage dialysis at home. CMS subsequently finalized changes to the ETC model and other regulations to encourage dialysis facilities and healthcare providers to seek to decrease disparities in health outcomes across racial and socioeconomic status in rates of home dialysis and kidney transplants among ESRD patients. CMS also regulates home dialysis under the ESRD Prospective Payment System (PPS) rule. Under this, CMS recently finalized a proposal to allow payment for acute kidney injury (AKI) renal dialysis services furnished to beneficiaries in their home and the agency will permit ESRD facilities to bill Medicare for the home and self-dialysis training add-on payment adjustment for beneficiaries with AKI. We are a leader in home-based dialysis and have made investments in processes and infrastructure to continue to grow this modality. There are, however, risks associated with this growth, including, among other things, financial, legal, regulatory and operational risks related to our ability to design and develop infrastructure and to plan for capacity in a modality that is part of an evolving marketplace. For example, there is a limited number of available suppliers for certain critical home-based dialysis supplies, including key products provided by a supplier that was impacted by a severe weather event in 2024. As described further in the risk factor under the heading, \"\nIf certain of our suppliers and service providers…\n,\" any disruptions involving such supplies could materially impact our operations and require significant resources or operational changes in response.\nWe may also be subject to associated risks related to our ability to successfully manage related operational initiatives, find, train and retain appropriate staff, contract with payors for appropriate reimbursement, and maintain processes to adhere to the complex regulatory and legal requirements, including without limitation those associated with billing Medicare. For additional detail on risks associated with operating in a highly regulated environment, see the risk factor under the heading \"\nOur business is subject to a complex set of governmental laws, regulations and other requirements...\"\n In addition to the above risks, certain risks inherent to home-based dialysis will increase as we expand our home-based dialysis offerings, including risks related to managing transitions between in-center and home-based dialysis, billing and telehealth systems, among others. For additional detail on risks associated with information systems and new technology generally, see the risk factor under the heading \"\nFailing to effectively maintain, operate or upgrade our information systems or those of third-party service providers upon which we rely..\n.\"\nAn increased focus on home-based dialysis is also indicative of the generally evolving market for kidney care. This developing market may create additional opportunities for competition with relative ease of entry, and if we are unable to successfully adapt to these or other marketplace developments, which, among other things, may include regulatory changes with respect to conditions of coverage, in a timely and compliant manner, we may experience a material adverse impact on our growth in home-based dialysis or a reduction in our overall number of patients, among other things. For additional detail on the competitive landscape in kidney care, see the risk factor under the heading \n\"If we are unable to compete successfully...\"\n If we are not able to successfully implement our strategy with respect to home-based dialysis, including maintaining our existing business and further developing our capabilities in a complex and highly regulated environment, it could have a material adverse effect on our business, results of operations, financial condition and cash flows, and could materially harm our reputation.\nChanges in the structure of and payment rates under the Medicare ESRD or Medicare Advantage programs or changes in state Medicaid or other non-Medicare government-based programs or payment rates could have a material adverse effect on our business, results of operations, financial condition and cash flows. \nA substantial portion of our dialysis revenues are generated from patients who have Medicare or MA as their primary payor. For patients with Medicare coverage, payments for dialysis treatments are currently made under a single bundled payment rate which provides a fixed payment rate to encompass all goods and services provided during the dialysis treatment that are related to the treatment of dialysis, subject to certain adjustments. Most lab services are also included in the bundled payment. \nUnder the ESRD PPS, bundled payments to a dialysis facility may be reduced by as much as 2% based on the facility's performance in specified quality measures set annually by CMS through the ESRD Quality Incentive Program, which was established by the Medicare Improvements for Patients and Providers Act of 2008. The bundled payment rate is also adjusted \n35\nfor certain patient characteristics, a geographic usage index, a wage index and certain other factors. In addition, the ESRD PPS is subject to rebasing, which can have a positive financial effect, or a negative one if the government fails to rebase in a manner that adequately addresses the costs borne by dialysis facilities. Similarly, as new drugs, services or labs are added to the ESRD bundle, CMS' failure to adequately calculate or fund the costs associated with the drugs, services or labs could have a material adverse effect on our business, results of operations, financial condition and cash flows. In certain instances, new injectable, intravenous or oral products may be reimbursed separately from the bundled payment for a defined period of time through a transitional drug add-on payment adjustment (TDAPA). For a discussion of certain risks associated with this transitional pricing process, see the risk factor under the heading, \"\nChanges in clinical practices, payment rates or regulations impacting pharmaceuticals and/or devices...\"\nThe current bundled payment system presents certain operating, clinical and financial risks, which include, without limitation:\n•\nRisk that our reimbursement rates are reduced by CMS or are otherwise inadequate. CMS publishes a final rule for the ESRD PPS each year and uncertainty about future payment rates remains a material risk to our business.\n•\nRisk that CMS, on its own or through its contracted Medicare Administrative Contractors (MACs) or otherwise, implements Local Coverage Determinations (LCDs) or implements payment provisions, policy or regulatory mandates, including changes to the existing or future PPS, that limit our ability to either be paid for covered dialysis services or bill for treatments or other drugs and services or other rules that may impact reimbursement. Such payment rules and regulations and coverage determinations or related decisions could have an adverse impact on our operations and revenue. There is also risk that commercial insurers could seek to incorporate the requirements or limitations associated with such LCDs or CMS guidance into their contracted terms with dialysis providers, which could have an adverse impact on our revenue. \n•\nRisk that a MAC, or multiple MACs, change their interpretations of existing regulations, manual provisions and/or guidance, or seek to implement or enforce new interpretations that are inconsistent with how we have interpreted existing regulations, manual provisions and/or guidance.\n•\nRisk that CMS implements data and related reporting requirements that result in decreased reimbursement and/or increased technology and operational costs and/or creates brand risk.\n•\nRisk that increases in our operating costs will outpace the Medicare rate increases we receive. We expect operating costs to continue to increase due to inflationary factors, such as increases in labor and supply costs, including, without limitation, increases in maintenance costs and capital expenditures to improve, renovate and maintain our facilities, equipment and information technology to meet changing regulatory requirements and business needs, regardless of whether there is a compensating inflation-based increase in Medicare payment rates or in payments under the bundled payment rate system. \n•\nRisk of continued federal budget sequestration cuts or other disruptions in federal government operations and funding. As a result of the Budget Control Act of 2011, the Bipartisan Budget Act (BBA) and subsequent legislation, an annual reduction (currently 2%) to Medicare payments took effect on April 1, 2013, and has been extended into 2032. These across-the-board spending cuts have affected and will continue to adversely affect our business, results of operations, financial condition and cash flows. Any extended disruption in federal government operations and funding, including an extended government shutdown, U.S. government debt default and/or failure of the U.S. government to enact annual appropriations could have a material adverse effect on our business, results of operations, financial condition and cash flows. Additionally, disruptions in federal government operations may delay or negatively impact regulatory approvals and guidance that are important to our operations, and create uncertainty about the pace of upcoming regulatory developments.\n•\nRisk that failure to adequately develop and maintain our clinical or other operational systems or failure of our clinical or operational systems to operate effectively could have a material adverse effect on our business, results of operations, financial condition and cash flows. For example, in connection with claims for which at least part of the government's payments to us is based on clinical performance or patient outcomes or co-morbidities, if our clinical systems fail to accurately capture the data we report to CMS or we otherwise have data integrity issues with respect to the reported information, we might be over-reimbursed by the government, which could, among other things, subject us to liability exclusion from participation in federal healthcare programs and penalties under the federal Civil Monetary Penalty statute, and could adversely impact our reputation. \n36\nAs described above, we also contract with commercial payors that administer MA plans to provide their members with Medicare Part A, Part B and/or Part D benefits. Our MA business presents similar operating, clinical and financial risks as those related to the bundled payment system, which include, without limitation: \n•\nRisk that reimbursement rates for the MA program are reduced by CMS or are otherwise inadequate and that payors, therefore, reduce our rates and/or fund us less for services rendered. CMS publishes a final rule for MA program rates each year and uncertainty about future payment rates remains a material risk to our business, particularly as our MA enrollment increases. \n•\nRisk of ensuring that we remain compliant with applicable MA requirements, inclusive of MA marketing and education requirements and restrictions, as well as our contractual terms with associated plans, as our initiatives associated with MA (including chronic condition special needs and dual eligible special needs plans) continue to evolve and progress. Failure to do so could resolve in termination of agreements with plans as well as enforcement by state and federal agencies for violation of insurance, consumer protection and fraud and abuse laws and regulations.\nIn addition to the above risks under the current Medicare ESRD and MA programs, changing legislation and other regulatory and executive developments have led and may continue to lead to the emergence of new models of care and other initiatives in both the government and private sector that, among other things, may impact the structure of, and payment rates under, the Medicare ESRD and MA programs. Moreover, the number of our patients with primary Medicare coverage may be subject to change, particularly with the effectiveness of the Cures Act, which allows Medicare-eligible individuals with ESRD to enroll in MA managed care plans. For additional details regarding the risks we face for failing to adhere to our Medicare, MA and Medicaid regulatory compliance obligations or failing to adequately implement strategic initiatives to adjust to marketplace developments, see the risk factors above under the headings \"\nOur business is subject to a complex set of governmental laws, regulations and other requirements...;\" \nand\n \"Changes in federal and state legislation or regulations...\" \nFinally, increased political pressures to reduce government spending, including potential cuts to Medicare funding, may create additional risks to payment rates and the structure of the Medicare ESRD and MA programs. For additional information on the impact of potential reduced government spending, see the risk factor under the heading \n\"External conditions, including those related to general economic, marketplace and global health conditions...\"\nPrimary coverage for a significant number of our patients also comes from state Medicaid programs partially funded by the federal government and we have patients covered by other non-Medicare government-based programs, such as coverage through the Department of Veterans Affairs (VA). As state governments and other governmental organizations face increasing financial hardship and budgetary pressure, including as a result of the COVID-19 pandemic or changes in the political environment, we may in turn face reductions in payment rates, delays in the receipt of payments, limitations on enrollee eligibility or other changes to the applicable programs. For example, certain state Medicaid programs and the VA have recently considered, proposed or implemented payment rate reductions, such as the VA's proposed adoption of Medicare's bundled PPS pricing methodology for any veterans receiving treatment from non-VA providers under a national contracting initiative. Since we are a non-VA provider, these reimbursements are tied to a percentage of Medicare reimbursement, and we have exposure to any dialysis reimbursement changes made by CMS. In addition, in 2019 and subsequently renewed, we entered into a Nationwide Dialysis Services contract with the VA that includes five separate one-year renewal periods throughout the term of the contract. The term structure is similar to our prior five-year agreement with the VA, and is consistent with VA practice for similar provider agreements. With this contract award, the VA has agreed to keep our percentage of Medicare reimbursement consistent with that under our prior agreement with the VA during the term of the contract. As with that prior agreement, this agreement provides the VA with the right to terminate the agreements without cause on short notice, among other things. The current contract expires at the end of September 2025. Should the VA renegotiate, not renew or cancel these agreements for any reason, we may cease accepting patients under this program and may be forced to close centers or experience lower reimbursement rates, which could have a material adverse effect on our business, results of operations, financial condition and cash flows.\nState Medicaid programs are increasingly adopting Medicare-like bundled payment systems, but sometimes these payment systems are poorly defined and are implemented without any claims processing infrastructure, or patient or facility adjusters. If these payment systems are implemented without any adjusters and claims processing infrastructure, Medicaid payments will be substantially reduced and the costs to submit such claims may increase, which will have a negative impact on our business, results of operations, financial condition and cash flows. In addition, some state Medicaid program eligibility requirements mandate that citizen enrollees in such programs provide documented proof of citizenship. If our patients cannot meet these proof of citizenship documentation requirements, they may be denied coverage under these programs, resulting in decreased patient volumes and revenue. These Medicaid payment and enrollment changes, along with similar changes to other non-Medicare government programs, could reduce the rates paid by these programs for dialysis and related services, delay the \n37\nreceipt of payment for services provided and further limit eligibility for coverage which could have a material adverse effect on our business, results of operations, financial condition and cash flows.\nOur business is labor intensive and if our labor costs continue to rise, including due to shortages, changes in certification requirements and/or higher than normal turnover rates in skilled clinical personnel; or currently pending or future governmental laws, rules, regulations or initiatives impose additional requirements or limitations on our operations or profitability; or, if we are unable to attract and retain employees or key leadership positions; or if union organizing activities or legislative or other changes result in significant increases in our operating costs or decreases in productivity, we may experience disruptions in our business operations and increases in operating expenses, among other things, any of which could have a material adverse effect on our business, results of operations, financial condition, cash flows and reputation.\nWe face increasing labor costs generally, and in particular, we continue to face increased labor costs and difficulties in hiring skilled clinical personnel, including nurses, due to a nationwide shortage of such personnel that has been exacerbated by current macroeconomic conditions and developments in the labor market. As referenced above, the current labor market is challenging and continues to experience volatility, uncertainty and labor supply shortages, particularly in healthcare. Our business is labor intensive, and our financial and operating results have been and continue to be sensitive to variations in labor-related costs, productivity and the number of pending or potential claims against us related to labor and employment practices. We have incurred and expect to continue to incur increased labor costs, including through elevated compensation levels to our teammates, the ultimate extent of which will depend on current macroeconomic conditions and ancillary impacts on the labor market, among other things. For additional discussion of the risks facing us related to the current labor environment, see the risk factor under the heading \n\"External conditions, including those related to general economic, marketplace and global health conditions...\" \nAdditionally, to the extent that general inflationary pressures continue or further increase, this may in turn increase our labor and supply costs at a rate that outpaces the Medicare or any other rate increases we may receive. \nWe compete for nurses with hospitals and other healthcare providers. The ongoing nursing shortage may limit our ability to expand our operations. Furthermore, changes in certification requirements can impact our ability to maintain sufficient staff levels, including to the extent our teammates are not able to meet new requirements, among other things. In addition, if we experience a higher than normal turnover rate for our skilled clinical personnel, our operations and treatment growth may be negatively impacted, which could adversely affect our business, results of operations, financial condition and cash flows. For example, in 2024, we again had significant teammate turnover, particularly amongst teammates in their first year, which led to increased training costs, among other things. \nWe also face competition in attracting and retaining talent for key leadership positions that are responsible for developing and executing the Company's business strategy and operational initiatives. Increased competition for top leadership talent in our industry and general marketplace conditions, including recent negative publicity and events surrounding the healthcare industry, could also impact our ability to attract and retain qualified leaders. If we are unable to attract and retain qualified individuals, including with respect to our leadership team, we may experience disruptions in our business operations, including, without limitation, our ability to achieve strategic goals, which could have a material adverse effect on our business, results of operations, financial condition, cash flows and reputation.\nPolitical or other efforts at the national or local level could result in actions or proposals that increase the likelihood of success of union organizing activities at our facilities and ongoing union organizing activities at our facilities could continue or increase for other reasons. Our industry has also experienced increased union organizing activities. For example, union petitions have been filed in nine of our clinics in California and eight of these petitions are in different stages of the voting process and have been subject to legal challenges. We also have experienced a week-long attempted union-related work stoppage in these eight clinics, which concluded without impacting our ability to provide patient care. Regardless of the outcome of the ongoing elections, other teammates at other clinics may file similar petitions in the future, and these petitions, if filed, may lead to additional elections. If a significant portion of our teammates were to become unionized, we could experience, among other things, potential additional work stoppages or other business disruptions; adverse impacts to our financial results due to the costs of bargaining or implementing a grievance procedure and processing grievances; decreases in our operational flexibility and efficiency; or negative impacts on our employee culture. In addition, we are and may continue to be subject to targeted corporate campaigns by union organizers in response to which we have been and expect to continue to be required to expend substantial resources, both time and financial. Any of these events or circumstances, including our responses to such events or circumstances, could have a material adverse effect on our employee relations, treatment growth, productivity, business, results of operations, financial condition, cash flows and reputation.\n38\nPrivacy and information security laws are complex, and if we fail to comply with applicable laws, regulations and standards, including with respect to third-party service providers that utilize sensitive personal information on our behalf, or if we fail to properly maintain the integrity of our data, protect our proprietary rights to our systems or defend against cybersecurity attacks, we may be subject to government or private actions due to privacy and security breaches or suffer losses to our data and information technology assets, any of which could have a material adverse effect on our business, results of operations, financial condition and cash flows or materially harm our reputation.\nWe must comply with numerous federal and state laws and regulations in both the U.S. and the foreign jurisdictions in which we operate governing the collection, dissemination, access, use, security and privacy of PHI. In the U.S., these regulations include, without limitation, HIPAA and its implementing privacy, security, and related regulations, as amended by the federal Health Information Technology for Economic and Clinical Health Act (HITECH) and collectively referred to as HIPAA. We are also required to report known breaches of PHI and other certain personal information consistent with applicable breach reporting requirements set forth in applicable laws and regulations. From time to time, we may be subject to both federal and state inquiries or audits related to HIPAA, HITECH and other state privacy laws associated with complaints, desk audits, and data breaches. Requirements under HIPAA also continue to evolve. Globally, these regulations include, but are not limited to, European Union (EU) General Data Protection Regulation (GDPR), the United Kingdom GDPR, the EU Artificial Intelligence Act, the EU Data Act and the EU Health Data Space Regulation. If we fail to comply with applicable privacy and security laws, regulations and standards, including with respect to third-party service providers that utilize sensitive personal information, including PHI, or financial information or payroll data on our behalf or with respect to the use of certain third-party digital advertising technologies, or if we fail to properly maintain the integrity of our data, protect our proprietary rights, or defend against cybersecurity attacks, it could materially harm our reputation and/or have a material adverse effect on our business, results of operations, financial condition and cash flows. These risks may be intensified to the extent that the laws change or to the extent that we increase our use of third-party service providers that utilize sensitive personal information, including PHI, on our behalf.\nData protection laws are evolving globally, and may continue to add additional compliance costs and legal risks to our international operations. For more details on certain international data protection laws and regulations affecting our business, see Part I Item 1. \"\nBusiness\n\" under the heading \n\"Government Regulation.\"\n The costs of compliance with, and other burdens imposed by these international data protection laws and regulations and other new laws, regulations and policies implementing these regulations may impact our international operations and may limit the ways in which we can provide services and operate, use or otherwise process personal data collected while providing services.\nPrivacy and data protection laws and regulations are also evolving nationally and in the states. At the federal level, this includes proposed updates to the HIPAA Security Rule, which, if enacted as proposed, could impose potentially significant compliance training costs on our operations. At the state level, legislatures around the country continue to enact state privacy laws that are broader than the current federal privacy laws, which may add additional compliance costs and legal risks to our U.S. operations. The costs of compliance with, and the burdens imposed by, these and other new federal and state laws, regulations or policies may impact our operations and/or limit the ways in which we can provide services or use personal data collected while providing services. If we fail to comply with the requirements of these and other new laws, regulations or policies, we could be subject to damage awards in private litigation or penalties that, in some cases, would have a material adverse impact on our business, results of operations, financial condition and cash flows. For more details on the privacy and other regulations affecting our business, see Part I Item 1. \"\nBusiness\n\" under the heading \"\nGovernment Regulation.\n\"\n \nIn addition, laws governing the commercialization and use of artificial intelligence and machine learning technologies are evolving and as the regulation of these technologies matures, it may add additional compliance costs and legal risk to our operations. Scrutiny over cybersecurity standards in the health sector is also increasing, and ongoing developments in this area may cause us to invest additional resources in technology, personnel and programmatic cybersecurity controls as the cybersecurity risks we face continue to evolve.\nInformation security risks have significantly increased in recent years in part because of the proliferation of new technologies, the increasing use of the Internet and telecommunications technologies to conduct our operations, and the increased sophistication and activities of organized crime, hackers, terrorists and other external parties, including, among others, foreign state agents. Our business and operations rely on the secure and continuous processing, transmission and storage of confidential, proprietary and other information in our computer systems and networks, including sensitive personal information, such as PHI, social security numbers, and/or credit card information of our patients, teammates, physicians, business partners and others. Our business and operations also rely on certain critical IT vendors that support such processing, transmission and storage (which have become more relevant and important given the information security issues and risks that are intensified through remote work arrangements). For example, as previously reported, due to a cybersecurity breach that affected Change Healthcare (CHC), a subsidiary of UnitedHealth Group (United) that serves as an intermediary for processing the vast majority of our payment claims for domestic commercial and government payors, we temporarily suspended all claims processing activity with CHC (CHC Outage), primarily during a period of time during the first and second quarters of 2024, \n39\nwhich impacted our cash flows. We have since resumed claims submissions and billing processes through CHC’s information technology systems and as of the date of this filing, through a combination of CHC's platform and certain alternate billing processes, we are current on our primary claims submissions. However, the CHC Outage, and the resultant delay in claims submissions, led to a decrease in our collections and an increase in our days sales outstanding, among other things, which increase has since subsided, but we do continue to see delays in, and issues with, collections with some payors. CHC has publicly reported online and in notices to affected individuals that it identified protected health information (PHI), or personally identifiable information (PII), from users of the CHC systems, and CHC has been conducting investigations and data forensics. CHC informed the Company that a small number of patients had certain PHI exposed as a result of this breach and CHC is taking responsibility for notifying these patients. The ultimate impact of the CHC Outage remains subject to future developments and risks that are difficult to predict. These risks may include, among other things, a recurrence of system outages or service suspensions or the risk that our information technology systems or our proprietary information and sensitive or confidential data, including PHI or PII, may have been compromised through the CHC Outage, any of which may have a material adverse effect on our business, results of operations, financial condition, cash flows and reputation.\nWe regularly review, monitor and implement multiple layers of security measures through technology, processes and our people. We utilize security technologies designed to protect and maintain the integrity of our information systems and data, and our defenses are monitored and routinely tested internally and by external parties. Despite these efforts, our facilities and systems and those of our third-party service providers may be vulnerable to privacy and security incidents; security attacks and breaches; acts of vandalism or theft; computer viruses and other malicious code; coordinated attacks by a variety of actors, including, among others, activist entities or state sponsored cyberattacks; emerging cybersecurity risks; cyber risk related to connected devices; misplaced or lost data; programming and/or human errors; or other similar events that could impact the security, reliability and availability of our systems and the availability, authenticity, integrity and/or confidentiality of personal information stored on those systems. Internal or external parties have attempted to, and will continue to attempt to, circumvent our security systems, and we have in the past, and expect that we will in the future, defend against, experience, and respond to attacks on our network including, without limitation, reconnaissance probes, denial of service attempts, malicious software attacks including ransomware or other attacks intended to render our internal operating systems or data unavailable, and phishing attacks or business email compromise. Cybersecurity requires ongoing investment and diligence against evolving threats. For example, healthcare companies, including our Company and certain of our third-party service providers, strategic partners, consultants or contractors, are increasingly incorporating self-learning or \"artificial intelligence\" features into information technology capabilities. The use of this rapidly evolving technology may intensify the cybersecurity and reputational risks we face given its novel and untested nature, particularly to the extent such technology involves the use of PHI or PII. Emerging and advanced security threats, including, without limitation, coordinated attacks, require additional layers of security which may disrupt or impact efficiency of operations. As with any security program, there always exists the risk that employees will violate our policies despite our compliance efforts or that certain attacks may be beyond the ability of our security and other systems to detect. There can be no assurance that investments, diligence and/or our internal controls will be sufficient to prevent or timely discover an attack.\nAny security breach involving the misappropriation, loss or other unauthorized disclosure or use of confidential information, including, among others, PHI, financial data, competitively sensitive information, or other proprietary data, whether by us or a third party, could have a material adverse effect on our business, results of operations, financial condition, and cash flows and materially harm our reputation. We may be required to expend significant additional resources to modify our protective measures, to investigate and remediate vulnerabilities or other exposures, or to make required notifications. The occurrence of any of these events could, among other things, result in interruptions, delays, the loss or corruption of data, cessations in the availability of systems and liability under privacy and security laws, all of which could have a material adverse effect on our business, results of operations, financial condition and cash flows, or materially harm our reputation and trigger regulatory actions and private party litigation. If we are unable to protect the physical and electronic security and privacy of our databases and transactions, we could be subject to potential liability and regulatory action, our reputation and relationships with our patients, physicians, vendors and other business partners would be harmed, and our business, results of operations, financial condition and cash flows could be materially and adversely affected. Failure to adequately protect and maintain the integrity of our information systems (including our networks) and data, or to defend against cybersecurity attacks, could subject us to monetary fines, civil suits, civil penalties or criminal sanctions and requirements to disclose the breach publicly, could subject our legal representatives or senior management to liability and/or a temporary suspension during which they cannot exercise managerial duties, and could further result in a material adverse effect on our business, results of operations, financial condition and cash flows or harm our reputation. As malicious cyber activity escalates, including activity that originates outside of the U.S., and as we continue with certain remote work arrangements and a broadened technology footprint, the risks we face relating to transmission of data and our use of service providers outside of our network, as well as the storing or processing of data within our network, have intensified. There have been increased international, federal and state and other privacy, data protection and security enforcement efforts and we expect this trend to continue. While we plan to maintain cyber liability insurance, there can be no assurance that we will successfully be able to obtain such insurance on terms and conditions that are \n40\nfavorable to us or at all. Additionally, any cyber liability insurance may not cover us for all types of losses or harms and may not be sufficient to protect us against the amount of all losses.\nFor additional information about our assessment of our cybersecurity risks, see discussion in Part I Item 1C. \"\nCybersecurity\n.\"\nIf certain of our suppliers and service providers do not meet our needs, if there are material price increases on supplies, if we are not reimbursed or adequately reimbursed for drugs we purchase or if we are unable to effectively access new technology or superior products, it could negatively impact our ability to effectively provide the services we offer and could have a material adverse effect on our business, results of operations, financial condition and cash flows and could materially harm our reputation. We are also subject to the risk associated with our increased reliance on third party service providers.\nWe have significant suppliers and service providers, with a substantial portion of our total vendor spend concentrated with a limited number of third party suppliers and service providers. These third party suppliers and service providers include, without limitation, service providers performing certain key functions for us such as claims processing, financial accounting, and information technology functions, and suppliers of pharmaceuticals or clinical products that may be the primary source of products critical to the services we provide, or to which we have committed obligations to make purchases, sometimes at particular prices. \nWe rely on these third-party suppliers and service providers to provide the products or services we require, and this reliance subjects us to risks arising from the loss of control over these services, changes in pricing that may affect our operating results, and potentially, termination of provisions of these services by our providers. There can be no assurance that third party suppliers and service providers will provide, or will continue to provide, the services or products that we require, or that substitute services or products, or alternate suppliers or service providers, can be identified or transitioned to on a timely or cost-effective basis or at all. In certain cases, there may be a limited number of viable alternate suppliers or service providers that have the capacity or capability to offer these supplies or services. \nIf our significant suppliers and service providers do not meet our needs for the products and services they supply, including, without limitation, in the event of supply chain disruptions due to global events, geopolitical instability, trade disputes, natural disasters or severe weather events, product recalls, logistical challenges, fluctuations in foreign currency exchange rates, varying regulatory requirements or other shortages or disputes, and we are not able to find adequate alternative sources for these products or services on a timely or cost-effective basis; if we experience material price increases from these suppliers or otherwise in connection with our actions to secure needed products that we are unable to mitigate; if some of the drugs that we purchase from our suppliers are not reimbursed or not adequately reimbursed by commercial or government payors; or if we are unable to secure products, including pharmaceuticals at competitive rates and within the desired time frame; it could require us to make significant operational changes, could negatively impact our ability to effectively provide the services we offer or negatively impact our ability to effectively execute certain important corporate functions, and could otherwise have a material adverse impact on our business, results of operations, financial condition and cash flows and materially harm our reputation. In addition, the technology related to the products critical to the services we provide is subject to new developments that may result in superior products, and if we are unable to incorporate these superior products into our business or otherwise find adequate alternatives on a cost-effective and timely basis, it could impact our ability to compete effectively.\nWe have experienced service disruptions relating to key business functions and supply chain shortages with respect to certain of our equipment and clinical supplies, including critical clinical and other supplies. \nFor example,\n in September 2024, \none of our suppliers notified us that a severe weather event caused extensive damage to its manufacturing plant. The damage required the supplier to close the facility and halt production of certain clinical products it supplies to us and other health care providers, including saline and peritoneal dialysate. As a result of this disruption, we worked with the supplier, other suppliers, and federal and state governmental agencies to identify alternate sources for these supplies and implemented certain operational measures that were developed to maintain continuity of care for our patients. \nThese operational measures, including securing alternate supply and temporarily holding new starts for PD home-based dialysis resulted in increased expense and slowed growth of our home-based dialysis business in 2024 and the early portion of 2025. In general, while we have made certain operational changes in response to the foregoing, there can be no assurance that a future shortage or disruption would not require additional resources or further operational changes in the future and \nwe are continuing to assess the balance of efficiency and resilience in evaluating the risk of future supply chain shortages or service disruptions\n. Separately, current macroeconomic conditions also have resulted in global supply chain challenges and have materially impacted global supply chain reliability, as described in the risk factor under the heading \n\"External conditions, including those related to general economic, marketplace and global health conditions...\"\n41\nChanges in clinical practices, payment rates or regulations impacting pharmaceuticals and/or devices could have a material adverse effect on our business, results of operations, financial condition, and cash flows and negatively impact our ability to care for patients.\nMedicare bundles certain pharmaceuticals into the ESRD PPS payment rate at industry average doses and prices. Variations above the industry average may be subject to partial reimbursement through the PPS outlier reimbursement policy.\n \nChanges to industry averages, which can be caused by, among other things, changes in physician prescribing practices, including in response to the introduction of new drugs, treatments or technologies, changes in best and/or accepted clinical practice, changes on the reliance of artificial intelligence to support clinical practices, changes in private or governmental payment criteria regarding pharmaceuticals and/or devices, or the introduction of administration policies may negatively impact our ability to obtain sufficient reimbursement levels for the care we provide, which could have a material adverse effect on our business, results of operations, financial condition and cash flows. Physician practice patterns, including their independent determinations as to appropriate pharmaceuticals and dosing, are subject to change, including, for example, as a result of changes in labeling of pharmaceuticals or the introduction of new pharmaceuticals. Additionally, commercial payors have increasingly examined their administration policies for pharmaceuticals and, in some cases, have modified those policies. If such policy and practice trends or other changes to private and governmental payment criteria make it more difficult to preserve our margins per treatment, it could have a material adverse effect on our business, results of operations, financial condition and cash flows. Further, increased utilization of certain pharmaceuticals whose costs are included in a bundled reimbursement rate, or decreases in reimbursement for pharmaceuticals whose costs are not included in a bundled reimbursement rate, could also have a material adverse effect on our business, results of operation, financial condition and cash flows.\nRegulations and processes impacting reimbursement for pharmaceuticals and/or devices and any changes thereto could similarly affect our operating results. Among other things, as new kidney care drugs, treatments or technologies are introduced over time, we expect that the use of transitional payment adjustments to incorporate certain of these new drugs, treatments or technologies as defined by the CMS policy into the bundled Medicare Part B ESRD payment may lead to fluctuations in associated levels of operating income and risk that the reimbursement levels of such drugs, treatments or technologies may not adequately cover our cost to obtain the drug or other associated costs. Drivers of these risks include, among other things, the risk that CMS may not provide adequate funding in the Medicare Part B ESRD payment in the transitional or post-transitional period or such items are not covered by transitional add on pricing, in which case there may be less clarity on the reimbursement, either of which may in turn materially adversely impact our business, results of operations, financial condition and cash flows. For example, under current CMS regulation, certain oral-only drugs were paid separately under Medicare Part D until January 1, 2025, at which time they were incorporated in the ESRD bundled payment. In recent rulemaking, CMS has finalized a policy to increase TDAPA amounts for oral phosphate binders, based on 100% of Average Sales Price, increased by a fixed amount of $36.41 for certain incremental costs. We cannot predict, at this time, whether CMS' TDAPA amounts for oral phosphate binders will adequately account for the inclusion of these oral medications and the additional costs associated with dialysis providers having to supply such drugs. We have developed operational and clinical processes designed to provide the drug as may be required under the applicable regulations and as may be prescribed by physicians and have also worked to contract with manufacturers of drug(s) to establish terms and access to the product, as well as payors, as applicable, for reimbursement and/or administration of the drug. If the government or other payors implement other new requirements or protocols for patients to receive the drug and include pricing in the bundle, we could experience significant fluctuations in our associated levels of operating income and could be subject to material financial, operational and/or legal risk if we are not adequately reimbursed for the cost of the drug, if we are unable to implement effective and appropriate operational measures to distribute or bill for the drug, if we fail to implement appropriate storage and diversion controls or if we cannot obtain competitive pricing for the drug. The aggregate impact of these risks could have a material adverse effect on our business, results of operation, financial condition and cash flows. \nSimilar operating and clinical rigor and appropriate processes will be needed for other potential new drugs, treatments or technologies that are approved and come onto the market, as well as for drugs, treatments or technologies that we contract to receive from different suppliers. Any failure to successfully contract with manufacturers for competitive pricing, failure to successfully contract with the government or other payors for appropriate reimbursement, or failure to prepare, develop and implement processes that provide for appropriate availability and use in our clinics in compliance with applicable laws, including those related to controlled substances, could have a material adverse impact on our business, results of operations, financial condition and cash flows. \nWe may also be subject to increased inquiries or audits from a variety of governmental bodies or claims by third parties related to pharmaceuticals, which would require management's attention and could result in significant legal expense. Any negative findings could result in, among other things, substantial financial penalties or repayment obligations, the imposition of certain obligations on and changes to our practices and procedures as well as the attendant financial burden on us to comply with the obligations, or exclusion from future participation in the Medicare and Medicaid programs, and could have a material adverse effect on our business, results of operations, financial condition, cash flows and reputation. For additional details, see \n42\nthe risk factor under the heading \n\"Our business is subject to a complex set of governmental laws, regulations and other requirements...\"\nIf we are unable to compete successfully, including, without limitation, implementing our growth strategy and/or retaining patients and developing and maintaining relationships with physicians and hospitals, it could materially adversely affect our business, results of operations, financial condition and cash flows.\nWe operate in a highly competitive and continuously evolving environment across the spectrum of kidney care, and operating in this market requires us to successfully execute on strategic initiatives which, among other things, build or retain our patient population through acquisition or referrals, or that develop and maintain our relationships with physicians and hospitals in both the dialysis and pre-dialysis space. \nCompetition for relationships with certain referral sources, including nephrologists and hospitals, in existing and expanding geographies or areas is intense, and we continue to face intense competition from large and medium-sized providers, among others, which compete directly with us for physicians qualified to serve as medical directors, for limited acquisition targets and for individual patients. In addition to these large and medium-sized competitors with substantial financial resources and other established participants in the dialysis space, we also compete with individual nephrologists who have opened their own dialysis units or facilities. Our largest competitor, Fresenius Medical Care (FMC), manufactures a full line of dialysis supplies and equipment in addition to owning and operating dialysis centers. This may, among other things, give FMC cost advantages over us because of its ability to manufacture its own products. \nWe continuously compete for maintaining or developing relationships with physicians that can serve as medical directors at our centers. Physicians, including medical directors, choose where they refer their patients, and neither of our current or former medical directors have an obligation to refer their patients to our centers. Certain physicians prefer to have their patients treated at dialysis centers where they or other members of their practice supervise the overall care provided as medical director of the center. As a result, referral sources for many of our centers include the physician or physician group providing medical director services to the center. Moreover, because Medicare regulations require medical directors for each of our Medicare certified dialysis centers, our ability to operate our centers depends in part on our ability to secure medical director agreements with a sufficient number of nephrologists. Our medical director agreements range in duration, but generally are for periods of ten years, and at any given time a large number of them could be up for renewal at the same time. Medical directors have no obligation to extend their agreements with us and, under certain circumstances, our former medical directors may choose to provide medical director services for competing providers or establish their own dialysis centers in competition with ours. If we are unable to contract with nephrologists to provide medical director services, then we may be unable to satisfy the federal Medicare requirements associated with medical directors and to operate our centers. The aging of the nephrologist population and opportunities presented by our competitors or other hospitals and other healthcare providers may negatively impact a medical director's decision to enter into or extend his or her agreement with us and potential declines in the overall number of nephrologists may negatively impact our ability to enter into medical director agreements in the future. In addition, if the terms of any existing agreement are found to violate applicable laws, there can be no assurances that we would be successful in restructuring the relationship, which would lead to the early termination of the agreement. If we are unable to obtain qualified medical directors to provide supervision of the operations and care provided at our dialysis centers, it could affect not only our ability to operate the center but also the degree to which other physicians to feel confident in referring patients to our dialysis centers. If a significant number of physicians were to cease referring patients to our dialysis centers, whether due to law, rule or regulation, new competition, a perceived decrease in the quality of service levels at our centers or other reasons, it would have a material adverse effect on our business, results of operations, financial condition and cash flows.\nIn addition, as we continue to expand our offerings across the kidney care continuum, our ability to enter into and maintain integrated kidney care relationships with payors, physicians and other providers may have an impact on our ability to participate in integrated kidney care. This environment is highly competitive and has been evolving. For example, there have been a number of announcements, initiatives and capital raises by non-traditional kidney care providers and others, which relate to entry into the dialysis and pre-dialysis space, the development of innovative technologies, or the commencement of new business activities that could be transformative to the industry. Some of these emerging entrants have considerable financial resources. Although these and other potential competitors may face operational or financial challenges, the evolving nature of the dialysis and pre-dialysis marketplaces have presented some opportunities for relative ease of entry for these and other potential competitors. As a result, we may compete with these smaller or non-traditional providers or others in an asymmetrical environment with respect to data and regulatory requirements that we face as an ESRD service provider, thereby negatively impacting our ability to effectively compete. These and other factors have continued to drive change in the dialysis and pre-dialysis space, and if we are unable to successfully adapt to these dynamics, it could have a material adverse impact on our business, results of operations, financial condition and cash flows. As an example, emerging entrants are pursuing opportunities to participate in the CMMI payment models or otherwise establish value-based care programs, and increasing investment in and availability of funding to emerging entrants in the dialysis and pre-dialysis marketplace that may not be as cautious in adhering \n43\nto applicable laws and regulations and/or may not be subject to the same regulatory restrictions as the Company, could adversely impact our ability to enter into competitive arrangements. \nEach of the aforementioned competitive pressures and related risks may be impacted by a continued decline in the rate of growth of the ESRD patient population, higher mortality rates for dialysis patients or other reductions in demand for dialysis treatments, whether due to population growth trends, the development and application of innovative technologies or otherwise. As described in Part I Item 1. \"\nBusiness\n,\" the recent 2024 annual data report from the United States Renal Data System (USRDS) the decline in annual growth rate of ESKD dialysis patient population was 0.4% from 2021 to 2022, representing a slowdown from longer term growth. Despite this near term slowdown presented in the report, which, among other things, included impacts from the COVID-19 pandemic on mortality rates amongst the ESKD dialysis patient population, the rate of growth has been relatively consistent over time.\nA number of factors may impact ESKD growth rates, including, among others, mortality rates for dialysis patients or CKD patients, the growth and aging of the U.S. population, limitation on immigration into the United States, transplant rates, incidence rates for diseases that cause kidney failure such as diabetes and hypertension, growth rates of minority populations with higher than average incidence rates of ESKD or other changes in demand for dialysis treatments over time, including for example, as a result of the development and application of certain innovative technologies, drugs or other treatments such as the glucagon-like peptide 1 (GLP-1) receptor agonist, SGLT2 inhibitors, and other classes of drugs or new classes of drugs or other treatments that may, among other things, slow the progression of CKD. Any decrease in growth rates for the ESRD patient population, higher mortality rates for dialysis patients, increase in the availability to kidneys or replacement kidneys for transplant, or other reductions in demand for dialysis treatments, if sustained or significant, could have a material adverse effect on our business, results of operations, financial condition and cash flows. Any such impact would be magnified to the extent it also resulted in a lower number of patients with commercial insurance or a lower percentage of patients under commercial insurance relative to government-based programs. While we have continued efforts to seek growth opportunities, such as by expanding our business into various international markets, we face ongoing competition from large and medium-sized providers, among others, for acquisition targets in those markets. Providers may reduce pricing in an attempt to capture more volume in the face of declining ESRD patient growth. Any failure on our part to appropriately adjust our business and operations in light of these complicated marketplace dynamics could have a material adverse effect on our business, results of operations, financial condition and cash flows and could materially harm our reputation. \nIf we are not able to effectively compete in the markets in which we operate, including by implementing our growth strategy, effectively adjusting our business and operations in light of evolving marketplace dynamics, building or retaining our patient population, maintaining and developing relationships with nephrologists and hospitals, particularly medical director relationships, or making acquisitions at the desired pace or at all; if we are not able to continue to maintain the expected or desired level of non-acquired growth; or if we experience significant patient attrition either as a result of new business activities in the dialysis or pre-dialysis space by our existing competitors, other market participants, new entrants, new technology or other forms of competition, or as a result of reductions in demand for dialysis treatments, including, without limitation, due to increased mortality rates for dialysis patients resulting from COVID-19 or otherwise, reduced prevalence of ESRD, the development of innovative technologies, drugs or other treatments or an increase in the number of kidney transplants, including xenotransplants, it could materially adversely affect our business, results of operations, financial condition and cash flows.\nThe U.S. integrated kidney care, U.S. other ancillary services and international operations that we operate or invest in now or in the future may generate losses and may ultimately be unsuccessful. In the event that one or more of these activities is unsuccessful, our business, results of operations, financial condition and cash flows may be negatively impacted and we may have to write off our investment and incur other exit costs.\nOur U.S. integrated kidney care and U.S. other ancillary services are subject to many of the same risks, regulations and laws, as described in the risk factors related to our dialysis business set forth in this"
}