{
  "ticker": "FANG",
  "cik": "0001539838",
  "company_name": "Diamondback Energy, Inc.",
  "filing_date": "2025-02-26",
  "accession": "0001539838-25-000021",
  "primary_doc": "fang-20241231.htm",
  "item1_text": "ITEM 1A.  RISK FACTORS\nThe nature of our business activities subjects us to certain hazards and risks. The following is a summary of some of the material risks relating to our business activities. Other risks are described in Items 1 and 2. “Business and Properties,” Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and Item 7A. “Quantitative and Qualitative Disclosures About Market Risk.” These risks are not the only risks we face. We could also face additional risks and uncertainties not currently known to us or that we currently deem to be immaterial. If any of these risks actually occurs, it could materially harm our business, financial condition or results of operations and the trading price of our shares could decline.\nThe following is a summary of the principal risks that could adversely affect our business, operations and financial results:\nRisks Related to the Oil and Natural Gas Industry and Our Business\n•\nMarket conditions and particularly volatility in prices for oil and natural gas may adversely affect our revenue, cash flows, profitability, growth, production and the present value of our estimated reserves.\n•\nOur commodity price derivatives could result in financial losses, may fail to protect us from declines in commodity prices, prevent us from fully benefiting from commodity price increases and may expose us to other risks, including counterparty credit risk.\n•\nThe IRA and other risks relating to climate change could accelerate the transition to a low carbon economy and could impose new costs on our operations that may have a material and adverse effect on us.\n•\nClimate change-related regulations, policies and initiatives may have other adverse effects, such as a greater potential for governmental investigations or litigation.\n•\nWe may be unable to obtain needed capital or financing on satisfactory terms or at all to fund our acquisitions or development activities, which could lead to a loss of properties and a decline in our oil and natural gas reserves and future production. \n•\nOur failure to successfully identify, complete and integrate pending and future acquisitions of properties or businesses could reduce our earnings, and title defects in the properties in which we invest may lead to losses.\n•\nOur identified potential drilling locations are susceptible to uncertainties that could materially alter the occurrence or timing of their drilling.\n•\nIf production from our Permian Basin acreage decreases, we may fail to meet our obligations to deliver specified quantities of oil under our oil purchase contract, which may adversely affect our operations.\n•\nThe inability of one or more of our customers to meet their obligations, or loss of one or more of our significant purchasers, may adversely affect our financial results.\n•\nOur method of accounting for investments in oil and natural gas properties may result in impairment of asset value. \n•\nAny material inaccuracies in reserve estimates or underlying assumptions will materially affect the quantities and present value of our reserves.\n•\nWe are vulnerable to risks associated with our primary operations concentrated in a single geographic area.\n•\nIf transportation or other facilities, certain of which we do not control, or rigs, equipment, raw materials, oil services or personnel are unavailable, our operations could be interrupted and our revenues reduced.\n•\nOur operations are subject to various governmental laws and regulations which require compliance that can be burdensome and expensive and may impose restrictions on our operations.\n•\nU.S. tax legislation, including recently adopted IRA, may negatively affect our business, results of operations, financial condition and cash flow.\n•\nDrilling for and producing oil and natural gas are high-risk activities with many uncertainties that may result in a total loss of investment and adversely affect our business, financial condition or results of operations.\n•\nWe rely on a few key employees whose absence or loss could adversely affect our business.\n•\nA terrorist attack or armed conflict could harm our business and could adversely affect our business.\n•\nA cyber incident could result in information theft, data corruption, operational disruption and/or financial loss. \n•\nFollowing the closing of the Endeavor Acquisition, the Endeavor equityholders have the ability to significantly influence our business, and their interest in our business may be different from that of other stockholders.\nRisks Related to Our Indebtedness\n•\nOur substantial level of indebtedness could adversely affect our financial condition and prevent us from fulfilling our obligations under our indebtedness, and we and our subsidiaries may be able to incur substantial additional indebtedness in the future.\n•\nThe significant additional indebtedness incurred in connection with the Endeavor Acquisition may limit our operating or financial flexibility relative to our current position and make it difficult to satisfy our obligations with respect to our other indebtedness.\n23\nTable of Contents\n•\nImplementing our capital programs may require, under some circumstances, an increase in our total leverage through additional debt issuances, and any significant reduction in availability under our revolving credit facility or inability to otherwise obtain financing for our capital programs could require us to curtail our capital expenditures.\n•\nRestrictive covenants in certain of our existing and future debt instruments may limit our ability to respond to changes in market conditions or pursue business opportunities.\n•\nWe depend on our subsidiaries for dividends and other payments.\n•\nIf we experience liquidity concerns, we could face a downgrade in our debt ratings which could restrict our access to, and negatively impact the terms of, current or future financings or trade credit.\n•\nBorrowings under our and Viper LLC’s revolving credit facilities expose us to interest rate risk. \nRisks Related to Our Common Stock\n•\nThe declaration of dividends and any repurchases of our common stock are each within the discretion of our board of directors, and there is no guarantee that we will pay any dividends on or repurchases of our common stock in the future or at levels anticipated by our stockholders.\n•\nThe market value of our common stock could decline if large amounts of our common stock are sold following the Endeavor Acquisition.\n•\nA change of control could limit our use of net operating losses.\n•\nWe may issue preferred stock whose terms could adversely affect the voting power or value of our common stock.\n•\nProvisions in our certificate of incorporation and bylaws and Delaware law make it more difficult to effect a change in control of the company, which could adversely affect the price of our common stock.\nRisks Related to the Oil and Natural Gas Industry and Our Business\nMarket conditions for oil and natural gas, and particularly volatility in prices for oil and natural gas, have in the past adversely affected, and may in the future adversely affect, our revenue, cash flows, profitability, growth, production and the present value of our estimated reserves.\nOur revenues, operating results, profitability, future rate of growth and the carrying value of our oil and natural gas properties depend significantly upon the prevailing prices for oil and natural gas. Historically, oil and natural gas prices have been volatile and are subject to fluctuations in response to changes in supply and demand, market uncertainty and a variety of additional factors that are beyond our control, including the domestic and foreign supply of oil and natural gas; the level of prices and expectations about future prices of oil and natural gas; the level of global oil and natural gas exploration and production; the cost of exploring for, developing, producing and delivering oil and natural gas; the price and quantity of foreign imports; political and economic conditions in oil producing countries, including the Middle East, Africa, South America and Russia; the potential impact of the war in Ukraine, the Israel-Hamas War and other conflicts in the Middle East on the global energy markets and macroeconomic conditions; the continued threat of terrorism and the impact of military and other action, including U.S. military operations in the Middle East; the ability of members of the OPEC+ to agree to and maintain oil price and production controls; speculative trading in crude oil and natural gas derivative contracts; the level of consumer product demand; extreme weather conditions and other natural disasters; risks associated with operating drilling rigs; technological advances affecting energy consumption; the price and availability of alternative fuels; domestic and foreign governmental regulations and taxes, including the new administration’s energy and environmental policies; global or national health concerns, including the outbreak of pandemic or contagious disease; the proximity, cost, availability and capacity of oil and natural gas pipelines and other transportation facilities; and overall domestic and global economic conditions. Our results of operations may also be adversely impacted by any future government rule, regulation or order that may impose production limits, as well as pipeline capacity and storage constraints, in the Permian Basin where we operate.\nThese factors and the volatility of the energy markets make it extremely difficult to predict future oil and natural gas price movements with any certainty. From the beginning of 2022 through the end of 2024, NYMEX WTI prices ranged from $65.75 to $123.70 per Bbl and the NYMEX Henry Hub price of natural gas ranged from $1.58 to $9.68 per MMBtu. If the prices of oil and natural gas decline, our operations, financial condition and level of expenditures for the development of our oil and natural gas reserves may be materially and adversely affected. \nPrimarily as a result of our Endeavor Acquisition, the Viper Tumbleweed Acquisitions, and the pending Double Eagle Acquisition, if consummated, we expect to increase our fourth quarter 2024 production levels in 2025. We cannot reasonably predict whether production levels will remain at current levels or the full extent of the impact of the events above and any subsequent recovery may have on our industry and our business.\n24\nTable of Contents\nIf commodity prices fall below current levels, we may be required to record impairments in future periods and such impairments could be material. Further, if commodity prices decrease, our production, proved reserves and cash flows will be adversely impacted. Reductions in our reserves could also negatively impact the borrowing base under our revolving credit facility, which could limit our liquidity and ability to conduct additional exploration and development activities.\nOur commodity price derivatives could result in financial losses, may fail to protect us from declines in commodity prices, prevent us from fully benefiting from commodity price increases and\n \nmay\n \nexpose us to other risks, including counterparty credit risk.\nWe use commodity price derivatives, which have historically included swaps, basis swaps, swaptions, roll hedges, costless collars, puts and basis puts, to reduce price volatility associated with certain of our oil, natural gas liquids and natural gas sales. Currently, we have hedged a portion of our estimated 2025 and 2026 production. To the extent that the prices of oil, natural gas liquids and natural gas remain at current levels or decline further, we may not be able to economically hedge additional future production at the same level as our current commodity price derivatives, and our results of operations and financial condition may be negatively impacted. While these commodity price derivatives are intended to mitigate risk from commodity price volatility, we may be prevented from fully realizing the benefits of increases in the prices of oil, natural gas liquids and natural gas above the price levels of the commodity price derivatives used to manage price risk.\nAt settlement, market prices for commodities may exceed the contract prices in our commodity price derivatives agreements, resulting in our need to make significant cash payments to our counterparties. Further, by using commodity derivative instruments, we expose ourselves to credit risk if we are in a positive position at contract settlement and the counterparty fails to perform under the terms of the derivative contract. We do not require collateral from our counterparties. \nFor additional information regarding our outstanding derivative contracts as of December 31, 2024, see Note 13—\nDerivatives\n in Item 8. Financial Statements and Supplementary Data, \nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n and \nItem 7A. Quantitative and Qualitative Disclosures About Market Risk\n—Commodity Price Risk of this report.\nThe IRA and other risks relating to climate change could accelerate the transition to a low carbon economy and could impose new costs on our operations that may have a material and adverse effect on us.\nGovernmental and regulatory bodies, investors, consumers, industry and other stakeholders have been increasingly focused on climate change matters in recent years. This focus, together with changes in consumer and industrial/commercial behavior, preferences and attitudes with respect to the generation and consumption of energy, the use of hydrocarbons, and the use of products manufactured with, or powered by, hydrocarbons, may result in; (i) the enactment of climate change-related regulations, policies and initiatives by governments, investors, and other companies, including alternative energy or “zero carbon” requirements and fuel or energy conservation measures; (ii) technological advances with respect to the generation, transmission, storage and consumption of energy (including advances in wind, solar and hydrogen power, as well as battery technology); (iii) increased availability of, and increased demand from consumers and industry for, energy sources other than oil and natural gas (including wind, solar, nuclear, and geothermal sources as well as electric vehicles); and (iv) development of, and increased demand from consumers and industry for, lower-emission products and services (including electric vehicles and renewable residential and commercial power supplies) as well as more efficient products and services.\nAny of these developments may reduce the demand for products manufactured with (or powered by) hydrocarbons and the demand for, and in turn the prices of, the oil and natural gas that we produce and sell, which would likely have a material adverse impact on us.\nIf any of these developments reduce the desirability of participating in the oilfield services, midstream or downstream portions of the oil and gas industry, then these developments may also reduce the availability to us of necessary third-party services and facilities that we rely on, which could increase our operational costs and adversely affect our ability to explore for, produce, transport and process oil and natural gas and successfully carry out our business and financial strategy. The enactment of climate change-related regulations, policies and initiatives may also result in increases in our compliance costs and other operating costs and have other adverse effects, such as a greater potential for governmental investigations or litigation.\nIn recent years, federal, state and local governments have taken steps to reduce emissions of greenhouse gases. For example, the Infrastructure Investment and Jobs Act and the IRA include billions of dollars in incentives for the development of renewable energy, clean hydrogen, clean fuels, electric vehicles, investments in advanced biofuels and supporting infrastructure and carbon capture and sequestration. Also, in March 2024, the EPA finalized ambitious rules to reduce harmful air pollutant emissions, including greenhouse gases, from light-, medium-, and heavy-duty vehicles beginning in \n25\nTable of Contents\nmodel year 2027. These incentives and regulations could accelerate the transition of the economy away from the use of fossil fuels towards lower- or zero-carbon emissions alternatives, which could decrease demand for, and in turn the prices of, the oil and natural gas that we produce and sell and adversely impact our business. In addition, the IRA imposes the first ever federal fee on the emission of greenhouse gases through a methane emissions charge, which could increase our operating costs and thereby adversely impact our business, financial condition and cash flows. On January 20, 2025, President Trump signed multiple executive orders seeking to reverse these climate incentives, including pausing the disbursement of funds under the IRA. The same day, President Trump also issued executive orders to encourage fossil fuel production and exploration on federal lands and waters, while moving away from incentivizing renewable energy and electric vehicles. It is unclear what effect those actions will have.\nIn addition to potentially reducing demand for our oil and natural gas and potentially reducing the availability of oilfield services and midstream and downstream customers, any further regulatory or other climate change incentives, to the extent they continue, may create reputational risks associated with the exploration for, and production of, hydrocarbons, which may adversely affect the availability and cost to us of capital. For example, in recent years, certain stakeholders and capital providers sought to restrict or seek more stringent conditions with respect to their investment in or financing of certain carbon intensive sectors. If financial institutions and other investors refuse to invest in or provide capital to the oil and gas sector in the future because of these reputational risks, that could result in capital being unavailable to us, or only at significantly increased costs.\nFor further discussion regarding the risks to us of climate change-related regulations, policies and initiatives, please see the section entitled \nItems 1 and 2. Business and Properties\n—Regulation—Climate Change of this report.\nChanging political and social perspectives on climate change and other environmental, social and governance factors may create risks and uncertainties impacting our business.\nIn recent years, increased attention to global climate change resulted in increased investor attention and an increased risk of public and private litigation. Further, shareholders have sought to effect changes to public companies’ businesses or governance to deal with climate change-related issues through shareholder proposals, public campaigns, proxy solicitations or other actions. Any such future actions may result in significant management distraction and potentially significant expense. \nAdditionally, cities, counties, and other governmental entities in several states in the U.S. have filed lawsuits against energy companies seeking damages allegedly associated with climate change. Similar lawsuits may be filed in other jurisdictions. If any such lawsuits were to be filed against us, whether due to our activities or the activities of the acquired entities or operations prior to their acquisition by us, we could incur substantial legal defense costs and, if any such litigation were adversely determined, we could incur substantial damages. \nAny of these climate change-related litigation risks could result in unexpected costs, negative sentiments about our company, disruptions in our operations, and increases to our operating expenses, which in turn could have an adverse effect on our business, financial condition and results of operations.\nOur targets related to sustainability and emissions reduction initiatives, including our public statements and disclosures regarding them, may expose us to numerous risks.\nWe have developed, and will continue to develop, targets related to our environmental, social and governance (“ESG”) initiatives, including our emissions reduction targets and strategy. Statements in this and other reports we file with the SEC and other public statements related to these initiatives reflect our current plans and expectations and are not a guarantee the targets will be achieved or achieved on the currently anticipated timeline. Our ability to achieve our ESG targets, including emissions reductions, is subject to numerous factors and conditions, some of which are outside of our control, and failure to achieve our announced targets or comply with ethical, environmental or other standards, including reporting standards, may expose us to government enforcement actions or private litigation and adversely impact our business. Further, our continuing efforts to research, establish, accomplish and accurately report on these targets may create additional operational risks and expenses and expose us to reputational, legal and other risks. \nESG expectations, including both the matters in focus and the management of such matters, as well as perspectives on the efficacy of ESG considerations, continue to evolve, and we cannot currently predict how regulators’, investors’ and other stakeholders’ views on ESG matters may affect the regulatory and investment landscape and affect our business, financial condition, and results of operations. Further, in response to the evolving regulatory environment and investor expectations, or due to our acquisitions of other companies or assets, we may, periodically, make adjustments to our environmental targets or goals. If we do not, or are perceived to not, adapt or comply with investor or stakeholder expectations and standards on ESG matters, we may suffer from reputational damage and our business, financial condition \n26\nTable of Contents\nand results of operations could be materially and adversely affected. Any reputational damage associated with ESG factors may also adversely impact our ability to recruit and retain employees and customers.\nThe SEC published final rules on March 28, 2024, relating to the disclosure of a range of climate-related risks and other information. Several lawsuits have been filed challenging the rules. In April 2024, the SEC agreed to pause the rules to facilitate an orderly judicial resolution. To the extent the rules are implemented, we and/or our customers could incur increased costs related to the assessment and disclosure of climate-related information.\nIt is unclear what effect recent executive orders by President Trump will have on investor and other stakeholders’ near-term and long-term ESG expectations for companies involved in fossil fuel exploration and production.\nConservation measures and technological advances could reduce demand for oil and natural gas.\nFuel conservation measures, alternative fuel requirements, increasing consumer demand for alternatives to oil and natural gas, technological advances in fuel economy and energy generation devices could reduce demand for oil and natural gas. The impact of the changing demand for oil and natural gas services and products may have a material adverse effect on our business, financial condition, results of operations and cash flows.\nA significant portion of our net leasehold acreage is undeveloped, and that acreage may not ultimately be developed or become commercially productive, which could cause us to lose rights under our leases as well as have a material adverse effect on our oil and natural gas reserves and future production and, therefore, our future cash flow and income. \nA significant portion of our net leasehold acreage is undeveloped, or acreage on which wells have not been drilled or completed to a point that would permit the production of commercial quantities of oil and natural gas regardless of whether such acreage contains proved reserves. In addition, many of our oil and natural gas leases require us to drill wells that are commercially productive and to maintain the production in paying quantities, and if we are unsuccessful in drilling such wells and maintaining such production, we could lose our rights under such leases. Our future oil and natural gas reserves and production and, therefore, our future cash flow and income are highly dependent on successfully developing our undeveloped leasehold acreage. \nLeases on oil and natural gas properties typically have a term of three to five years, after which they expire unless, prior to expiration, production in paying quantities is established within the spacing units covering the undeveloped acres. The cost to renew such leases may increase significantly, and we may not be able to renew such leases on commercially reasonable terms or at all. Any reduction in our current drilling program, either through a reduction in capital expenditures or the unavailability of drilling rigs, could result in the loss of acreage through lease expirations. Any non-renewal or other loss of leases could materially and adversely affect the growth of our asset basis, cash flows and results of operations.\nOur development and exploration operations and our ability to complete acquisitions require substantial capital and we may be unable to obtain needed capital or financing on satisfactory terms or at all, which could lead to a loss of properties and a decline in our oil and natural gas reserves. \nThe oil and natural gas industry is capital intensive. We make and expect to continue to make substantial capital expenditures in our business and operations for the exploration for and development, production and acquisition of oil and natural gas reserves. In 2024, our total capital expenditures, including expenditures for drilling, completion, infrastructure and additions to midstream assets, were approximately $2.9 billion. Our 2025 capital budget, which gives effect to the pending Double Eagle Acquisition, for drilling, completion, infrastructure and midstream, including investments in water disposal infrastructure and gathering line projects, is currently estimated to be approximately $3.80 billion to $4.20 billion, representing an increase of 40% from our 2024 capital expenditures. Since completing our initial public offering in October 2012, we have financed capital expenditures primarily with borrowings under our revolving credit facility, cash generated by operations, the net proceeds from public offerings of our common stock and our senior notes and sales of non-core assets.\nWe intend to finance our future capital expenditures with cash flow from operations, while future acquisitions may also be funded from operations as well as proceeds from offerings of our debt and equity securities and borrowings under our revolving credit facility. Our cash flow from operations and access to capital are subject to a number of variables, including our proved reserves; the volume of oil and natural gas we are able to produce from existing wells; the prices at which our oil and natural gas are sold; our ability to acquire, locate and produce economically new reserves; and our ability to borrow under our credit facility.\nWe cannot assure you that our operations and other capital resources will provide cash in sufficient amounts to maintain planned or future levels of capital expenditures. Further, our actual capital expenditures in 2025 could exceed our \n27\nTable of Contents\ncapital expenditure budget. In the event our capital expenditure requirements at any time are greater than the amount of capital we have available, we could be required to seek additional sources of capital, which may include traditional reserve base borrowings, debt financing, joint venture partnerships, sales of assets, offerings of debt or equity securities or other means. We cannot assure you that we will be able to obtain debt or equity financing on terms favorable to us, or at all. \nIf we are unable to fund our capital requirements or our costs of capital increase, we may be required to curtail our operations relating to the exploration and development of our prospects, which in turn could lead to a possible loss of properties and a decline in our oil and natural gas reserves, or we may be otherwise unable to implement our development plan, complete acquisitions or take advantage of business opportunities or respond to competitive pressures, any of which could have a material adverse effect on our production, revenues and results of operations. In addition, a delay in or the failure to complete proposed or future infrastructure projects could delay or eliminate potential efficiencies and related cost savings. \nOur success depends on finding, developing or acquiring additional reserves. \nOur future success depends upon our ability to find, develop or acquire additional oil and natural gas reserves that are economically recoverable. Our proved reserves will generally decline as reserves are depleted, except to the extent that we conduct successful exploration or development activities or acquire properties containing proved reserves, or both. To increase reserves and production, we undertake development, exploration and other replacement activities or use third parties to accomplish these activities. If we are unable to replace our current production, the value of our reserves will decrease, and our business, financial condition and results of operations would be adversely affected. Furthermore, although our revenues may increase if prevailing oil and natural gas prices increase significantly, our finding and development costs for additional reserves could also increase.\nOur failure to successfully identify, complete and integrate pending and future acquisitions of properties or businesses could reduce our earnings and slow our growth.\nThere is intense competition for acquisition opportunities in our industry. The successful acquisition of producing properties requires an assessment of several factors, including recoverable reserves, future oil and natural gas prices and their applicable differentials, operating costs, and potential environmental and other liabilities.\nThe accuracy of these assessments is inherently uncertain, and we may not be able to identify attractive acquisition opportunities. In connection with these assessments, we perform a review of the subject properties that we believe to be generally consistent with industry practices. Our review will not reveal all existing or potential problems, including title defects or environmental issues, nor will it permit us to become sufficiently familiar with the properties to assess fully their deficiencies and capabilities. Inspections may not always be performed on every well, and environmental problems, such as groundwater contamination, are not necessarily observable even when an inspection is undertaken. Environmental or other regulatory issues may arise with respect to acquired entities or operations years after the acquisitions. Even when problems are identified, the seller may be unwilling or unable to provide effective contractual protection against all or part of the problems. Even if we do identify attractive acquisition opportunities, we may not be able to complete the acquisition or do so on commercially acceptable terms.\nCompetition for acquisitions may increase the cost of, or cause us to refrain from, completing acquisitions. Our ability to complete acquisitions is dependent upon, among other things, our ability to obtain debt and equity financing and, in some cases, regulatory approvals. If these acquisitions include geographic regions in which we do not currently operate, we could be subject to unforeseen operating difficulties and difficulties in coordinating geographically dispersed operations, personnel and facilities. In addition, if we enter into new geographic markets, we may be subject to additional and unfamiliar legal and regulatory requirements. Compliance with regulatory requirements may impose substantial additional obligations on us and our management, cause us to expend additional time and resources in compliance activities and increase our exposure to penalties or fines for non-compliance with such additional legal requirements. Further, the success of any completed acquisition will depend on our ability to integrate effectively the acquired business into our existing operations. The process of integrating acquired businesses may involve unforeseen difficulties and may require a disproportionate amount of our managerial and financial resources. In addition, possible future acquisitions may be larger and for purchase prices significantly higher than those paid for earlier acquisitions.\nAny of these factors could have a material adverse effect on our financial condition and results of operations. Our financial position and results of operations may also fluctuate significantly from period to period, based on whether or not significant acquisitions are completed in particular periods.\n28\nTable of Contents\nOur identified potential drilling locations, which are part of our anticipated future drilling plans, are susceptible to uncertainties that could materially alter the occurrence or timing of their drilling.\nDrilling for oil and natural gas often involves unprofitable efforts, not only from dry wells but also from wells that are productive but do not produce sufficient oil or natural gas to return a profit at then realized prices after deducting drilling, operating and other costs.\nAs of December 31, 2024, we have approximately 9,188 gross (7,130 net) identified economic potential horizontal drilling locations in multiple horizons on our acreage at an assumed price of approximately $50.00 per Bbl WTI. As of December 31, 2024, only 1,381 of our gross identified economic potential horizontal drilling locations in which we have a working interest were attributed to proved reserves. These drilling locations, including those without proved undeveloped reserves, represent a significant part of our growth strategy. Our ability to drill and develop these locations depends on a number of uncertainties, including the availability of capital, construction of infrastructure, unusual or unexpected geological formations, title problems, facility or equipment malfunctions, unexpected operational events, inclement weather, environmental and other regulatory requirements and approvals, oil and natural gas prices, costs, drilling results and the availability of water. Further, our identified potential drilling locations are in various stages of evaluation, ranging from locations that are ready to drill to locations that will require substantial additional interpretation. In addition, as of December 31, 2024, we have identified approximately 1,657 horizontal drilling locations in intervals in which we have drilled very few or no wells, which are necessarily more speculative and based on results from other operators whose acreage may not be consistent with ours. We cannot predict in advance of drilling and testing whether any particular drilling location will yield oil or natural gas in sufficient quantities to recover drilling or completion costs or to be economically viable. The use of technologies and the study of producing fields in the same area will not enable us to know conclusively prior to drilling whether oil or natural gas will be present or, if present, whether oil or natural gas will be present in sufficient quantities to be economically viable. Even if sufficient amounts of oil or natural gas exist, we may damage the potentially productive hydrocarbon bearing formation or experience mechanical difficulties while drilling or completing the well, possibly resulting in a reduction in production from the well or abandonment of the well. If we drill additional wells that we identify as dry holes in our current and future drilling locations, our drilling success rate may decline and materially harm our business. Through December 31, 2024, we are the operator of, have participated in, or have acquired working interest in a total of 6,590 horizontal producing wells completed on our acreage. We cannot assure you that the analogies we draw from available data from these or other wells, more fully explored locations or producing fields will be applicable to our drilling locations. Further, initial production rates reported by us or other operators in the Permian Basin may not be indicative of future or long-term production rates. Because of these uncertainties, we do not know if the potential drilling locations we have identified will ever be drilled or if we will be able to produce oil or natural gas from these or any other potential drilling locations. As such, our actual drilling activities may materially differ from those presently identified, which could adversely affect our business.\nIf production from our Permian Basin acreage decreases due to decreased developmental activities, production related difficulties or otherwise, we may fail to meet our obligations to deliver specified quantities of oil under our oil purchase contracts, which will result in deficiency payments to the counterparty and may have an adverse effect on our operations.\nWe are a party to long-term crude oil agreements under which, subject to certain terms and conditions, we are obligated to deliver specified quantities of oil to our counterparties. Our maximum delivery obligation under these agreements varies for different periods and depends in some cases upon certain conditions beyond our control. If production from our Permian Basin acreage decreases due to reduced developmental activities, as a result of the low commodity price environment, production related difficulties or otherwise, we may be unable to meet our obligations under our oil purchase agreements, which may result in deficiency payments to certain counterparties or a default under such agreements and may have an adverse effect on our company.\nThe inability of one or more of our customers to meet their obligations may adversely affect our financial results.\nIn addition to credit risk related to receivables from commodity derivative contracts, our principal exposure to credit risk is through receivables from joint interest owners on properties we operate and receivables from purchasers of our oil and natural gas production. Joint interest receivables arise from billing entities that own partial interests in the wells we operate. These entities participate in our wells primarily based on their ownership in leases on which we wish to drill. We are generally unable to control which co-owners participate in our wells.\nWe are also subject to credit risk due to the concentration of our oil and natural gas receivables with several significant customers. See \nItems 1 and 2. Business and Properties\n—Marketing and Customers of this report for additional information regarding these customers. This concentration of customers may impact our overall credit risk in that these entities may be similarly affected by any adverse changes in economic and other conditions. We do not require our customers \n29\nTable of Contents\nto post collateral. Under certain circumstances, the revenue due to them can be offset by any unpaid receivables. The inability or failure of our significant customers or joint working interest owners to meet their obligations to us or their insolvency or liquidation may materially adversely affect our financial results.\nOur method of accounting for investments in oil and natural gas properties may result in impairment of asset value.\nWe account for our oil and natural gas producing activities using the full cost method of accounting. Accordingly, all costs incurred in the acquisition, exploration and development of proved oil and natural gas properties, including the costs of abandoned properties, dry holes, geophysical costs and annual lease rentals are capitalized. We also capitalize direct operating costs for services performed with internally owned drilling and well servicing equipment.\nThe net capitalized costs of proved oil and natural gas properties are subject to a full cost ceiling limitation in which the costs are not allowed to exceed their related estimated future net revenues discounted at 10%. To the extent capitalized costs of evaluated oil and natural gas properties, net of accumulated depreciation, depletion, amortization and impairment, exceed the discounted future net revenues of proved oil and natural gas reserves, the excess capitalized costs are charged to expense. We use the unweighted arithmetic average first day of the month price for oil and natural gas for the 12-month period preceding the calculation date in estimating discounted future net revenues.\nNo impairments were recorded on our proved oil and natural gas properties for the years ended December 31, 2024, 2023 and 2022. See \nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Critical Accounting Estimates\n—Oil and Natural Gas Accounting and Reserves of this report. If the prices of oil and natural gas decline, we may be required to further write-down the value of our oil and natural gas properties in the future, which could negatively affect our results of operations.\nOur estimated reserves and EURs are based on many assumptions that may turn out to be inaccurate. Any material inaccuracies in these reserve estimates or underlying assumptions will materially affect the quantities and present value of our reserves.\nOil and natural gas reserve engineering is not an exact science and requires subjective estimates of underground accumulations of oil and natural gas and assumptions concerning future oil and natural gas prices, production levels, ultimate recoveries and operating and development costs. As a result, estimated quantities of proved reserves, projections of future production rates and the timing of development expenditures may be incorrect. The EURs for our horizontal wells are based on management’s internal estimates. Over time, we may make material changes to reserve estimates taking into account the results of actual drilling, testing and production. Also, certain assumptions regarding future oil and natural gas prices, production levels and operating and development costs may prove incorrect. Any significant variance from these assumptions to actual figures could greatly affect our estimates of reserves, the economically recoverable quantities of oil and natural gas attributable to any particular group of properties, the classifications of reserves based on risk of recovery and estimates of future net cash flows. A substantial portion of our reserve estimates are made without the benefit of a lengthy production history, which are less reliable than estimates based on a lengthy production history. Numerous changes over time to the assumptions on which our reserve estimates are based, as described above, often result in the actual quantities of oil and natural gas that we ultimately recover being different from our reserve estimates. Reserve estimates do not include any value for probable or possible reserves that may exist, nor do they include any value for unproved undeveloped acreage. The reserve estimates represent our net revenue interest in our properties.\nThe timing of both our production and our incurrence of costs in connection with the development and production of oil and natural gas properties will affect the timing of actual future net cash flows from proved reserves.\nThe standardized measure of our estimated proved reserves is not necessarily the same as the current market value of our estimated proved oil reserves.\nThe present value of future net cash flows from our proved reserves, or standardized measure may not represent the current market value of our estimated proved oil reserves. Actual future prices and costs may differ materially from those used in the net present value estimate, and future net present value estimates using then current prices and costs may be significantly less than current estimates. In addition, the 10% discount factor we use when calculating discounted future net cash flow for reporting requirements in compliance with the Financial Accounting Standard Board Codification 932, “Extractive Activities—Oil and Gas,” may not be the most appropriate discount factor based on interest rates in effect from time to time and risks associated with us or the oil and natural gas industry in general.\n30\nTable of Contents\nThe development of our proved undeveloped reserves may take longer and may require higher levels of capital expenditures than we currently anticipate.\nApproximately 33% of our total estimated proved reserves as of December 31, 2024, were proved undeveloped reserves and may not be ultimately developed or produced. Recovery of proved undeveloped reserves requires significant capital expenditures and successful drilling and completion operations. The reserve data included in the reserve reports of our independent petroleum engineers assume that substantial capital expenditures are required to develop such reserves. We cannot be certain that the estimated costs of the development of these reserves are accurate, that development will occur as scheduled or that the results of such development will be as estimated. Delays in the development of our reserves, increases in costs to drill and develop such reserves, or further decreases in commodity prices will reduce the future net revenues of our estimated proved undeveloped reserves and may result in some projects becoming uneconomical. In addition, delays in the development of reserves could force us to reclassify certain of our proved reserves as unproved reserves.\nOur producing properties are located in the Permian Basin of West Texas, making us vulnerable to risks (including weather-related risks) associated with operating in a single geographic area. In addition, we have a large amount of proved reserves attributable to a small number of producing horizons within this area.\nOur producing properties are currently geographically concentrated in the Permian Basin of West Texas. As a result, we may be disproportionately exposed to the impact of regional supply and demand factors, delays or interruptions of production from wells in this area caused by governmental regulation, processing or transportation capacity constraints, availability of equipment, facilities, personnel or services market limitations or interruption of the processing or transportation of crude oil, natural gas or natural gas liquids, and extreme weather conditions and their adverse impact on production volumes, availability of electrical power, road accessibility and transportation facilities. \nExtreme regional weather events may occur that can affect our suppliers or customers, which could adversely affect us. For example, a significant hurricane or similar weather event could damage refining and other oil and natural gas-related facilities on the Gulf Coast of Texas and Louisiana, which (if significant enough) could limit the availability of gathering and transportation facilities across Texas and could then cause production in the Permian Basin (including potentially our production) to be curtailed or shut in or (in the case of natural gas) flared. Climate change may also increase the frequency and severity of significant weather events over time. Further, any increase in flaring of our natural gas production due to weather-related events or otherwise could make it difficult for us to achieve our publicly-announced sustainability and emissions reduction targets, which could expose us to reputational risks and adversely impact our contractual and other business relationships. Any of the above-referenced events could have a material adverse effect on us and our production volumes (and therefore on our financial condition and results of operations).\nIn addition, the effect of fluctuations on supply and demand may become more pronounced within specific geographic oil and natural gas producing areas such as the Permian Basin, which may cause these conditions to occur with greater frequency or magnify the effects of these conditions. Due to the concentrated nature of our portfolio of properties, a number of our properties could experience any of the same conditions at the same time, resulting in a relatively greater impact on our results of operations than they might have on other companies that have a more diversified portfolio of properties. Such delays or interruptions could have a material adverse effect on our financial condition and results of operations.\nIn addition to the geographic concentration of our producing properties described above, as of December 31, 2024, most of our proved reserves are concentrated in the Wolfberry play in the Midland Basin. This concentration of assets within a small number of producing horizons exposes us to additional risks, such as changes in field-wide rules and regulations that could cause us to permanently or temporarily shut-in all of our wells within a field.\nWe depend upon several significant purchasers for the sale of most of our oil and natural gas production. The loss of one or more of these purchasers could, among other factors, limit our access to suitable markets for the oil and natural gas we produce.\nThe availability of a ready market for any oil and/or natural gas we produce depends on numerous factors beyond the control of our management, including those discussed. We cannot assure you that we will continue to have ready access to suitable markets for our future oil and natural gas production. In addition, we depend upon several significant purchasers for the sale of most of our oil and natural gas production. See \nItems 1 and 2. Business and Properties\n—Marketing and Customers of this report for additional information regarding these customers. The loss of one or more of these customers, and our inability to sell our production to other customers on terms we consider acceptable, could materially and adversely affect our business, financial condition, results of operations and cash flow.\n31\nTable of Contents\nThe unavailability, high cost or shortages of rigs, equipment, raw materials, supplies, oilfield services or personnel may restrict our operations. \nThe oil and natural gas industry is cyclical, which can result in shortages of drilling rigs, equipment, raw materials (particularly sand and other proppants), supplies and personnel. When shortages occur, the costs and delivery times of rigs, equipment and supplies increase and demand for, and wage rates of, qualified drilling rig crews also rise with increases in demand. We cannot predict whether these conditions will exist in the future and, if so, what their timing and duration will be. In accordance with customary industry practice, we rely on independent third-party service providers to provide most of the services necessary to drill new wells. If we are unable to secure a sufficient number of drilling rigs at reasonable costs, our financial condition and results of operations could suffer, and we may not be able to drill all of our acreage before our leases expire. In addition, we do not have long-term contracts securing the use of our existing rigs, and the operators of those rigs may choose to cease providing services to us. Shortages of any of the items referenced above could delay or restrict our exploration and development operations, which in turn could impair our financial condition and results of operations.\nOur operations are substantially dependent on the availability of water. Restrictions on our ability to obtain water may have an adverse effect on our financial condition, results of operations and cash flows.\nWater is an essential component of deep shale oil and natural gas production during both the drilling and hydraulic fracturing processes. Historically, we have been able to purchase water from local land owners for use in our operations. Over the past several years, Texas has experienced extreme drought conditions. As a result of this severe drought, some local water districts have begun restricting the use of water subject to their jurisdiction for hydraulic fracturing to protect local water supply. Also, in 2021, the Texas Legislature directed the Texas Railroad Commission to adopt rules encouraging fluid oil and gas waste recycling. On January 3, 2025, the Commission published final amendments to its water protection rules to, among other things, encourage waste recycling. The revised rules will go into effect on July 1, 2025. If we are unable to obtain water to use in our operations from local sources, or we are unable to effectively utilize flowback water, we may be unable to economically drill for or produce oil and natural gas, which could have an adverse effect on our financial condition, results of operations and cash flows.\nRecent regulatory restrictions on the disposal of produced water and additional monitoring and reporting requirements related to existing and new produced water disposal wells in the Permian Basin to stem rising seismic activity and earthquakes could increase our operating costs and adversely impact our business, results of operations and financial condition.\nIn September 2021, the Texas Railroad Commission curtailed the amount of produced water companies were permitted to inject into some wells near Midland and Odessa in the Permian Basin, and has since indefinitely suspended some permits there and expanded the restrictions to other areas. These actions were taken in an effort to control induced seismic activity and recent increases in earthquakes in the Permian Basin, which have been linked by the U.S. and local seismologists to wastewater disposal in oil fields. The Texas Railroad Commission has since adopted rules governing the permitting or re-permitting of wells used to dispose of produced water and other fluids resulting from the production of oil and gas in order to address these seismic activity concerns within the state. Among other things, these rules require companies seeking permits for disposal wells to provide seismic activity data in permit applications, provide for more frequent monitoring and reporting for certain wells and allow the state to modify, suspend or terminate permits on grounds that a disposal well is likely to be, or determined to be, causing seismic activity. These restrictions and additional monitoring and reporting requirements related to existing and new produced water and produced water disposal wells could result in increased operating costs, requiring us or our service providers to truck produced water, recycle it or dispose of it by other means, all of which could be costly. We or our service providers may also need to limit disposal well volumes, disposal rates and pressures or locations, or require us or our service providers to shut down or curtail the injection of produced water into disposal wells. These factors may make drilling activity in the affected parts of the Permian Basin less economical and adversely impact our business, results of operations and financial condition.\nPart of our strategy involves drilling in existing or emerging shale plays using the latest available horizontal drilling and completion techniques; therefore, the results of our planned exploratory drilling in these plays are subject to risks associated with drilling and completion techniques and drilling results may not meet our expectations for reserves or production.\nOur operations involve developing and utilizing the latest drilling and completion techniques. Risks that we face while drilling include, but are not limited to, spacing of wells to maximize economic return; landing our well bore in the desired drilling zone; staying in the desired drilling zone while drilling horizontally through the formation; running our casing the entire length of the well bore; and being able to run tools and other equipment consistently through the horizontal well bore.\n32\nTable of Contents\nRisks that we face while completing our wells include, but are not limited to, being able to fracture stimulate the planned number of stages; run tools the entire length of the well bore during completion operations; successfully clean out the well bore after completion of the final fracture stimulation stage; and prevent unintentional communication with other wells.\nFurthermore, certain of the new techniques we are adopting, such as infill drilling and multi-well pad drilling, may cause irregularities or interruptions in production due to, in the case of infill drilling, offset wells being shut in and, in the case of multi-well pad drilling, the time required to drill and complete multiple wells before any such wells begin producing. The results of our drilling in new or emerging formations are more uncertain initially than drilling results in areas that are more developed and have a longer history of established production. Newer or emerging formations and areas often have limited or no production history and consequently we are less able to predict future drilling results in these areas.\nUltimately, the success of these drilling and completion techniques can only be evaluated as more wells are drilled and production profiles are established over a sufficiently long time period. If our drilling results are less than anticipated or we are unable to execute our drilling program because of capital constraints, lease expirations, access to gathering systems, and/or declines in natural gas and oil prices, the return on our investment in these areas may not be as attractive as we anticipate. Further, as a result of any of these developments we could incur material write-downs of our oil and natural gas properties and the value of our undeveloped acreage could decline in the future.\nThe marketability of our production is dependent upon transportation and other facilities, certain of which we do not control. If these facilities are unavailable, our operations could be interrupted and our revenues reduced.\nThe marketability of our oil and natural gas production depends in part upon the availability, proximity and capacity of transportation facilities owned by third parties. We do not control third-party transportation facilities and our access to them may be limited or denied. Insufficient production from our wells to support the construction of pipeline facilities by our purchasers or a significant disruption in the availability of our or third-party transportation facilities or other production facilities could adversely impact our ability to deliver to market or produce our oil and natural gas and thereby cause a significant interruption in our operations. For example, on certain occasions we have experienced high line pressure at our tank batteries with occasional flaring due to the inability of the gas gathering systems in the areas in which we operate to support the increased production of natural gas in the Permian Basin. If, in the future, we are unable, for any sustained period, to implement acceptable delivery or transportation arrangements or encounter production related difficulties, we may be required to shut in or curtail production. In addition, the amount of oil and natural gas that can be produced and sold may be subject to curtailment in certain other circumstances outside of our control, such as pipeline interruptions due to maintenance, excessive pressure, ability of downstream processing facilities to accept unprocessed gas, physical damage to the gathering or transportation system or lack of contracted capacity on such systems. The curtailments arising from these and similar circumstances may last from a few days to several months, and in many cases, we are provided with limited, if any, notice as to when these circumstances will arise and their duration. Any such shut in or curtailment, or an inability to obtain favorable terms for delivery of the oil and natural gas produced from our fields, would adversely affect our financial condition and results of operations.\nOur operations are subject to various governmental laws and regulations which require compliance that can be burdensome and expensive.\nOur oil and natural gas operations are subject to various federal, state and local governmental regulations that may be changed from time to time in response to economic and political conditions. Matters subject to regulation include discharge permits for drilling operations, drilling bonds, reports concerning operations, the spacing of wells, unitization and pooling of properties and taxation. From time to time, regulatory agencies have imposed price controls and limitations on production by restricting the rate of flow of oil and natural gas wells below actual production capacity to conserve supplies of oil and natural gas. In addition, the production, handling, storage, transportation, remediation, emission and disposal of oil and natural gas, by-products thereof and other substances and materials produced or used in connection with oil and natural gas operations are subject to regulation under federal, state and local laws and regulations primarily relating to protection of human health and the environment. Failure to comply with these laws and regulations may result in the assessment of sanctions, including administrative, civil or criminal penalties, permit revocations, requirements for additional pollution controls and injunctions limiting or prohibiting some or all of our operations. Further, these laws and regulations imposed strict requirements for water and air pollution control and solid waste management. Significant expenditures may be required to comply with governmental laws and regulations applicable to us. In addition, federal and state legislation and regulatory initiatives relating to hydraulic fracturing could result in increased costs and additional operating restrictions or delays. Even if federal regulatory burdens temporarily ease, the historic trend of more expansive and stricter environmental legislation and regulations may continue in the long-term, and at the state and local levels. See \nItems 1 and 2. Business and Properties\n—Regulation of this report for a detailed description of certain laws and regulations that affect us.\n33\nTable of Contents\nRestrictions on drilling activities intended to protect certain species of wildlife may adversely affect our ability to conduct drilling activities in some of the areas where we operate.\nOil and natural gas operations in our operating areas can be adversely affected by seasonal or permanent restrictions on drilling activities designed to protect various wildlife. Seasonal restrictions may limit our ability to operate in protected areas and can intensify competition for drilling rigs, oilfield equipment, services, supplies and qualified personnel, which may lead to periodic shortages when drilling is allowed. These constraints and the resulting shortages or high costs could delay our operations and materially increase our operating and capital costs. Permanent restrictions imposed to protect threatened or endangered species could prohibit drilling in certain areas or require the implementation of expensive mitigation measures. The designation of previously unprotected species in areas where we operate as threatened or endangered, such as the recent designation of lesser prairie chickens in southwestern Texas and the dunes sagebrush lizard in southeast New Mexico and west Texas as endangered, could cause us to incur increased costs arising from species protection measures or could result in limitations on our exploration and production activities that could have an adverse impact on our ability to develop and produce our reserves.\nDerivatives reform legislation and related regulations could have an adverse effect on our ability to hedge risks associated with our business.\nThe Dodd-Frank Act established federal oversight of the over-the-counter derivatives market and entities, including us, that participate in that market. The Dodd-Frank Act required the Commodity Futures Trading Commission (CFTC), the SEC, and certain federal regulators of financial institutions (Prudential Regulators), to adopt rules or regulations implementing the Dodd-Frank Act. The Dodd-Frank Act established margin requirements and requires clearing and trade execution practices for certain market participants and may result in certain market participants needing to curtail or cease their derivatives activities. Although some of the rules necessary to implement the Dodd-Frank Act remain to be adopted, the CFTC, the SEC and the Prudential Regulators have issued a number of rules, including rules requiring clearing of certain swaps through registered clearing facilities (Mandatory Clearing Rule), requiring the posting of collateral for uncleared swaps (Margin Rule) and imposing position limits (Position Limit Rule). There are exceptions, subject to meeting certain filing, recordkeeping and reporting requirements, to the Mandatory Clearing Rule, the Margin Rule and the Position Limit Rule.\nWe qualify for the “end user” exception to the Mandatory Clearing Rule and the “non-financial end user” exception to the Margin Rule and we believe that the majority, if not all, of our hedging activities qualify for the “bona fide hedging transaction or position” exception to the Position Limit Rule. We intend to satisfy the applicable filing, recordkeeping and reporting requirements to use these exceptions, so we do not expect to be directly affected by any of such rules. However, most if not all of our swap counterparties will be subject to mandatory clearing and collateral requirements in connection with their hedging activities with other counterparties that do not qualify for exceptions to these rules, which could significantly increase the cost of our derivative contracts or reduce the availability of derivatives to us that we have historically used to protect against risks that we encounter in our business.\nIn addition, the European Union and other non-U.S. jurisdictions have enacted laws and regulations (collectively, Foreign Regulations), which may apply to our transactions with counterparties subject to such Foreign Regulations (Foreign Counterparties). The Foreign Regulations, the Dodd-Frank Act, the rules which have been adopted and not vacated and other regulations could significantly increase the cost of our derivative contracts, materially alter the terms of our derivative contracts, reduce the availability of derivatives to us that we have historically used to protect against risks that we encounter in our business, reduce our ability to monetize or restructure our existing derivative contracts and increase our exposure to less creditworthy counterparties. If we reduce our use of derivatives as a result of the Dodd-Frank Act, the Foreign Regulations or other regulations, our results of operations and cash flows may become more volatile and less predictable, which could adversely affect our ability to plan for and fund capital expenditures. Finally, the Dodd-Frank Act was intended, in part, to reduce the volatility of oil and natural gas prices, which some legislators attributed to speculative trading in derivatives and commodity contracts related to oil and natural gas. Our revenues could therefore be adversely affected if a consequence of the Dodd-Frank Act and regulations is to lower commodity prices. Any of these consequences could have a material adverse effect on us, our financial condition and our results of operations.\nU.S. tax legislation may adversely affect our\n \nbusiness, results of operations, financial condition and cash flow.\nFrom time to time, legislation has been proposed that, if enacted into law, would make significant changes to U.S. federal and state income tax laws affecting the oil and natural gas industry, including (i) eliminating the immediate deduction for intangible drilling and development costs, (ii) the repeal of the percentage depletion allowance for oil and natural gas properties, and (iii) an extension of the amortization period for certain geological and geophysical expenditures. No accurate prediction can be made as to whether any such legislative changes will be proposed or enacted in the future or, if enacted, \n34\nTable of Contents\nwhat the specific provisions or the effective date of any such legislation would be. These proposed changes in the U.S. tax law, if adopted, or other similar changes that would impose additional tax on our activities or reduce or eliminate deductions currently available with respect to natural gas and oil exploration, development or similar activities, could adversely affect our business, results of operations, financial condition and cash flow.\nOn August 16, 2022, President Biden signed into law the IRA, which, among other changes, imposes a 15% corporate alternative minimum tax (“CAMT”) on the “adjusted financial statement income” of certain large corporations (generally, corporations reporting more than $1 billion average adjusted pre-tax net income on their consolidated financial statements) for tax years beginning after December 31, 2022. While we are subject to CAMT, we did not incur a CAMT liability for 2024.\nThe IRA also imposes an excise tax of 1% on the fair market value of certain public company stock repurchases occurring on or after January 1, 2023. The excise tax is imposed on the repurchasing corporation, and the amount of the excise tax is generally 1% of the aggregate fair market value of the stock repurchased during the taxable year. However, for purposes of calculating the excise tax, repurchasing corporations are permitted to net the fair market value of certain new stock issuances against the fair market value of stock repurchases during the same taxable year. To the extent the 1% excise tax applies to repurchases of shares under our common stock repurchase program, the number of shares we repurchase and our cash flow may be affected.\nThe U.S. Treasury Department, the Internal Revenue Service and other standard-setting bodies are expected to issue additional guidance on how CAMT, stock buyback excise tax and other provisions of the IRA will be applied or otherwise administered that may differ from our interpretations. We continue to evaluate the IRA and its effect on our financial results and operating cash flow.\nWe operate in areas of high industry activity, which may affect our ability to hire, train or retain qualified personnel needed to manage and operate our assets.\nOur operations and drilling activity are concentrated in the Permian Basin in West Texas, an area in which industry activity has increased rapidly. As a result, demand for qualified personnel in this area, and the cost to attract and retain such personnel, has increased over the past few years due to competition and may increase substantially in the future. Moreover, our competitors may be able to offer better compensation packages to attract and retain qualified personnel than we are able to offer.\nAny delay or inability to secure the personnel necessary for us to continue or complete our current and planned development activities could lead to a reduction in production volumes. Any such negative effect on production volumes, or significant increases in costs, could have a material adverse effect on our business, financial condition and results of operations.\nWe rely on a few key employees whose absence or loss could adversely affect our business.\nMany key responsibilities within our business have been assigned to a small number of employees. The loss of their services could adversely affect our business. In particular, the loss of the services of one or more members of our executive team could disrupt our operations. We do not have employment agreements with our executives and may not be able to assure their retention. Further, we do not maintain “key person” life insurance policies on any of our employees. As a result, we are not insured against any losses resulting from the death of our key employees.\nOperating hazards and uninsured risks may result in substantial losses and could prevent us from realizing profits.\nOur operations are subject to all of the hazards and operating risks associated with drilling for and production of oil and natural gas, including the risk of fire, explosions, blowouts, surface cratering, uncontrollable flows of natural gas, oil and formation water, pipe or pipeline failures, abnormally pressured formations, casing collapses and environmental hazards such as oil spills, gas leaks and ruptures or discharges of toxic gases. In addition, our operations are subject to risks associated with hydraulic fracturing, including any mishandling, surface spillage or potential underground migration of fracturing fluids, including chemical additives. The occurrence of any of these events could result in substantial losses to us due to injury or loss of life, severe damage to or destruction of property, natural resources and equipment, pollution or other environmental damage, clean-up responsibilities, regulatory investigations and penalties, suspension of operations and repairs required to resume operations.\n35\nTable of Contents\nWe endeavor to contractually allocate potential liabilities and risks between us and the parties that provide us with services and goods, which include pressure pumping and hydraulic fracturing, drilling and cementing services and tubular goods for surface, intermediate and production casing. Under our agreements with our vendors, to the extent responsibility for environmental liability is allocated between the parties, (i) our vendors generally assume all responsibility for control and removal of pollution or contamination which originates above the surface of the land and is directly associated with such vendors’ equipment while in their control and (ii) we generally assume the responsibility for control and removal of all other pollution or contamination which may occur during our operations, including pre-existing pollution and pollution which may result from fire, blowout, cratering, seepage or any other uncontrolled flow of oil, gas or other substances, as well as the use or disposition of all drilling fluids. In addition, we generally agree to indemnify our vendors for loss or destruction of vendor-owned property that occurs in the well hole (except for damage that occurs when a vendor is performing work on a footage, rather than day work, basis) or as a result of the use of equipment, certain corrosive fluids, additives, chemicals or proppants. However, despite this general allocation of risk, we might not succeed in enforcing such contractual allocation, might incur an unforeseen liability falling outside the scope of such allocation or may be required to enter into contractual arrangements with terms that vary from the above allocations of risk. As a result, we may incur substantial losses which could materially and adversely affect our financial condition and results of operations.\nIn accordance with what we believe to be customary industry practice, we historically have maintained insurance against some, but not all, of our business risks. Our insurance may not be adequate to cover any losses or liabilities we may suffer. Also, insurance may no longer be available to us or, if it is, its availability may be at premium levels that do not justify its purchase. The occurrence of a significant uninsured claim, a claim in excess of the insurance coverage limits maintained by us or a claim at a time when we are not able to obtain liability insurance could have a material adverse effect on our ability to conduct normal business operations and on our financial condition, results of operations or cash flow. In addition, we may not be able to secure additional insurance or bonding that might be required by new governmental regulations. This may cause us to restrict our operations, which might severely impact our financial position. We may also be liable for environmental damage caused by previous owners of properties purchased by us, which liabilities may not be covered by insurance.\nSince hydraulic fracturing activities are part of our operations, we maintain insurance to protect against claims made for bodily injury and property damage, and that insurance includes coverage for clean-up costs stemming from a sudden and accidental pollution event. However, we may not have coverage if we are unaware of the pollution event and unable to report the “occurrence” to our insurance company within the time frame required under our insurance policy. We have limited coverage for gradual, long-term pollution events. In addition, these policies do not provide coverage for all liabilities, and we cannot assure you that the insurance coverage will be adequate to cover claims that may arise, or that we will be able to maintain adequate insurance at rates we consider reasonable. A loss not fully covered by insurance could have a material adverse effect on our financial position, results of operations and cash flows.\nOur use of 2-D and 3-D seismic data is subject to interpretation and may not accurately identify the presence of oil and natural gas, which could adversely affect the results of our drilling operations.\nEven when properly used and interpreted, 2-D and 3-D seismic data and visualization techniques are only tools used to assist geoscientists in identifying subsurface structures and hydrocarbon indicators and do not enable the interpreter to know whether hydrocarbons are, in fact, present in those structures. In addition, the use of 3-D seismic and other advanced technologies requires greater predrilling expenditures than traditional drilling strategies, and we could incur losses as a result of such expenditures. As a result, our drilling activities may not be successful or economical.\nWe own interests in certain pipeline projects and other joint ventures, and we may in the future enter into additional joint ventures, and our control of such entities is limited by provisions of the governing documents of such entities and by our percentage ownership in such entities.\nWe have ownership interests in several joint ventures, and we may enter into other similar arrangements in the future. While we own equity interests and have certain voting rights with respect to our ownership interest, we do not control our joint ventures. We have limited ability to influence the business decisions of these entities, and it may therefore be difficult or impossible for us to cause the joint venture to take actions that we believe would be in our or the relevant joint venture’s best interests. Moreover, joint venture arrangements involve various risks and uncertainties, such as committing us to fund operating and/or capital expenditures, the timing and amount of which we may not control. In addition, our joint venture partners may not satisfy their financial obligations to the joint venture and may have economic, business or legal interests or goals that are inconsistent with ours, or those of the joint venture.\nWe are also unable to control the amount of cash we receive from the operation of these entities. Further, certain of these joint ventures have incurred substantial debt and servicing such debt or complying with debt covenants may limit the \n36\nTable of Contents\nability of the joint ventures to make distributions to us and the other joint venture partners. These joint ventures also have internal control environments independent of our oversight and review. If our joint venture partners have control deficiencies in their accounting or financial reporting environments, it may result in inaccuracies in the reporting for our percentage of the financial results of the joint venture.\nWe may not be able to keep pace with technological developments in our industry.\nThe oil and natural gas industry is characterized by rapid and significant technological advancements and introductions of new products and services using new technologies. As others use or develop new technologies, we may be placed at a competitive disadvantage or may be forced by competitive pressures to implement those new technologies at substantial costs. In addition, other oil and natural gas companies may have greater financial, technical and personnel resources that allow them to enjoy technological advantages and that may in the future allow them to implement new technologies before we can. We may not be able to respond to these competitive pressures or implement new technologies on a timely basis or at an acceptable cost. If one or more of the technologies we use now or in the future were to become obsolete, our business, financial condition or results of operations could be materially and adversely affected.\nA terrorist attack or armed conflict could harm our business.\nTerrorist activities, anti-terrorist efforts and other armed conflicts involving the United States or other countries may adversely affect the United States and global economies and could prevent us from meeting our financial and other obligations. If any of these events occur, the resulting political instability and societal disruption could reduce overall demand for oil and natural gas causing a reduction in our revenues. Oil and natural gas related facilities could be direct targets of terrorist attacks, and our operations could be adversely impacted if infrastructure integral to our customers’ operations is destroyed or damaged. Costs for insurance and other security may increase as a result of these threats, and some insurance coverage may become more difficult to obtain, if available at all.\nOur operations depend heavily on electrical power, internet and telecommunication infrastructure and information and computer systems. If any of these systems are compromised or unavailable, our business could be adversely affected.\nWe are heavily dependent on electrical power, internet and telecommunications infrastructure and our information systems and computer-based programs, including our well operations information, seismic data, electronic data processing and accounting data. If any of such infrastructure, systems or programs were to fail or become unavailable or compromised, or create erroneous information in our hardware or software network infrastructure, our ability to safely and effectively operate our business will be limited and any such consequence could have a material adverse effect on our business.\nWe are subject to cybersecurity risks. A cyber incident could occur and result in information theft, data corruption, operational disruption and/or financial loss.\nAs an exploration and production company, we rely extensively on information technology systems, including internally developed software, data hosting platforms, real-time data acquisition systems, third-party software, cloud services and other internally or externally hosted hardware and software platforms, to (i) estimate our oil and natural gas reserves, (ii) process and record financial and operating data, (iii) process and analyze all stages of our business operations, including exploration, drilling, completions, production, transportation, pipelines and other related activities and (iv) communicate with our employees and vendors, suppliers and other third parties. Further, our reliance on technology has increased due to the increased use of personal devices, remote communications and work-from-home or hybrid work practices that evolved in response to the COVID-19 pandemic and became a common business practice thereafter.\nRisks from cybersecurity threats have not materially affected, and are not currently anticipated to materially affect our company, including our business strategy, results of operations and financial condition. However, our systems and networks, and those of our vendors, service providers and other third-party providers, may become the target of cybersecurity attacks, including, without limitation, denial-of-service attacks; malicious software; data privacy breaches by employees, insiders or others with authorized access; cyber or phishing-attacks; ransomware; attempts to gain unauthorized access to our data and systems; and other electronic security breaches. Security incidents can also occur as a result of non-technical issues, such as physical theft. More recently, advancements in artificial intelligence (“AI”) may pose serious risks for many of the traditional tools used to identify individuals, including voice recognition (whether by machine or the human ear), facial recognition or screening questions to confirm identities. In addition, generative AI systems may also be used by malicious actors to create more sophisticated cyber-attacks (i.e., more realistic phishing or other attacks). The advancements in AI could lead to an increase in the frequency of identity fraud or cyberattacks (whether successful or unsuccessful), which could cause us to incur increasing costs, including costs to deploy additional personnel, protection technologies and policies and procedures, train employees, and engage third-party experts and consultants. If any of these security breaches were to occur, \n37\nTable of Contents\nwe could suffer disruptions to our normal operations, including our exploration, completion, production and corporate functions, which could materially and adversely affect us in a variety of ways, including, but not limited to, unauthorized access to, and release of, our business data, reserves information, strategic information or other sensitive or proprietary information, which could have a material and adverse effect on our ability to compete for oil and gas resources, or reduce our competitive advantage over other companies; data corruption, communication interruption, or other operational disruptions during our drilling activities, which could result in our failure to reach the intended target or a drilling incident; data corruption or operational disruptions of our production-related infrastructure, which could result in loss of production or accidental discharges; unauthorized access to, and release of, personal information of our employees, vendors, service providers, royalty and working interest owners, or other third parties, which could expose us to allegations that we did not sufficiently protect such information; a cybersecurity attack on a vendor, service provider or other business partner, which could result in supply chain disruptions and could delay or halt our operations; a cybersecurity attack on third-party gathering, transportation, processing, fractionation, refining or other facilities, which could result in reduced demand for our production or delay or prevent us from transporting and marketing our production, in either case resulting in a loss of revenues; a cybersecurity attack involving commodities exchanges or financial institutions could slow or halt commodities trading, thus preventing us from marketing our production or engaging in hedging activities, resulting in a loss of revenues; a deliberate corruption of our financial or operating data could result in events of non-compliance which could then lead to regulatory enforcement actions, fines or penalties; a cybersecurity attack on a communications network or power grid, which could cause operational disruptions resulting in a loss of revenues; and a cybersecurity attack on our automated and surveillance systems, which could cause a loss of production and potential environmental hazards.\nWe have implemented and invested in, and will continue to implement and invest in, controls, procedures and protections (including internal and external personnel) that are designed to protect our systems, identify and remediate on a regular basis vulnerabilities in our systems and related infrastructure and monitor and mitigate the risk of data loss and other cybersecurity threat. We have engaged third-party consultants to conduct penetration testing and risk assessments. Our cybersecurity governance program is informed by the National Institute of Standards and Technology (“NIST”) Cybersecurity Framework and measured by the Maturity and Risk Assessment Ratings associated with the NIST Cybersecurity Framework and the Capability Maturity Model Integration. Such measures, however, cannot entirely eliminate cybersecurity threats and the controls, procedures and protections we have implemented and invested in may prove to be ineffective. We maintain specialized insurance for possible liability resulting from a cyberattack on our assets, however, we cannot assure you that the insurance coverage will be adequate to cover claims that may arise, or that we will be able to maintain adequate insurance at rates we consider reasonable. A loss not fully covered by insurance could have a material adverse effect on our financial position, results of operations and cash flows.\nEvolving privacy-related laws could give rise to liabilities, which could adversely impact our business, results of operations or financial condition.\nA variety of U.S. federal, state and international laws and regulations govern the collection, use, retention, sharing and security of personal data. All 50 states have enacted legislation on data breach notification requirements and many states continue to enact laws on matters of privacy, data protection and cybersecurity. The existing privacy-related laws and regulations are evolving and subject to potentially differing interpretations. In addition, various U.S. federal, state and foreign legislative and regulatory bodies continue to enact new laws regarding privacy and data protection, as well as expand the scope of existing laws. For example, Texas recently passed the Texas Data Privacy and Security Act, which establishes new laws for collecting, storing, processing, and selling consumer information. Several other states, such as California, Utah, Colorado, Virginia, Connecticut, Michigan, Ohio, Pennsylvania, and New Jersey, among others, have proposed or passed legislation regarding data privacy and use. We cannot predict the impact of any such evolving privacy-related laws on our business, operations or financial condition, but may find it necessary to enhance our existing systems and procedures, which may involve substantial expense or distraction from other aspects of our business. In addition, any violations of applicable privacy-related laws or regulations may require us to address legal claims, sustain monetary penalties or incur other liabilities, as well as cause reputational damage, any of which could adversely impact our business, results of operations or financial condition.\nFollowing the closing of the Endeavor Acquisition, the Endeavor equityholders have the ability to significantly influence our business, and their interest in our business may be different from that of other stockholders.\nAs of December 31, 2024, Endeavor’s equityholders held approximately 36% of our common stock. Pursuant to an agreement with the Endeavor equityholders (the “Stockholders Agreement), the Company appointed three additional directors to our board of directors of the Company at closing of the Endeavor Acquisition. We will not be permitted to take certain actions without the consent of the holders of a majority of the shares of our common stock held by the Endeavor equityholders. The Endeavor equityholders’ level of ownership and influence may make some transactions (such as those involving mergers, material share issuances or changes in control) more difficult or impossible, which in turn could adversely \n38\nTable of Contents\naffect the market price of our shares of common stock or prevent our shareholders from realizing a premium over the market price for their shares of our common stock. The interests of the Endeavor equityholders may conflict with the interests of other stockholders.\nRisks Related to Our Indebtedness\nReferences in this section to “us, “we” or “our” shall mean Diamondback Energy, Inc. and Diamondback E&P LLC, collectively, unless otherwise specified.\nServicing our indebtedness requires a significant amount of cash, and we may not have sufficient cash flow from our business to pay our substantial indebtedness.\nOur ability to make scheduled payments of the principal, to pay interest on or to refinance our indebtedness, including our senior notes, depends on our future performance, which is subject to economic, financial, competitive and other factors beyond our control. If we are unable to generate sufficient cash flow to service our debt, we may be required to adopt one or more alternatives, such as reducing or delaying capital expenditures, selling assets, restructuring debt or obtaining additional equity capital on terms that may be onerous or highly dilutive. However, we cannot assure you that undertaking alternative financing plans, if necessary, would allow us to meet our debt obligations. In the absence of such cash flows, we could have substantial liquidity problems and might be required to sell material assets or operations to attempt to meet our debt service and other obligations. We may not be able to consummate those asset sales to raise capital or sell assets at prices that we believe are fair, and proceeds that we do receive may not be adequate to meet any debt service obligations then due. Our ability to refinance our indebtedness will depend on the capital markets and our financial condition at the time. We may not be able to engage in any of these activities or engage in these activities on desirable terms, which could result in a default on our debt obligations and have an adverse effect on our financial condition.\nThe significant additional indebtedness incurred in connection with the Endeavor Acquisition, as well as additional indebtedness that may be incurred in connection with future acquisitions, may limit our operating or financial flexibility and make it difficult to satisfy our obligations with respect to our other indebtedness.\nWe incurred a substantial amount of debt to finance the cash consideration of the Endeavor Acquisition and to repay certain existing indebtedness of Endeavor. Additionally, from time to time we may incur additional indebtedness in connection with other acquisitions in the future. Our increased level of debt could have negative consequences on us, including, among other things, (i) requiring us to dedicate a larger portion of cash flow from operations to servicing and repayment of the debt, (ii) reducing funds available for strategic initiatives and opportunities, working capital and other general corporate needs, (iii) limiting our ability to incur additional indebtedness, which could restrict our flexibility to react to changes in our business, our industry and economic conditions and (iv) placing us at a competitive disadvantage compared to our competitors that have less debt.\nWe and our subsidiaries may still be able to incur substantial additional indebtedness in the future, which could further exacerbate the risks that we and our subsidiaries face.\nWe and our subsidiaries may be able to incur substantial additional indebtedness in the future. The terms of our and our subsidiaries’ revolving credit facilities and the indentures restrict, but in each case do not completely prohibit, us from doing so. Further, the indentures governing our and our subsidiaries’ notes allow us to issue additional notes, incur certain other additional debt and to have subsidiaries that do not guarantee the senior notes and which may incur additional debt, which would be structurally senior to the senior notes. In addition, the indentures governing the senior notes do not prevent us from incurring other liabilities that do not constitute indebtedness. If we or a guarantor incur any additional indebtedness that ranks equally with the senior notes (or with the guarantees thereof), including additional unsecured indebtedness or trade payables, the holders of that indebtedness will be entitled to share ratably with holders of the senior notes in any proceeds distributed in connection with any insolvency, liquidation, reorganization, dissolution or other winding-up of us or a guarantor. If new debt or other liabilities are added to our current debt levels, the related risks that we and our subsidiaries now face could intensify.\nImplementing our capital programs may require, under some circumstances, an increase in our total leverage through additional debt issuances, and any significant reduction in availability under our revolving credit facility or inability to otherwise obtain financing for our capital programs could require us to curtail our capital expenditures.\nWe have historically relied on availability under our revolving credit facility to fund a portion of our capital expenditures. We expect that we will continue to fund a portion of our capital expenditures with borrowings under the revolving credit facility, cash flow from operations and the proceeds from debt and equity offerings. In the past, we have \n39\nTable of Contents\ncreated availability under the revolving credit facility by repaying outstanding borrowings with the proceeds from debt or equity offerings. We cannot assure you that we will choose to or be able to access the capital markets to repay any such future borrowings. Instead, we may be required or choose to finance our capital expenditures through additional debt issuances, which would increase our total amount of debt outstanding. If the availability under the revolving credit facility were reduced, and we were otherwise unable to secure other sources of financing, we may be required to curtail our capital expenditures, which could limit our ability to fund our drilling activities and acquisitions or otherwise finance the capital expenditures necessary to replace our reserves.\nRestrictive covenants in certain of our existing and future debt instruments may limit our ability to respond to changes in market conditions or pursue business opportunities.\nCertain of our debt instruments contain, and the terms of any future indebtedness may contain, restrictive covenants that limit our ability to, among other things: incur or guarantee additional indebtedness; make certain investments; create liens; sell or transfer assets; issue preferred stock; merge or consolidate with another entity; pay dividends or make other distributions; create unrestricted subsidiaries; and engage in transactions with affiliates. A breach of any of these restrictive covenants could result in default under the applicable debt instrument.\nWe and our subsidiaries may be prevented from taking advantage of business opportunities that arise because of the limitations imposed on us by the restrictive covenants and financial covenants contained in our and our subsidiaries’ debt instruments. As an example, our revolving credit facility requires us to maintain a total net debt to capitalization ratio. The requirement that we and our subsidiaries comply with these provisions may materially adversely affect our and our subsidiaries ability to react to changes in market conditions, take advantage of business opportunities we believe to be desirable, obtain future financing, fund needed capital expenditures or withstand a continuing or future downturn in our business.\nIf a default occurs under our revolving credit facility, the lenders thereunder may elect to declare all borrowings outstanding, together with accrued interest and other fees, to be immediately due and payable, which would result in an event of default under the indentures governing our senior notes. The lenders will also have the right in these circumstances to terminate any commitments they have to provide further borrowings. If the indebtedness under our revolving credit facility and our senior notes were to be accelerated, we cannot assure you that our assets would be sufficient to repay in full that indebtedness.\nWe depend on our subsidiaries for dividends and other payments.\nAs a holding company, we depend on our subsidiaries for dividends and other payments. We are a legal entity separate and distinct from our operating subsidiaries. There are statutory and regulatory limitations on the payment of dividends. If our subsidiaries are unable to make dividend payments to us and sufficient cash or liquidity is not otherwise available, we may not be able to make dividend payments to our stockholders or principal and interest payments on our outstanding indebtedness.\nIf we experience liquidity concerns, we could face a downgrade in our debt ratings which could restrict our access to, and negatively impact the terms of, current or future financings or trade credit.\nOur ability to obtain financings and trade credit and the terms of any financings or trade credit is, in part, dependent on the credit ratings assigned to our debt by independent credit rating agencies. We cannot provide assurance that any of our current ratings will remain in effect for any given period of time or that a rating will not be lowered or withdrawn entirely by a rating agency if, in its judgment, circumstances so warrant. Factors that may impact our credit ratings include debt levels, planned asset purchases or sales and near-term and long-term production growth opportunities, liquidity, asset quality, cost structure, product mix and commodity pricing levels. A ratings downgrade could adversely impact our ability to access financings or trade credit and increase our borrowing costs.\nBorrowings under our and Viper LLC’s revolving credit facilities expose us to interest rate risk.\nOur earnings are exposed to interest rate risk associated with borrowings under our and Viper LLC’s revolving credit facilities. The terms of our and Viper LLC’s revolving credit facilities provide for interest on borrowings at a floating rate equal to an alternate base rate tied to the secured overnight financing rate (“SOFR”). SOFR tends to fluctuate based on multiple factors, including general short-term interest rates, rates set by the U.S. Federal Reserve and other central banks and general economic conditions. From time to time, we use interest rate swaps to reduce interest rate exposure with respect to our fixed and/or floating rate debt. The weighted average interest rate on borrowings under our revolving credit facility was 6.33% during the year ended December 31, 2024. Viper LLC’s weighted average interest rate on borrowings from its \n40\nTable of Contents\nrevolving credit facility was 7.34% during the year ended December 31, 2024. If interest rates increase, so will our interest costs, which may have a material adverse effect on our results of operations and financial condition.\nRisks Related to Our Common Stock\nThe declaration of base and variable dividends and any repurchases of our common stock are each within the discretion of our board of directors based upon a review of relevant considerations, and there is no guarantee that we will pay any dividends on or repurchase shares of our common stock in the future or at levels anticipated by our stockholders.\nThe decision to pay any future base and variable dividends is solely within the discretion of, and subject to approval by, our board of directors. Our board of directors’ determination with respect to any such dividends, including the record date, the payment date and the actual amount of the dividend, will depend upon our profitability and financial condition, contractual restrictions, restrictions imposed by applicable law and other factors that the board deems relevant at the time of such determination. Based on its evaluation of these factors, the board of directors may determine not to declare a dividend, whether base or variable, or declare dividends at rates that are less than currently anticipated, either of which could reduce returns to our stockholders.\nIn September 2024, our board of directors approved an increase in our common stock repurchase program to acquire up to $6.0 billion. We may be limited in our ability to repurchase shares of our common stock by various governmental laws, rules and regulations which prevent us from purchasing our common stock during periods when we are in possession of material non-public information. Through December 31, 2024, approximately $3.3 billion has been repurchased through the repurchase program. Even though this program is in place, we may not repurchase any shares through the program and any such repurchases are completely within the discretion of our board of directors. In addition, the stock repurchase program has no time limit and may be suspended, modified, or discontinued by the board of directors at any time. Any elimination of, or reduction in, the Company’s base or variable dividend or common stock repurchase program could adversely affect the total return of an investment in and have a material adverse effect on the market price of our common stock.\nBeginning in the first quarter of 2024, our board of directors approved a reduction to our return of capital commitment to at least 50% (down from 75%) of free cash flow to be distributed quarterly to our stockholders in the primary form of a base dividend with additional return of capital expected to be in the form of a variable dividend and through our stock repurchase program. The amount of cash available to return to our stockholders, if any, can vary significantly from quarter to quarter for a number of reasons, including commodity prices, liquidity, debt levels, capital resources and other factors. The price of our common stock may deteriorate if we are unable to meet investor expectations with respect to the timing and amount of our return of capital commitment to our shareholders, and such deterioration may be material.\nThe market value of our common stock could decline if large amounts of our common stock are sold following the Endeavor Acquisition and the pending Double Eagle Acquisition.\nAt closing, we entered into the Stockholders Agreement with the Endeavor equityholders that, among other things, provided the Endeavor equityholders with certain shelf, demand and piggyback registration rights. While the Endeavor equityholders are subject to a lock-up with respect to 90% of the shares of our common stock issued in the Endeavor Acquisition, the lock-up will apply to 66.6% and 33.3% of the shares issued in the Endeavor Acquisition following March 10, 2025 and September 10, 2025, respectively, and will terminate following March 10, 2026. Additionally, if the pending Double Eagle Acquisition is consummated, we will issue approximately 6.9 million shares of our common stock to the seller. Endeavor equityholders and Double Eagle equityholders may decide not to hold shares of our common stock that they received in the Endeavor Acquisition and Double Eagle Acquisitions, respectively, and may decide to reduce their investment in us. Such sales of our common stock or the perception that these sales may occur, could have the effect of depressing the market price for our common stock. \nA change of control could limit our use of net operating losses and certain other tax attributes.\nUnder Section 382 of the Internal Revenue Code of 1986, as amended (the “Code”), a corporation that experiences an “ownership change” (as defined in the Code) may be subject to limitations on its ability to offset taxable income arising after the ownership change with net operating losses (“NOLs”) or tax credits generated prior to the ownership change. In general, an ownership change occurs if there is a cumulative increase in the ownership of a corporation’s stock totaling more than 50 percentage points by one or more “5% shareholders” (as defined in the Code) at any time during a rolling three-year period. An ownership change would establish an annual limitation on the amount of a corporation’s pre-change NOLs or tax credits that could be utilized to offset taxable income in any future taxable year. The amount of the limitation is generally equal to the value of the corporation’s stock immediately prior to the ownership change multiplied by an interest rate, referred \n41\nTable of Contents\nto as the long-term tax-exempt rate, periodically promulgated by the IRS. This limitation, however, may be significantly increased if there is “net unrealized built-in gain” in the assets of the corporation undergoing the ownership change.\nAs of December 31, 2024, we had an NOL carryforward of approximately $538 million and tax credits of $4 million for U.S. federal income tax purposes, principally consisting of tax attributes acquired from QEP Resources, Inc. (“QEP”) and Rattler. As a result of ownership changes for Diamondback Energy, Inc., QEP and Rattler, which occurred in connection with the acquisition of QEP and the Rattler Merger, our NOLs and other carryforwards, including those acquired from QEP and Rattler, are subject to an annual limitation under Section 382 of the Code. However, we have determined that our fair market value and our net unrealized built-in gain position resulted in a significant increase in our Section 382 limits. Accordingly, we believe that the application of Section 382 of the Code as a result of these ownership changes will not have a material adverse effect on our ability to utilize our NOLs and credits.\nFuture changes in our stock ownership, however, could result in an additional ownership change under Section 382 of the Code. Any such ownership change may limit our ability to offset taxable income arising after such an ownership change with NOLs or other tax attributes generated prior to such an ownership change, possibly substantially.\nWe may issue preferred stock whose terms could adversely affect the voting power or value of our common stock.\nOur certificate of incorporation authorizes us to issue, without the approval of our stockholders, one or more classes or series of preferred stock having such designations, preferences, limitations and relative rights, including preferences over our common stock respecting dividends and distributions, as our board of directors may determine. The terms of one or more classes or series of preferred stock could adversely impact the voting power or value of our common stock. For example, we might grant holders of preferred stock the right to elect some number of our directors in all events or on the happening of specified events or the right to veto specified transactions. Similarly, the repurchase or redemption rights or liquidation preferences we might assign to holders of preferred stock could affect the residual value of the common stock.\nProvisions in our certificate of incorporation and bylaws and Delaware law make it more difficult to effect a change in control of our company, which could adversely affect the price of our common stock.\nThe existence of some provisions in our certificate of incorporation and bylaws and Delaware corporate law could delay or prevent a change in control of our company, even if that change would be beneficial to our stockholders. Our certificate of incorporation and bylaws contain provisions that may make acquiring control of our company difficult, including provisions regulating the ability of our stockholders to nominate directors for election or to bring matters for action at annual meetings of our stockholders; limitations on the ability of our stockholders to call a special meeting and act by written consent; the ability of our board of directors to adopt, amend or repeal bylaws, and the requirement that the affirmative vote of holders representing at least 66 2/3% of the voting power of all outstanding shares of capital stock be obtained for stockholders to amend our bylaws; the requirement that the affirmative vote of holders representing at least 66 2/3% of the voting power of all outstanding shares of capital stock be obtained to remove directors; the requirement that the affirmative vote of holders representing at least 66 2/3% of the voting power of all outstanding shares of capital stock be obtained to amend our certificate of incorporation; and the authorization given to our board of directors to issue and set the terms of preferred stock without the approval of our stockholders.\nThese provisions also could discourage proxy contests and make it more difficult for our stockholders to elect directors and take other corporate actions. As a result, these provisions could make it more difficult for a third party to acquire us, even if doing so would benefit our stockholders, which may limit the price that investors are willing to pay in the future for shares of our common stock.\nITEM 1B.  UNRESOLVED STAFF COMMENTS\nNone.\nITEM 1C.  CYBERSECURITY\nCybersecurity Risk Management Strategy\nWe have implemented and invested in, and will continue to implement and invest in, controls, procedures and protections (including internal and external personnel) that are designed to protect our systems, identify and remediate on a regular basis vulnerabilities in our systems and related infrastructure and monitor and mitigate the risk of data loss and other cybersecurity threats. \nWe have engaged third-party consultants to conduct penetration testing and risk assessments.\n Our cybersecurity program is informed by the National Institute of Standards and Technology (“NIST”) Cybersecurity \n42\nTable of Contents\nFramework and measured by the Maturity and Risk Assessment Ratings associated with the NIST Cybersecurity Framework and the Capability Maturity Model Integration.\nOur cybersecurity risk management program is integrated into our overall enterprise risk management program, and shares common methodologies, reporting channels and governance processes that apply across the enterprise risk management program to other legal, compliance, strategic, operational, and financial risk areas.\nOur cybersecurity risk management program includes:\n•\nrisk assessments designed to help identify material cybersecurity risks to our critical systems, information, products, services, and our broader enterprise IT and operational technology, or OT, environments;\n•\na security team principally responsible for managing (i) our cybersecurity risk assessment processes, (ii) our security controls, and (iii) our response to cybersecurity incidents;\n•\nthe use of external service providers, where appropriate, to assess, test, train or otherwise assist with aspects of our security controls;\n•\nsecurity tools deployed in the IT and OT environments for protection against and monitoring for suspicious activity;\n•\ncybersecurity awareness training of our employees, including incident response personnel and senior management; \n•\ncybersecurity tabletop exercises for members of our cybersecurity incident response team and legal department;\n•\na cybersecurity incident response plan that includes procedures for responding to cybersecurity incidents; and\n•\na third-party risk management process for service providers, suppliers and vendors.\nCybersecurity Governance\nOur cybersecurity governance program is led by the \nSenior Vice President and Chief Information Officer\n, with support from the internal information technology department.\n \nThe Senior Vice President and Chief Information Officer has over 20 years of technological leadership experience in the oil and gas industry, providing oversight of all information technology disciplines, including cybersecurity, networking, infrastructure, applications, and data management and protection. The Senior Vice President and Chief Information Officer and his team, which consists of individuals who hold designations as Certified Information Systems Security Professional (CISSP), Certified Information Systems Auditor (CISA), CompTIASecurity+, and Department of Defense (DoD)-Cybersecurity General, are responsible for leading enterprise-wide cybersecurity strategy, policy, standards, architecture and processes.\n In addition, our cybersecurity incident response team is responsible for responding to cybersecurity incidents in accordance with our Computer Security Incident Response Plan. \nProgress and developments in our cybersecurity governance program are communicated to members of the executive team. Our management team takes steps to remain informed about and monitor efforts to prevent, detect, mitigate and remediate cybersecurity risks and incidents through various means, which may include briefings from internal security personnel; threat intelligence and other information obtained from governmental, public or private sources, including third-party consultants engaged by us; and alerts and reports produced by security tools deployed in our IT and OT environments.\n While our board of directors is ultimately responsible for enterprise-wide risk oversight, the board’s committees assist the board in fulfilling its oversight responsibilities in certain areas of risk. \nIn particular, the board’s audit committee is responsible, among other things, for risk management relating to legal and regulatory requirements, including cybersecurity, which plays an integral role in our risk management strategy and continues to be an area of increasing focus for our board, the audit committee and our management team.\nThe audit committee of the \nboard of directors\n receives quarterly updates on the status of our cybersecurity governance program, including as related to new or developing initiatives and any security incidents that may occur. \nBoard members receive presentations on cybersecurity topics from the Senior Vice President and Chief Information Officer as part of the board’s continuing education on topics that impact public companies.\n Further, our code of business conduct and ethics expects all employees to safeguard our electronic communications systems and related technologies from theft, fraud, unauthorized access, alteration or other damage and requires them to report any cyberattacks or incidents, improper access or theft to our Chief Legal and Administrative Officer and the Senior Vice President and Chief Information Officer. Our cybersecurity governance program also includes processes to assess cybersecurity risks related to third-party service providers, suppliers and vendors. Our vendor management process may include reviewing the cybersecurity practices of such provider, contractually imposing obligations on the provider, conducting security assessments and conducting periodic reassessments during their engagement.\nRisks from cybersecurity threats have not materially affected, and are not currently anticipated to materially affect, our Company, including our business strategy, results of operations or financial condition.\n See, however,"
}