{
  "ticker": "GLW",
  "cik": "0000024741",
  "company_name": "CORNING INC /NY",
  "filing_date": "2025-02-13",
  "accession": "0001628280-25-005347",
  "primary_doc": "glw-20241231.htm",
  "item1_text": "Item 1. Business\nGeneral\nCorning traces its origins to a glass business established in 1851. The present corporation was incorporated in the State of New York in December 1936. The Company’s name was changed from Corning Glass Works to Corning Incorporated on April 28, 1989.\nCorning is vital to progress – in the industries we help advance and in the world we share. For more than 170 years, Corning has combined its unparalleled expertise in glass science, ceramic science and optical physics with deep manufacturing and engineering capabilities to develop category-defining products that transform industries and enhance people’s lives. Our materials science and manufacturing expertise, boundless curiosity and commitment to purposeful invention place us at the center of the way the world works, learns and lives. In addition, our sustained investment in research, development and engineering capabilities means we are always ready to solve the toughest challenges alongside our customers.\nOur capabilities are versatile and synergistic, allowing Corning to evolve to meet changing market needs, while also helping customers capture new opportunities in dynamic industries. Today, Corning’s markets include optical communications, mobile consumer electronics, display, automotive, solar, semiconductor and life sciences. Corning’s industry-leading products include damage-resistant cover materials for mobile devices; precision glass for advanced displays; optical fiber, cable and connectivity solutions for advanced communications networks, such as fiber to the home and data centers, enabling artificial intelligence and connections around the world; trusted products to accelerate drug discovery and delivery; and clean-air technologies and technical glass for cars and trucks.\nCorning manufactures products at 124 plants in 15 countries and operates in five reportable segments: Optical Communications, Display Technologies, Specialty Materials, Environmental Technologies and Life Sciences.\nOptical Communications Segment\nWe invented the world’s first low-loss optical fiber in 1970. Since that milestone, we have continued to pioneer optical fiber, cable and connectivity solutions. As global demand driven by video usage grows exponentially, telecommunications networks continue to migrate from copper to optical-based systems that can deliver the required cost-effective capacity. Additionally, the rapid acceleration of artificial intelligence (“AI”) is driving strong demand for fiber and connectivity products inside and between data centers. Our experience puts us in a unique position to design and deliver optical solutions that reach every edge of the communications network. \nThe Optical Communications segment is divided into two main product groupings – carrier network and enterprise network. The carrier network group consists primarily of products and solutions for optical-based communications infrastructure for services such as video, data and voice communications. The enterprise network group consists primarily of optical-based communication networks sold to businesses, governments and individuals for their own use. \nOur carrier network product portfolio encompasses an array of optical fiber products, including Vascade® optical fibers for use in submarine networks; LEAF® optical fiber for long-haul, regional and metropolitan networks; SMF-28® ULL and TXF® fiber for more scalable long-haul and regional networks; SMF-28e+™ single-mode optical fiber providing additional transmission wavelengths in metropolitan and access networks and ClearCurve® ultra-bendable single-mode fiber for use in multiple-dwelling units and fiber-to-the-home applications. For high performance across the range of long-haul, metro, access and fiber-to-the-home network applications, SMF-28® Ultra and SMF-28® Contour fibers deliver industry-leading attenuation, compatibility and improved macrobend performance in one fiber. A portion of our optical fiber is sold directly to end users and third-party cablers globally. Our remaining fiber production is cabled internally and sold to end users as either bulk cable or as part of an integrated optical solution. Our cable products, including the RocketRibbon® and miniXtend® portfolios, support various outdoor, indoor/outdoor and indoor applications and include a broad range of loose tube, ribbon and drop cable designs with flame-retardant versions available for indoor and indoor/outdoor use including 5G networks.\n2\nTable of  Contents\nIn addition to optical fiber and cable, our carrier network product portfolio also includes hardware and equipment products, including cable assemblies, fiber-optic hardware, fiber-optic connectors, optical components and couplers, closures, network interface devices and other accessories. These products may be sold as individual components or as part of integrated optical connectivity solutions designed for various carrier network applications. Examples of these solutions include our Evolv™ platform, which provides pre-connectorized solutions for cost-effectively deploying fiber-to-the-home and 5G networks; and the Centrix platform, which provides a fiber management system with industry-leading density and innovative jumper routing that can be deployed in a wide variety of carrier switching centers.\nOur enterprise network portfolio leverages optical fiber products, including ClearCurve® ultra-bendable multimode fiber for private and hyperscale data centers and other enterprise network applications. \nOur hardware and equipment for enterprise network applications include cable assemblies, fiber-optic hardware, fiber-optic connectors, optical components and couplers, closures and other accessories. These products may be sold as individual components or as part of integrated optical connectivity solutions designed for various network applications, including hyperscale data centers. Examples of enterprise network solutions include the EDGE® platform, which provides high-density pre-connectorized cabling solutions for data center applications, supporting a path to speeds of 400G and beyond and Everon™ Network Solutions, which provide next-generation cellular connectivity products for interior spaces of all sizes. \nWe invented new fibers, cables and connectors to capture the generative AI enterprise demand. These components are being adopted by hyperscale data centers and others focusing on key technology vectors such as density, latency and sustainability. \nOur optical fiber manufacturing facilities are in North Carolina, China, India and Poland. Cabling operations are in North Carolina, Poland and smaller regional locations. Our manufacturing operations for hardware and equipment products are in Texas, Mexico, Brazil, Germany, Poland and China. \nPatent protection is important to the segment’s operations. The segment has an extensive portfolio of patents relating to its products, technologies and manufacturing processes. The segment licenses certain of its patents to third parties and generates revenue from these licenses, although the royalty income is not currently material to this segment’s operating results. We are licensed to use certain patents owned by others, which are considered important to the segment’s operations. Refer to the material under the heading “Patents and Trademarks” for more information. \nThe Optical Communications segment represented 32% of Corning’s total segment net sales in 2024. \nDisplay Technologies Segment\nThe Display Technologies segment manufactures glass substrates for flat panel displays, including liquid crystal displays (“LCDs”) and organic light-emitting diodes (“OLEDs”) that are used primarily in televisions, notebook computers, desktop monitors, tablets and handheld devices. This segment develops, manufactures and supplies high quality glass substrates using technology expertise and a proprietary fusion manufacturing process, which we invented and is the cornerstone of our technology leadership in the display glass industry. Our highly automated process yields glass substrates with a pristine surface and excellent thermal stability and dimensional uniformity – essential attributes in the production of large, high-performance display panels. Our fusion process is scalable and we believe it is the most cost-effective process for producing large size substrates.\nWe are recognized as a world leader in precision glass innovations that enable our customers to produce larger, thinner, more flexible and higher-resolution displays. Some of the product innovations we have launched over the past ten years utilizing our world-class processes and capabilities include the following:\n•\nCorning® EAGLE XG® Slim Glass, Corning’s flagship display glass product enabling thinner televisions and monitors with larger-sized screens; it is trusted by the world’s leading panel makers for LCD displays with more than 30 billion square feet sold;\n•\nCorning® Astra® Glass, an innovative glass solution designed to meet the emerging needs for high-resolution displays. This glass has been optimized for oxide thin-film transistor (“TFT”) backplanes, but enables a range of high-resolution applications from the top end of amorphous silicon (“s-Si”) TFT backplanes through low temperature poly-silicon (“LTPS”) backplanes, as well as other applications requiring precision glass;\n•\nCorning® Lotus™ NXT Glass, a high-performance display glass designed to withstand the harshest panel manufacturing process enabling highest-resolution displays in smaller and flexible devices; and\n•\nThe world’s first Gen 10 and Gen 10.5 glass substrate sizes in support of improved efficiency in manufacturing large-sized displays.\n3\nTable of  Contents\nWe have display glass manufacturing operations in China, South Korea and Taiwan, and service our glass customers in all regions, utilizing our manufacturing facilities throughout Asia.\nPatent protection and proprietary trade secrets are important to the Display Technologies segment’s operations. Refer to the material under the heading “Patents and Trademarks” for more information.\nThe Display Technologies segment represented 27% of Corning’s total segment net sales in 2024. \nSpecialty Materials Segment\nThe Specialty Materials segment manufactures products that provide more than 150 material formulations for glass, glass ceramics and crystals, as well as precision metrology instruments and software to meet requirements for unique customer needs. Consequently, this segment operates in a wide variety of commercial and industrial markets including materials optimized for mobile consumer electronics, semiconductor equipment optics and consumables, aerospace and defense optics, radiation shielding products, sunglasses and telecommunications components.\nOur highly durable glass, known as Corning® Gorilla® Glass, is a chemically strengthened thin glass designed specifically to function as a cover, or back-enclosure glass, for mobile consumer electronic devices such as mobile phones, tablets, laptops and smartwatches. Elegant and lightweight, Corning® Gorilla® Glass is durable enough to resist many real-world events that commonly cause wear or scratch damage and glass failure, while providing optical clarity, touch sensitivity and RF transparency, thus enabling exciting new applications in technology and design. In 2022, Corning unveiled its newest glass innovation, Corning® Gorilla® Glass Victus® 2, which delivers improved cover glass drop performance on rough surfaces like concrete, while preserving the scratch resistance of Corning® Gorilla® Glass Victus®. Corning® Gorilla® Glass is manufactured in the United States (“U.S.”), South Korea and Taiwan.\nWe collaborated with Apple to deliver durable glass with infused color for the back of Apple's iPhone 15 and iPhone 15 Plus devices. These devices also feature Ceramic Shield, a highly transparent, color-free glass-ceramic, which offers unparalleled durability and toughness for smartphones.\nOur semiconductor optics include high-performance optical materials including Corning® HPFS® Fused Silica and Corning® ULE® Ultra-Low Expansion Glass, optical-based metrology instruments and custom optical assemblies for applications in the global semiconductor industry. Additionally, in 2024, we introduced Corning® EXTREME ULE® Glass, a next-generation material that will support chip manufacturers in meeting the rapidly growing demand for advanced and intelligent technologies. Our semiconductor optics products are manufactured in New York.\nWe also manufacture ultra-flat, ultra-thin glass wafers and substrates for a variety of applications including augmented reality, advanced semiconductor packaging, 3D sensing and more. These products are manufactured in New York, France and China. \nOther specialty glass products include tinted sunglasses and radiation shielding products that are made in France.\nPatent protection is important to the segment’s operations. The segment has a growing portfolio of patents relating to its products, technologies and manufacturing processes. Brand recognition and loyalty, through well-known trademarks, are important to the segment. Refer to the material under the heading “Patents and Trademarks” for more information.\nThe Specialty Materials segment represented 14% of Corning’s total segment net sales in 2024.\nEnvironmental Technologies Segment\nThe Environmental Technologies segment manufactures ceramic substrates and filter products for emissions control in mobile applications around the world. In the early 1970s, we developed an economical, high-performance cellular ceramic substrate that is now the standard for catalytic converters in vehicles worldwide. As global emissions control regulations tighten, we have continued to develop more effective and durable ceramic substrate and filter products for gasoline and diesel applications, most recently launching low-mass Corning® FLORA® substrates and Corning® DuraTrap® GC gasoline particulate filters. We manufacture substrate and filter products in New York, Virginia, China and Germany. We sell our ceramic substrate and filter products worldwide to catalyzers and manufacturers of emission control systems who then sell to automotive and diesel vehicle or engine manufacturers. Although most sales are made to the emission control systems manufacturers, the use of our substrates and filters is generally required by the specifications of the automotive and diesel vehicle or engine manufacturers.\n4\nTable of  Contents\nPatent protection is important to the segment’s operations. The segment has an extensive portfolio of patents relating to its products, technologies and manufacturing processes. We are licensed to use certain patents owned by others, which are also considered important to the segment’s operations. Refer to the material under the heading “Patents and Trademarks” for more information.\nThe Environmental Technologies segment represented 12% of Corning’s total segment net sales in 2024.\nLife Sciences Segment\nAs a leading developer, manufacturer and global supplier of laboratory products for over 105 years, the Life Sciences segment works with researchers and drug manufacturers seeking to drive innovation, increase efficiencies, reduce costs and compress timelines. Using unique expertise in the fields of materials science, polymer surface science, cell culture and cell biology, the segment provides innovative solutions that improve productivity and enable breakthrough research for traditional small molecule, or chemical, drugs, biologics, vaccines and emerging cell and gene therapies.\nLife Sciences products include consumables, such as plastic vessels, liquid handling plastics, specialty surfaces, cell culture media and serum, as well as general labware, glassware and equipment. These products are used for drug discovery research and development, compound screening, diagnostics, advanced cell culture research, genomics applications and mass production of cells for clinical trials and bioproduction. \nWe sell life sciences products under the Corning®, Falcon®, PYREX® and Axygen® brands. The products are marketed globally, primarily through distributors, to pharmaceutical and biotechnology companies, contract manufacturing organizations, central testing labs, academic institutions, hospitals, government entities and other facilities. We manufacture these products in California, Illinois, Maine, Massachusetts, New York, North Carolina, Utah, Virginia, China, France, Mexico, Brazil and Poland.\nPatent protection is important to the segment’s operations. The segment has a growing portfolio of patents relating to its products, technologies and manufacturing processes. Brand recognition and loyalty, through well-known trademarks, are important to the segment. Refer to the material under the heading “Patents and Trademarks” for more information.\nThe Life Sciences segment represented 7% of Corning’s total segment net sales in 2024.\nHemlock and Emerging Growth Businesses\nAll other businesses that do not meet the quantitative threshold for separate reporting have been grouped as Hemlock and Emerging Growth Businesses. This group is primarily comprised of the results of Hemlock Semiconductor Group (“HSG”). HSG is a leading provider of high-purity polysilicon products for the solar power and electronics industries. HSG operates in the solar power market, as polysilicon is needed in the manufacturing process to produce sustainable solar power cell, panels and arrays, and the electronics markets, as polysilicon is used to create fabricated wafers and integrated circuit chips used by leading semiconductor manufacturers.\nHemlock and Emerging Growth Businesses also includes our pharmaceutical technologies business, which produces high-quality pharmaceutical glass tubing and vials to meet the rigorous needs of the pharmaceutical industry; our automotive glass solutions business, which enhances vehicle exteriors and interiors with innovations that enable lightweight, damage-resistant windows and displays; as well as other businesses and certain corporate investments.\nHemlock and Emerging Growth Businesses represented 8% of Corning’s total segment net sales in 2024.\nAdditional explanation regarding Corning and its five reportable segments, as well as financial information about geographic areas, is presented in Management’s Discussion and Analysis of Financial Condition and Results of Operations and Note 17 (Reportable Segments) in the accompanying notes to the consolidated financial statements.\n5\nTable of  Contents\nCompetition\nWe compete with many large and varied manufacturers, both domestic and foreign. Some of these competitors are larger than we are, and some have broader product lines. We strive to maintain and improve our market position through technology and product innovation. For the foreseeable future, our competitive advantage lies in our commitment to research and development, deep customer relationships, reliability of supply, product quality, superior customer service and technical specification of our products. There is no assurance that we will be able to maintain or improve our market position or competitive advantage.\nOptical Communications Segment\nWe maintain a leadership position in the segment’s principal product groups, which include carrier and enterprise networks. The competitive landscape includes industry consolidation, pricing pressure and competition for the innovation of new products. These competitive conditions are likely to persist. Our large-scale manufacturing experience, fiber process, technology leadership and intellectual property provide cost advantages relative to several of our competitors. Our principal competitors include CommScope Holding Company, Inc. and Prysmian Group S.p.A.\nDisplay Technologies Segment\nWe are the largest worldwide producer of glass substrates for flat panel displays. The environment for high-performance display glass substrate products is very competitive and we have maintained our competitive advantages by investing in new products, continually improving our proprietary fusion manufacturing process and providing a consistent and reliable supply of high-quality products. Our process allows us to deliver glass that is larger, thinner and lighter, with exceptional surface quality and without heavy metals. Our principal competitors include AGC Inc. and Nippon Electric Glass Co., Ltd.\nSpecialty Materials Segment\nWe have deep capabilities in materials science, optical design, shaping, coating, finishing, metrology and optical system assembly. Our products and capabilities in this segment position us to meet the needs of a broad array of markets, including semiconductor, aerospace, defense, industrial, commercial and telecommunications. Our principal competitors include Schott AG, AGC Inc., Nippon Electric Glass Co., Ltd. and Heraeus.\nEnvironmental Technologies Segment\nWe maintain a strong position in the worldwide market for automotive ceramic substrate and filter products, as well as in the heavy-duty and light-duty diesel vehicle markets. Our competitive advantage in automotive ceramic substrate products for catalytic converters and filter products for particulate emissions in exhaust systems is based on an advantaged product portfolio, collaborative engineering design services, customer service and support, strategic global presence and continued product innovation. Our principal competitors include NGK Insulators, Ltd. and Ibiden Co., Ltd.\nLife Sciences Segment\nWe seek to maintain a competitive advantage by emphasizing product quality, global distribution, supply chain efficiency, a broad product line, technical support and superior product attributes. Our principal competitors include Thermo Fisher Scientific Inc., Avantor, Inc., Greiner AG, Eppendorf SE, Sarstedt AG & Co. KG and Danaher Corporation. Corning also faces competition from large distributors that have pursued backward integration or introduced private label products.\nRaw Materials\nOur manufacturing processes and products require access to uninterrupted power sources, significant quantities of industrial water, certain precious metals and various batch materials. Availability of resources, such as ores, minerals, polymers, lithium, helium and processed chemicals, required in our manufacturing operations appear to be adequate. From time to time, our suppliers may experience capacity limitations in their own operations or may eliminate certain product lines. We have adequate programs to ensure a reliable supply of raw and batch materials, as well as precious metals which are used in our production processes. For many of our materials, we have alternate suppliers that would allow operations to continue without interruption in the event of specific materials shortages.\nCertain key materials and proprietary equipment used in the manufacturing of products are currently sole-sourced or available only from a limited number of suppliers. To minimize this risk, we closely monitor raw materials and equipment with limited availability or sole-sourced suppliers. However, any future difficulty in obtaining sufficient and timely delivery, or inflationary pricing, of components and/or raw materials could result in lost revenue due to delays or reductions in product shipments, or reductions in gross margin.\n6\nTable of  Contents\nPatents and Trademarks\nInventions by members of our research and engineering staff continue to be important to our growth. Patents have been granted on many of these inventions in the U.S. and other countries. Some of these patents have been licensed to other manufacturers. Many of our earlier patents have now expired, but we continue to seek and obtain patents protecting our innovations. In 2024, we were granted about 490 patents in the U.S. and over 1,240 patents in countries outside the U.S.\nEach business segment possesses a patent portfolio that provides certain competitive advantages in protecting our innovations. We have historically enforced, and will continue to enforce, our intellectual property rights. At the end of 2024, we owned about 12,000 unexpired patents in various countries, of which about 4,510 were U.S. patents. Between 2025 and 2027, approximately 730, or 6%, of these worldwide patents will expire, while at the same time we intend to seek patents protecting our newer innovations. Worldwide, we have about 5,880 patent applications in process, with about 1,780 in process in the U.S. Our patent portfolio will continue to provide a competitive advantage in protecting our innovation, although our competitors in each of our businesses are actively seeking patent protection as well.\nWhile each of our reportable segments has numerous patents in various countries, no one patent is considered material to any segment. Important U.S. issued patents in our reportable segments include the following:\n•\nOptical Communications: patents relating to (i) multimode and single mode optical fiber products including low-loss optical fiber, large effective area optical fiber and other high data rate optical fiber, and processes and equipment for manufacturing optical fiber, including methods for making optical fiber preforms and methods for drawing, cooling and winding optical fiber; (ii) optical fiber ribbons and methods for making such ribbon, indoor and outdoor fiber optic cable products and methods for making and installing optical fiber cable; (iii) optical fiber connectors and factory-terminated assemblies, hardware, termination and storage and associated methods of manufacture; and (iv) optical fiber and hybrid fiber-coax wireless communication systems.\n•\nDisplay Technologies: patents relating to glass compositions and methods for the use and manufacture of glass substrates for display applications.\n•\nSpecialty Materials: patents relating to protective cover glass materials and coatings, ophthalmic glasses and polarizing dyes and semiconductor/microlithography optics and blanks, metrology instrumentation and laser/precision optics, glass polarizers, specialty fiber and refractories.\n•\nEnvironmental Technologies: patents relating to cellular ceramic honeycomb products, together with ceramic batch and binder system compositions, honeycomb extrusion and firing processes, and honeycomb extrusion dies and equipment for the high-volume, low-cost manufacture of such products.\n•\nLife Sciences: patents relating to methods and apparatus for the manufacture and use of scientific laboratory equipment including multiwell plates and cell culture products, as well as equipment and processes for cell and gene therapy research.\nThe following table presents the approximate number of patents granted to our reportable segments:\nNumber of patents worldwide\nU.S. patents\nImportant U.S. patents expiring between\n2025 and 2027\nOptical Communications\n4,652\n2,089\n25\nDisplay Technologies\n1,320\n173\n12\nSpecialty Materials\n2,426\n883\n13\nEnvironmental Technologies\n847\n360\n12\nLife Sciences\n547\n161\n6\nMany of our patents are used in operations or are licensed for use by others, and we are licensed to use patents owned by others. We have entered into cross-licensing arrangements with some major competitors, but the scope of such licenses has been limited to specific product areas or technologies.\nOur principal trademarks include the following: Axygen, Celcor, ClearCurve, Contour, Corning, DuraTrap, Eagle XG, Edge8, Everon, Evolv, Falcon, Gorilla, HPFS, Leaf, PYREX, RocketRibbon, SMF-28e, Steuben, UniCam, Valor, Velocity, Victus and Viridian.\n7\nTable of  Contents\nProtection of the Environment\nWe have an extensive program to ensure that our facilities comply with state, federal and foreign pollution-control regulations. This program has resulted in capital and operating expenditures each year. To maintain compliance with such regulations, capital expenditures for pollution control in operations were approximately $10.4 million in 2024 and are estimated to be $14.2 million in 2025.\nOur 2024 consolidated operating results reflect approximately $64.0 million for depreciation, maintenance, waste disposal and other operating expenses associated with pollution control.\nHuman Capital Management Overview\nAt Corning, we are proud of the life-changing innovations we bring to the world. Our unparalleled expertise in our core technologies along with deep manufacturing and engineering capabilities require a talent strategy focused on attracting and retaining exceptional people, building a culture that enables innovation and collaboration and supporting long and successful careers. \nEach of our 56,300 full- and part-time employees in 44 countries make an important contribution, whether in one of our manufacturing or processing facilities, research labs, sales offices or other facilities. Approximately 59% of all employees are in production and maintenance roles and more than 60% of all employees are represented by a union, works council or other representative group.\nValues\nCorning is guided by an enduring set of Values that defines our relationship with employees, customers and our communities: Quality, Integrity, Performance, Leadership, Innovation, Independence and the Individual. Our Values are the key to our business success, a source of pride and excitement for our employees and the factor that ultimately sets us apart from our competitors. In short, we believe that how we do things is as important as what we do. We measure how we live our Values through our annual “Voice to Action” Workplace Culture Survey. In 2024, we had an 85% response rate with survey participation worldwide. We use the results to pinpoint recurring global themes and develop plans to drive action based on employee feedback. Corning employees all contribute to the success of the Company by Living our Values—all seven, all the time, all around the world. \nCorning operates around the globe and builds strong, multifaceted teams in which all employees feel included at work. Our efforts are rooted in our Value of the Individual, by which we acknowledge the belief that the commitment and contributions of all of our employees determines our success. The rich diversity of our experiences, thoughts, and who we are as individuals strengthens the impact of our collective achievements. We value the unique ability of each individual to contribute, and we intend that all employees shall have the opportunity to participate fully, to grow professionally, and to develop to their highest potential.\nOur global workforce is comprised of 60.5% men and 39.5% women. In all regions of the world, we maintain a talent pipeline that includes people of all backgrounds through our effective recruitment process, mentoring and coaching programs, networking opportunities, and proactive career discussions. As a result of these efforts, we have expanded the quality and depth of experience within our leadership teams.\nTalent Management\nEach year we formally evaluate the talent implications of our strategic business plans and align our actions and objectives accordingly. As business needs change, we create human capital objectives to ensure we have the right people with the right skills in place to deliver that growth.\nCorning is committed to attracting and recruiting highly qualified candidates of all backgrounds to sustain our culture of innovation and to stimulate creativity. We have established a strategic talent pipeline by partnering with schools around the world with exceptional strength in the material sciences and other fields relevant to our Company's business, including renowned MBA schools and top engineering and scientific schools. We engage with professional organizations, engineering societies and other industry organizations to connect us with talented candidates from a multitude of backgrounds and disciplines. We offer internships, co-ops, rotational leadership programs and other developmental opportunities to talented candidates. Our recruitment strategy is centered on the belief that when a workforce fosters rich and varied ideas, the overall quality of our solutions is enhanced.\n8\nTable of  Contents\nIt is important to Corning that employees continue to grow and develop. We offer a variety of enterprise and on-demand developmental programs and experiences, targeted to all levels in the organization. We provide on-the-job learning experience, mentoring and career planning to ensure immediate application and lasting impact. Talent retention is an ongoing focus area which aligns with our strategy of encouraging and supporting longer-term careers with Corning. Historically, our salaried voluntary turnover has been consistently lower than the markets in which we compete for talent. Salaried talent retention in 2024 remained strong at 95.7%.\nAt Corning, the health and safety of our workforce is always of paramount consideration. Our safety standards meet, and often exceed, local regulatory standards. Corning continued managing Total Recordable Incident Rate (“TRIR”) performance to world class levels with an annual TRIR of just 0.29 in 2024. Globally, we promote employee health and wellbeing through wellness programs which vary by region such as nutrition and fitness-related offerings, smoking cessation programs and smoke free campuses. Corning also promotes healthy behaviors with its employees and has introduced global programs emphasizing mental health and wellness programs.\n9\nTable of  Contents\nExecutive Officers of the Registrant \nJaymin Amin\n Senior Vice President and Chief Technology Officer\nDr. Amin joined Corning in 1997 as a senior research scientist. He held numerous operational roles within Photonics before joining Corning Specialty Materials in 2004. He led product and process development, product engineering and commercial technology for Gorilla Glass and later for Mobile Consumer Electronics. In 2020, Dr. Amin was appointed vice president and general manager, Corning Gorilla Glass, Mobile Consumer Electronics, and in June 2022 he was appointed senior vice president and chief technology officer. Age 56. \nStefan Becker\n Senior Vice President, Finance and Corporate Controller\nMr. Becker joined Corning in 2000 through Corning’s acquisition of Siemens Communication Cable Division. From 2001 to 2005, he held positions as manager, Planning and Analysis and later director of Finance, Corning Cable Systems. He joined the Display Technologies division in 2005 as U.S. Controller. In 2007 he was appointed CFO, Corning Display Technologies Taiwan. In 2009 he was named director of Finance, Corning Display Technologies (“CDT”) and in 2010 was appointed division controller, CDT. Between 2012 and 2015, he served as international division vice president, Finance, Corning Glass Technologies. Mr. Becker was appointed Corning’s operations controller in 2015 and senior vice president in 2019. In 2021 he was appointed senior vice president, Finance, and corporate controller and in February 2022 he was named principal accounting officer. Age 53.\nLi Fang \nSenior Vice President, Corning International and New Business Development, Solar\nMr. Fang joined Corning International in 1997 as business development manager, China. In 1999 he transferred to the Environmental Products Division and became production manager of Corning Environmental Technologies’ (“CET”) China Plant - Corning (Shanghai) Company Ltd. In July 2004, he was appointed operations manager and in October 2004 he was appointed director of operations and plant manager of Corning (Shanghai) Company Ltd. In 2007, Mr. Fang was appointed vice president, Corning Display Technologies China, and director of commercial operations, government affairs and supply chain. In 2009 he was named president, Corning Display Technologies China. From 2012-2021 Mr. Fang served as president and general manager of Corning Greater China. In 2021 he was appointed as president and general manager, International, Corning Incorporated and in 2023 he was appointed senior vice president, Corning International and new business development, Solar. Age 62.\nJordana D. Kammerud \nSenior Vice President and Chief Human Resources Officer\nMs. Kammerud joined Corning in 2023 with more than 20 years of experience leading progressive HR functions and has deep expertise in people, technology, and change on a global scale and across multiple industries. Prior to joining Corning, she served as executive vice president and chief human resources officer at Claire’s, where she was responsible for global human resources, as well as corporate strategy, and enterprise transformation management. Additionally, she led numerous technology, capability, and culture investments. Prior to that role, Ms. Kammerud served as senior vice president, chief human resources officer, at Core-Mark. She has also held human resources leadership positions with SC Johnson, American Express, and DaimlerChrysler. Age 48.\nEric S. Musser \nPresident and Chief Operating Officer\nMr. Musser joined Corning in 1986 and served in a variety of manufacturing and general management roles in Corning’s Optical Communications businesses. In 2005, he was named vice president and general manager of Optical Fiber. Mr. Musser served as general manager, Corning Greater China from 2007 to 2012 and president of Corning International from 2012 to 2014. In 2014, he was appointed executive vice president, Corning Technologies and International. In 2020, he was appointed president & chief operating officer. Age 65.\nAvery H. Nelson III \nSenior Vice President and General Manager, Automotive, Life Sciences & Solar\nMr. Nelson joined Corning in 1991 as shift supervisor at the Harrodsburg, Kentucky plant and subsequently served in progressive roles in Corning Display Technologies. In 2007, he joined CET as general manager, Corning (Shanghai) Company Limited. In 2009, he became general manager and regional director of China and India, CET. In 2010 he returned to the U.S. as program director, CET. In 2011, he assumed the role of business director, AAA Corning® Gorilla® Glass, New Business Development. Later that year, he was appointed division vice president, Heavy Duty Diesel. In 2014, Mr. Nelson was appointed vice president and general manager for CET and was named senior vice president and general manager, CET, in 2018. In 2020 he was appointed senior vice president and general manager, Automotive. His role was expanded in 2023 to include development of new business opportunities in solar markets. He was appointed senior vice president and general manager, Automotive, Life Sciences & Solar in 2024. Age 56.\nMichael P. O’Day \nSenior Vice President & General Manager Optical Communications\nMr. O’Day joined Corning in 1998 with Siecor, which later became Corning Cable Systems (“CCS”). He worked in both the Strategy and Marketing organizations for CCS through 2003. From 2004 to 2010 he served in CCS’s Optical Connectivity Product Line Management organization. In 2010 Mr. O’Day was appointed program manager for Corning’s IDAS Wireless Program. In 2017 he became the head of Product Line Management for Optical Connectivity Solutions. Prior to his current role, Mr. O’Day served as vice president of Corning Optical Communications (“COC”) Technology and Program Management Office. He was appointed senior vice president & general manager, Optical Communications in 2024. Age 55.\n10\nTable of  Contents\nEdward A. Schlesinger \nExecutive Vice President and Chief Financial Officer\nMr. Schlesinger joined Corning in 2013 as senior vice president and chief financial officer of Corning Optical Communications. He was appointed vice president and corporate controller in September 2015 and principal accounting officer in December 2015. He was named senior vice president in 2019. In 2022, he was appointed executive vice president and chief financial officer. Prior to joining Corning, Mr. Schlesinger served in various finance leadership roles with American Standard and Ingersoll Rand. Age 57.\nSoumya Seetharam \nSenior Vice President and Chief Digital & Information Officer\n \nMs. Seetharam joined Corning in November 2022 as senior vice president and chief digital & information officer. Prior to joining Corning, she was vice president and general manager of Information Technology at Intel Corporation driving information technology (“IT”) vision and strategy for Corporate Functions. She also served as chief systems officer at Anadarko Petroleum Corporation. Ms. Seetharam brings deep experience in information technology, digital and systems transformation and risk governance to Corning. Age 49. \nLewis A. Steverson \nExecutive Vice President and Chief Legal & Administrative Officer\nMr. Steverson joined Corning in 2013 as senior vice president and general counsel. In 2018 he was named executive vice president and general counsel. He was appointed chief legal & administrative officer in 2020. Prior to joining Corning, Mr. Steverson served as senior vice president, general counsel, and corporate secretary of Motorola Solutions, Inc. During his 18 years with Motorola, he held a variety of law leadership roles across the company’s numerous business units. Prior to Motorola, Mr. Steverson was in private practice at the law firm of Arnold & Porter. Age 61.\nMichaune D. Tillman \nSenior Vice President and General Counsel\nMs. Tillman joined Corning in 2024 with more than 25 years of domestic and international experience as an attorney and trusted advisor. Prior to joining Corning, she served as General Counsel and Corporate Secretary of Worthington Steel, Inc. She also previously served as General Counsel at Worthington Steel Processing and Worthington Armstrong Venture (“WAVE”). Across these roles, Ms. Tillman led corporate governance matters, litigation, commercial transactions, regulatory, antitrust, environmental health and safety, cyber security, data privacy, import/export, labor and employment, intellectual property and compliance. Prior to WAVE, she served in executive leadership roles at Ricoh Americas Corporation including deputy general counsel and as employment and commercial litigation counsel at IKON Office Solutions. Age 53.\nRonald L. Verkleeren \nSenior Vice President, Emerging Innovations Group \nMr. Verkleeren joined Corning in 2001 in the Optical Communications segment. He joined the Life Sciences segment in 2004 and has held a variety of progressive roles in that segment. In 2010, he was named division vice president and director of Advanced Life Sciences. In 2012 he was named division vice president and program director for Corning Pharmaceutical Technologies. In 2015, Mr. Verkleeren became vice president and general manager of the Pharmaceutical Technologies division. In 2020 he was appointed senior vice president & general manager, Life Sciences Technologies. He was appointed senior vice president, Emerging Innovations Group in 2024. Age 54.\nWendell P. Weeks \nChairman and Chief Executive Officer\nMr. Weeks joined Corning in 1983 in the finance group. He has held a variety of financial, business development, commercial and general management roles. He was named vice president and general manager of the Optical Fiber business in 1996 and president of Corning’s Optical Communications division in 2001. He became Corning’s president and chief operating officer in 2002. Mr. Weeks has been a member of Corning’s Board of Directors since December 2000. He was named chief executive officer in 2005 and chairman of the board in 2007. Mr. Weeks is a director of Amazon.com, Inc. Age 65.\nJohn Z. Zhang \nSenior Vice President and General Manager, Corning Glass Innovations & Corning Asia\nMr. Zhang joined Corning in 2008 and has held a variety of progressive roles in Strategy, Mergers & Acquisitions, and Business Development. In 2010, he further expanded his role, leading the Strategy & Corporate Development organization of Corning International. In 2014, he was named deputy general manager, Corning Display Technologies. In 2020, Mr. Zhang was appointed senior vice president and general manager, Corning Display and was appointed as senior vice president and general manager, Display & Corning Asia in 2023. He was appointed senior vice president and general manager, Corning Glass Innovations & Corning Asia in 2024. Age 52.\n11\nTable of  Contents\nDocument Availability\nA copy of Corning’s 2024 Annual Report on Form 10-K filed with the United States Securities and Exchange Commission (the “SEC”) is available upon written request to Corporate Secretary, Corning Incorporated, One Riverfront Plaza, Corning, NY 14831. The Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments pursuant to Section 13(a) or 15(d) of the Exchange Act of 1934 and other filings are available as soon as reasonably practicable after such material is electronically filed or furnished to the SEC, and can be accessed electronically free of charge at www.SEC.gov, or through the Investor Relations page on Corning’s website at www.corning.com. The information contained on the Company’s website is not included in, or incorporated by reference into, this Annual Report on Form 10-K.\nOther\nAdditional information in response to Item 1 is found in Note 17 (Reportable Segments) in the accompanying notes to the consolidated financial statements.\n12\nTable of  Contents"
}