{
  "ticker": "LNT",
  "cik": "0000352541",
  "company_name": "ALLIANT ENERGY CORP",
  "filing_date": "2025-02-21",
  "accession": "0000352541-25-000014",
  "primary_doc": "lnt-20241231.htm",
  "item1_text": "ITEM 1. BUSINESS\nA. GENERAL\nAlliant Energy maintains its principal executive offices in Madison, Wisconsin.  Alliant Energy operates as a regulated investor-owned public utility holding company, and its purpose-driven strategy is to serve its customers and build stronger communities.  Alliant Energy’s primary focus is to provide regulated electric and natural gas service to approximately 1,000,000 electric and approximately 430,000 natural gas customers in the Midwest through its two public utility subsidiaries, IPL and WPL.  The primary first tier wholly-owned subsidiaries of Alliant Energy are as follows:\n3\nTable of C\no\nntents\n                                    \n1) IPL -\n is a public utility engaged principally in the generation and distribution of electricity and the distribution and transportation of natural gas to retail customers in select markets in Iowa.  IPL provides utility services to incorporated communities as directed by the IUC and utilizes non-exclusive franchises, which cover the use of public right-of-ways for utility facilities in incorporated communities for a maximum term of 25 years.  At December 31, 2024, IPL supplied electric and natural gas service to approximately 500,000 and 230,000 retail customers, respectively, in Iowa.  IPL also sells electricity to wholesale customers in Minnesota (IPL’s related wholesale power agreement expires July 2025), Illinois and Iowa.  IPL is also engaged in the generation and distribution of steam for two customers in Cedar Rapids, Iowa, which are each under contract through 2025 for taking minimum quantities of annual steam usage, with certain conditions, after which IPL expects to exit the steam business.\n2) WPL -\n is a public utility engaged principally in the generation and distribution of electricity and the distribution and transportation of natural gas to retail customers in select markets in Wisconsin.  WPL operates in municipalities pursuant to permits of indefinite duration and state statutes authorizing utility operation in areas annexed by a municipality.  At December 31, 2024, WPL supplied electric and natural gas service to approximately 500,000 and 200,000 retail customers, respectively.  WPL also sells electricity to wholesale customers in Wisconsin.\n3) CORPORATE SERVICES -\n provides administrative services to Alliant Energy, IPL, WPL and AEF.\n4) AEF -\n Alliant Energy’s non-utility holdings are organized under AEF, which manages a portfolio of wholly-owned subsidiaries and additional holdings, including the following distinct platforms:\nATI\n - currently holds all of Alliant Energy’s interest in ATC Holdings.  ATC Holdings is comprised of a 16% ownership interest in ATC and a 20% ownership interest in ATC Holdco LLC.  ATC is an independent, for-profit, transmission-only company.  ATC Holdco LLC holds an interest in Duke-American Transmission Company, LLC, a joint venture between Duke Energy Corporation and ATC, that owns electric transmission infrastructure in North America.\nCorporate Venture Investments\n - includes various minority ownership interests in regional and national venture funds, including a global coalition of energy companies working together to help identify and research innovative technologies and business models within the emerging energy economy.\nNon-utility Wind Farm\n - includes a 50% cash equity ownership interest in a 225 MW non-utility wind farm located in Oklahoma.\nSheboygan Falls Energy Facility\n - is a 347 MW, simple-cycle, natural gas-fired EGU near Sheboygan Falls, Wisconsin, which is currently leased to WPL through 2044.  Refer to \nNote \n9\n for additional information on WPL’s Sheboygan Falls Energy Facility lease.\nTravero\n - is a supply chain solutions company, including a short-line rail freight service in Iowa; a Mississippi River barge, rail and truck freight terminal in Illinois; freight brokerage services; wind turbine blade recycling services; and a rail-served warehouse in Iowa.\nDevelopment-ready Sites\n - includes various rail-served and ready-to-build manufacturing and industrial sites throughout Alliant Energy’s service territories, with access to various airports and interstate freeways.\nB. INFORMATION RELATING TO ALLIANT ENERGY ON A CONSOLIDATED BASIS\n1) HUMAN CAPITAL MANAGEMENT - \nAlliant Energy’s core purpose is to serve customers and build stronger communities.  We constantly strive to attract, retain and develop a qualified workforce of high-performing employees and foster an environment of high levels of engagement.\nEmployees\n - \nAt December 31, 2024, Alliant Energy, IPL and WPL had the following full- and part-time employees:\nTotal\nNumber of\nPercentage of Employees\nNumber of\nBargaining Unit\nCovered by Collective\nEmployees\nEmployees\nBargaining Agreements\nAlliant Energy\n2,998\n1,732\n58%\nIPL\n1,043\n759\n73%\nWPL\n1,003\n860\n86%\nThe majority of IPL’s bargaining unit employees are covered by the International Brotherhood of Electrical Workers Local 204 (Cedar Rapids) collective bargaining agreement, which expires August 31, 2028.  All of WPL’s bargaining unit employees are covered by the International Brotherhood of Electrical Workers Local 965 collective bargaining agreement, which expires May 31, 2026.\n4\nTable of C\no\nntents\n                                    \nSafety\n - \nSafety is integral to our company’s culture.  It is one of our Values - “Live safety. Everyone. Always.  Our first priority is that nobody gets hurt.”  Alliant Energy is committed to providing a safe environment for our employees, visitors, customers, contractors, vendors and the communities in which we live and work.\nWe focus on the proactive management of our safety performance.  Our comprehensive behavioral safety-based program consists of leading indicators, lagging indicators and targeted focus programs.  We utilize a formal safety management system to capture and track best practices, near misses, job site briefings, safety observations, safety conversations and any unsafe conditions.  This system provides the insights needed to help drive a positive safety culture and help ensure compliance with safety rules, processes and procedures.  We also use this system to broadly share lessons learned in support of shaping the mindsets and behaviors needed to help prevent similar events from occurring elsewhere.  Collectively, this information is used to evaluate the safety performance of the executive and management teams related to their goals, and safety metrics are factored into short-term incentive awards.\nWe maintain executive and local safety leadership teams to establish our safety vision, strategy and priorities, and ensure education and recognition of employee actions that improve our safety culture.  This leadership provides strong support for sustained growth of both employee and public safety programs and initiatives.\nPublic safety is equally important, as we interact with our customers to provide energy to their homes and businesses.  We offer awareness campaigns, natural gas and electric public safety presentations, and free online resources and training programs and guidance to assist local emergency responders.\nTotal Rewards\n - \nOur market-competitive Total Rewards programs are designed to meet the varied and evolving needs of our employees.  Through a variety of health, welfare and compensation programs, we offer employees choice and control, and help support their financial, physical, and mental well-being.  We provide tools and resources to employees to help maintain and improve their health.  Short- and long-term incentive plans have a mix of operational and financial metrics that align employees with strategic corporate goals.\nIn addition to competitive salaries and wages, our Total Rewards programs include:\n•\ncompetitive short- and long-term incentive compensation;\n•\na 401(k) savings plan with an employer contribution and employer match;\n•\nhealthcare and insurance benefits, including medical, vision, dental, life, short-term disability, and long-term disability insurance;\n•\nhealth savings and flexible spending accounts;\n•\nenhanced offerings to support the well-being of employees and their families;\n•\npaid time off to use for vacation, personal time, sick time, holidays, bereavement, jury duty, military leave, parental leave, maternity leave, and adoption leave;\n•\nadoption assistance;\n•\nlegal planning assistance;\n•\ntuition reimbursement;\n•\nVacation Donation program; and\n•\nVolunteer Grants and a Matching Gifts program.\nAnnually, Alliant Energy awards up to 25 scholarships to children of its current employees and eligible retirees.  Award recipients have achieved excellent records in high school, are pursuing a higher education, and \nmay enroll in any accredited two- or four-year college, university or vocational-technical school in the U.S.\nEmployee Engagement\n - \nA workplace where everyone feels meaningful connection to work and company goals is crucial for the success and retention of our employees, to attract future talent and to execute our purpose-driven strategy to serve our customers and build stronger communities.  It is one of our Values - “Care for others: Together we create a workplace where people feel like they can use their backgrounds, talents and perspectives to their fullest potential.”  Alliant Energy believes the achievement of its strategic objectives can only be achieved with a focused and engaged workforce.\nOur efforts to advance employee engagement in our workforce include:\n•\nLearning: We offer various learning opportunities for employees, such as participating in area summits, supporting company-wide listening sessions, providing training opportunities, and hosting speakers, among other programs, as well as leaders facilitating conversations around employee engagement, helping to ensure employees are seen, heard and valued;\n•\nListening and responding: We collect and act upon feedback through employee sentiment surveys;\n•\nEmpowering: We promote and foster an engaged workforce, providing opportunities to collaborate, network, and share their insights and talents; and\n•\nLeading: Our Leadership Team identifies and champions initiatives to help advance a culture that values employee engagement.\n5\nTable of C\no\nntents\n                                    \nTalent Development and Workforce Readiness\n - \nWe support all employees in their skill development and career growth, offering several training opportunities, development programs and tuition reimbursement, as well as leadership development and succession planning.  Development goals and conversations with leadership help identify opportunities to learn through a mix of on-the-job experience, collaboration and formal content to build needed skills for today and the future.\nTo help attract and introduce a wide range of candidates to our industry, we have early careers programs that include apprenticeships, youth programs (high school) and internships (college).  Our programs provide a pipeline of talented students to engage in meaningful, hands-on work experiences.  Our apprenticeship program combines supervised, structured on-the-job training with related instruction to produce highly skilled trade and technical workers, and builds lifetime skills and comprehensive knowledge in the high-demand technical trades necessary for our success.  The apprenticeship program gives us the flexibility to tailor training to match our needs - training employees in our facilities, on our equipment, and consistent with\n \nour\n \nsafety standards and employee expectations.  We instill company Values, methods and procedures from day one.\n2) REGULATION - \nAlliant Energy, IPL and WPL are subject to regulation by various federal, state and local agencies.  The following includes the primary regulations impacting Alliant Energy’s, IPL’s and WPL’s businesses.\nFERC\n -\nPublic Utility Holding Company Act of 2005 - \nAlliant Energy is registered with FERC as a public utility holding company, pursuant to the Public Utility Holding Company Act of 2005, and is required to maintain certain records and to report certain transactions involving its public utilities, service company and other entities regulated by FERC.  Corporate Services, IPL and WPL are subject to regulation by FERC under the Public Utility Holding Company Act of 2005 for various matters including, but not limited to, affiliate transactions, public utility mergers, acquisitions and dispositions, and books, records and accounting requirements.\nEnergy Policy Act of 2005 - \nThe Energy Policy Act of 2005 requires creation of an Electric Reliability Organization to provide oversight by FERC.  FERC designated North American Electric Reliability Corporation, which also provides oversight of cybersecurity standards, as the overarching Electric Reliability Organization.  Midwest Reliability Organization, which is a regional member of North American Electric Reliability Corporation, has direct responsibility for mandatory electric reliability standards for IPL and WPL.\nFederal Power Act of 1935 - \nFERC also has jurisdiction, under the Federal Power Act of 1935, over certain electric utility facilities and operations, electric wholesale sales, interstate electric transmission rates, dividend payments, issuance of IPL’s securities, and accounting practices of Corporate Services, IPL and WPL.\nElectric Wholesale Rates\n - FERC has authority over IPL's and WPL's wholesale electric market-based rates.  Market-based rate authorization allows for wholesale sales of electricity within FERC’s wholesale markets, including the MISO market, and in transactions directly with third parties, based on the market value of the transactions.  IPL and WPL also have FERC-approved cost of service formula-based rates related to the provision of firm full- and partial-requirement wholesale electric sales, which allow for true-ups to actual costs, including fuel costs.\nElectric Transmission Rates\n - FERC regulates the rates charged for electric transmission facilities used in interstate commerce.  IPL and WPL do not own or operate FERC-regulated electric transmission facilities; however, both IPL and WPL pay for the use of the interstate electric transmission system based upon FERC-regulated rates.  IPL and WPL rely primarily on the use of the ITC and ATC transmission systems, respectively.\nNatural Gas Act\n - FERC regulates the transportation and sale for resale of natural gas in interstate commerce under the Natural Gas Act.  Under the Natural Gas Act, FERC has authority over certain natural gas facilities and operations of IPL and WPL.\nIUC\n -\n IPL is subject to regulation by the IUC for various matters including, but not limited to, retail utility rates and standards of service, accounting requirements, the construction of EGUs, and the acquisition, sale or lease of assets with values that exceed 3% of IPL’s revenues.  In Iowa, counties and cities are prohibited from regulating the sale of natural gas and propane, which supports IPL’s ability to provide gas utility service to retail customers and industries.\n6\nTable of C\no\nntents\n                                    \nRetail Utility Base Rates - \nIPL files periodic requests with the IUC for retail rate changes and may base those requests on either historical or forward-looking test periods.  The IUC must decide on requests for retail rate changes within 10 months of the date of the application for which changes are filed, subject to certain exceptions.  The historical test periods may be adjusted for certain known and measurable changes to capital investments, cost of capital and operating and maintenance expenses consistent with IUC rules and regulations.  The IUC has rules that establish minimum filing requirements for rate reviews using a forward-looking test period, and a related subsequent proceeding review after the close of the forward-looking test period.  The rules provide that in the subsequent proceeding review, a utility’s actual costs and revenues will be presumed to be reasonably consistent with the forward-looking test period if the utility’s actual return on common equity falls within a standard of reasonableness of 50 basis points above to 50 basis points below the authorized return on common equity.  If the utility’s actual return on common equity is outside of this range, future rates could be adjusted.  In addition, the rules require that IPL must receive an order from the IUC related to the subsequent proceeding review before it can file another rate review.  Also, IPL is required to defer a portion of its earnings if its annual regulatory return on common equity exceeds certain levels.  Refer to “\nRate Matters\n” in MDA for discussion of IPL’s retail electric base rate moratorium from October 2025 through September 2029 approved by the IUC in IPL’s most recent retail electric rate review.\nEnergy Efficiency - \nIn accordance with Iowa law, IPL is required to file an energy efficiency plan (EEP) every five years with the IUC.  An EEP provides a utility’s plan and related budget to achieve specified levels of electric and gas energy savings.  IUC approval demonstrates that IPL’s EEP is reasonably expected to achieve cost-effective delivery of the energy efficiency programs.  Refer to \nNote 1(g)\n for discussion of the recovery of these costs from IPL’s retail electric and gas customers.\nElectric Generating Units - \nIPL must obtain a certificate of public convenience, use and necessity (GCU Certificate) from the IUC in order to construct a new, or significantly alter (including fuel switching) an existing, EGU or energy storage facility located in Iowa with a nameplate generating capacity of 25 MW or more.  IPL’s ownership and operation of EGUs (including those located outside the state of Iowa) to serve Iowa customers is subject to retail utility rate regulation by the IUC.\nGas Pipeline Projects - \nIPL must obtain a pipeline permit from the IUC related to the siting of utility gas pipelines in Iowa that will be operated at a pressure over 150 pounds per square inch and will transport gas to a distribution system or single, large volume customer.\nAdvance Rate-making Principles - \nIowa law allows Iowa utilities to request rate-making principles prior to making certain investments in Iowa.  As a result, IPL may file for, and the IUC must render a decision on, rate-making principles for certain new EGUs located in Iowa, including any alternate energy production facility (such as a wind, solar, energy storage or nuclear-fired facility), combined-cycle natural gas-fired EGU, and certain base-load EGUs with a nameplate generating capacity of 300 MW or more.  Advance rate-making principles are also available for the repowering of an alternative energy production facility or certain significant alterations of an existing EGU.  Upon approval of rate-making principles by the IUC, IPL must either construct the EGU or repower the alternative energy production facility under the approved rate-making principles, or not at all.  If rate-making principles are not approved by the IUC, IPL may construct the facility, subject to other applicable approvals (such as a GCU Certificate), subject to recovery in future rate reviews.\nThe IUC’s 2023 order for the advance rate-making principles for IPL’s 400 MW of solar generation projects placed in service in 2024 included a consumer protection plan, which monitors IPL’s achievement of certain aggregate summer capacity factors for those projects during June, July and August each calendar year over 30 years.  Actual three-year rolling average summer capacity factors will be compared to target capacity factors, which may result in surpluses or deficits that would be offset against one another and contribute to an accumulated balance in a given calendar year.  Surpluses or deficits will be capped at $3 million in aggregate per year.  At the end of the program, any accumulated deficit balance would be addressed in IPL’s next rate review, and any accumulated surplus balance would not result in any return to IPL.\nElectric Generating Unit Environmental Controls Projects \n- At its sole discretion, IPL may submit an updated emissions plan and budget to the IUC setting out a multi-year plan and budget for managing regulated emissions from its coal-fired EGUs in a cost-effective manner.  IPL must simultaneously submit this plan and budget to the Iowa Department of Natural Resources for a determination of whether the plan and budget meet state environmental requirements for regulated emissions.  The reasonable and prudent costs associated with implementing the approved plan are expected to be included in IPL’s future retail electric rates.\nPSCW\n -\n WPL is subject to regulation by the PSCW related to its operations in Wisconsin for various matters including, but not limited to, retail utility rates and standards of service, accounting requirements, issuance and use of proceeds of securities, affiliate transactions, approval of the location and construction of EGUs and certain other additions and extensions to facilities.  In addition, Alliant Energy is subject to regulation by the PSCW for the type and amount of Alliant Energy’s holdings in non-utility businesses and other affiliated interest activities, among other matters.\nRetail Utility Base Rates - \nWPL files periodic requests with the PSCW for retail rate changes, which are based on forward-looking test periods.  There is no statutory time limit for the PSCW to decide on retail base rate requests.  However, the PSCW attempts to process retail base rate reviews in approximately 10 months and has the ability to approve interim retail rate relief, subject to refund, if necessary.  Currently, WPL is required to defer a portion of its earnings if its annual regulatory return on common equity exceeds certain levels.\n7\nTable of C\no\nntents\n                                    \nPublic Benefits - \nWPL contributes 1.2% of its annual retail utility revenues to help fund Focus on Energy, Wisconsin’s state-wide energy efficiency and renewable energy resource program.  In addition, WPL contributes to a program that provides assistance to income-eligible residents in Wisconsin.  These contributions are recovered from customers through a monthly bill surcharge of the lesser of 3% of customers’ utilities bills or $750.  Refer to \nNote 1(g)\n for discussion of the recovery of these costs from WPL’s retail electric and gas customers.\nNew Electric Generating Units - \nA CA application is required to be filed with the PSCW for construction approval of any new EGU (including energy storage) with a capacity of less than 100 MW and a project cost of $16.3 million or more.  WPL must obtain a CPCN from the PSCW in order to construct a new EGU (including energy storage) in Wisconsin with a capacity of 100 MW or more.  In addition, WPL’s ownership and operation of EGUs (including those located outside the state of Wisconsin) to serve Wisconsin customers are subject to retail utility rate regulation by the PSCW.\nElectric Generating Unit Upgrades and Electric Distribution Projects - \nA CA application is required to be filed with the PSCW for construction approval of any additions to EGUs, including environmental controls projects, as well as electric distribution projects, with estimated project costs of $16.3 million or more.\nGas Distribution Projects - \nA CA application is required to be filed with the PSCW for construction approval of gas projects with an estimated project cost of $8.1 million or more and at any time that WPL requests to extend gas service to a new portion of its service territory.\nAdvance Rate-making Principles -\n Wisconsin law provides Wisconsin utilities with the opportunity to request rate-making principles prior to the purchase or construction of any EGU utilized to serve Wisconsin customers.  WPL is not obligated to file for or accept authorized rate-making principles under Wisconsin law.  WPL can proceed with an approved project under traditional rate-making terms or accept authorized rate-making principles under Wisconsin law.\nDepartment of Homeland Security Transportation Security Administration\n -\n Alliant Energy, IPL and WPL are subject to regulation for physical and cybersecurity of their natural gas pipeline systems, and are applying, and monitoring for changes to, these requirements to their pipeline systems.\nEnvironmental\n - \nAlliant Energy, IPL and WPL are subject to regulation of environmental matters by federal, state and local authorities as a result of their current and past operations.  Alliant Energy, IPL and WPL monitor these environmental matters and address them by installing controls that reduce emissions and by implementing operational modifications or other measures to address compliance obligations.  There is currently significant regulatory uncertainty with respect to environmental rules and regulations discussed below.  Given the evolving nature of environmental regulations and other related regulatory requirements, Alliant Energy, IPL and WPL develop and periodically update their compliance plans to address these environmental obligations.  Prudent expenditures incurred by IPL and WPL to comply with environmental requirements are eligible to be recovered in rates from their customers.  The following are major environmental matters that could potentially have a significant impact on financial condition and results of operations.\nAir Quality -\nClimate Change and Greenhouse Gas Regulations\n - In 2007, the Supreme Court provided direction on the EPA’s authority to regulate GHG and ruled that these emissions are covered by the CAA.  In 2009, the EPA issued a ruling that found GHG emissions contribute to climate change and therefore threaten public health and welfare, which is the basis for implementing CO2 reduction standards under the CAA.  The primary GHG directly emitted from Alliant Energy’s utility operations is CO2 from the combustion of fossil fuels at its EGUs.\nClean Air Act Section 111(d)\n - In May 2024, the EPA enacted the final Section 111(d) rule under the CAA for certain fossil-fueled EGUs, which requires states to implement plans to reduce CO2 emissions through various Best System of Emission Reduction (BSER) measures at affected sources, including retirement, enforceable limits on operational capacity, co-firing with low-GHG fuels, or carbon capture and energy storage technology.  State plans are subject to EPA approval, and must be submitted by May 2026.  The final rule’s compliance requirements will be phased in beginning in 2030 and covers fossil-fueled EGUs that utilize steam boilers to generate electricity, including IPL’s coal-fired Ottumwa Generating Station, George Neal Generating Station, Prairie Creek Generating Station Unit 3 and Louisa Generating Station, WPL’s coal-fired Edgewater Generating Station Unit 5 (WPL currently plans to convert Edgewater Unit 5 to natural gas in 2028, subject to regulatory approvals), and IPL’s natural gas-fired Burlington Generating Station and Prairie Creek Generating Station Unit 4.  The final rule does not apply to EGUs that are retired by January 2032.  If WPL’s coal-fired Columbia Energy Center is retired by the end of 2029, the final rule would not be applicable; however, if WPL converts Columbia Unit 1 and/or Unit 2 to natural gas, then the final rule would be applicable for the EGUs that are converted.  In addition, the final rule does not impact existing natural gas-fired combustion turbines, including IPL’s Marshalltown Generating Station and Emery Generating Station, and WPL’s Riverside Energy Center and West Riverside Energy Center; however, these EGUs could be subject to future Section 111(d) rules to reduce CO2 emissions from existing combustion turbines.  Alliant Energy, IPL and WPL are currently unable to predict with certainty the future outcome or impact of these matters, including resolution of ongoing litigation.\n8\nTable of C\no\nntents\n                                    \nClean Air Act Section 111(b)\n - In 2015, the EPA published final standards under Section 111(b) of the CAA, which establish CO2 emissions limits for certain new fossil-fueled EGUs, including IPL’s Marshalltown Generation Station and WPL’s West Riverside Energy Center.  In addition, in May 2024, the EPA enacted final revised standards under Section 111(b), which establish CO2 emissions limits from certain new and reconstructed fossil-fueled EGU combustion turbines that commenced operation after May 23, 2023 with a capacity greater than 25 MW.  The final revised standards do not apply to IPL’s and WPL’s current fossil-fueled EGU combustion turbines since they were all placed into service before May 23, 2023 and have not been reconstructed since that date.  Alliant Energy, IPL and WPL are currently unable to predict with certainty the future outcome or impact of these revised standards, including resolution of ongoing litigation.\nCross-State Air Pollution Rule\n - CSAPR is a regional sulfur dioxide and nitrogen oxides cap-and-trade program, where compliance with emission limits may be achieved by purchasing emission allowances and/or reducing emissions through changes in operations or the additions of environmental controls.  CSAPR emission allowances may be banked for future year compliance.  CSAPR establishes state-specific annual sulfur dioxide and nitrogen oxides emission caps and ozone season nitrogen oxides emission caps.  In 2023, the EPA finalized revisions to the CSAPR state-specific ozone season nitrogen oxides emission caps and utility-specific emission allowances for certain states, including Wisconsin, beginning in 2023; however, these revisions were stayed by the Supreme Court in June 2024.  In November 2024, the EPA issued an interim final rule to stay the 2023 rule and re-establish the prior emission caps and allowance allocations, including Wisconsin, pending judicial review.  WPL currently receives, and expects to receive in the future, enough CSAPR emission allowances to ensure ongoing compliance without the need to purchase additional allowances or materially curtail operations.  These revisions do not currently apply to Iowa; however, Iowa could be included in a future rule.  As a result, Alliant Energy and IPL are currently unable to predict with certainty the future outcome or impacts of these matters.\nNew Source Performance Standards (NSPS) for Combustion Turbines\n - The EPA establishes requirements under the CAA for various categories of stationary sources that cause or contribute significantly to air pollution, and may reasonably be anticipated to endanger public health or welfare, which are referred to as NSPS.  These standards reflect the degree of emission limitation achievable through the application of the BSER.  In December 2024, the EPA proposed updates to the NSPS for combustion turbines built, reconstructed, or modified after December 13, 2024, which would establish more stringent emission limits for nitrogen oxides emissions and retain the current sulfur dioxide emission limits.  This proposal would establish size-based subcategories for new, reconstructed or modified combustion turbines, and could require combustion controls or selective catalytic reduction control equipment.  Alliant Energy, IPL and WPL are currently evaluating the proposed rule and are unable to predict with certainty future compliance impacts; however, costs to comply with this rule could have a material impact on their financial condition and results of operations.\nWater Quality -\nEffluent Limitation Guidelines\n - In May 2024, the EPA enacted a final rule that revises discharge limits for specific categories of wastewater from existing steam EGUs.  The new limitations will be implemented in each facility’s wastewater discharge permits issued by state agencies and become effective as soon as possible but no later than December 31, 2029.  Alliant Energy, IPL and WPL are currently evaluating the final rule and are unable to predict with certainty future compliance impacts, including resolution of ongoing litigation; however, costs to comply with this rule could have a material impact on their financial condition and results of operations.\nLand and Solid Waste -\nCoal Combustion Residuals Rule\n - The CCR Rule, which initially became effective in 2015, regulates CCR as a non-hazardous waste.  In May 2024, the EPA revised the CCR Rule, which significantly expands the scope of regulation, and as discussed in \nNote 1\n3\n, Alliant Energy, IPL and WPL recorded additional AROs in 2024.  IPL and WPL have coal ash ponds at current and former EGU sites, and active and inactive CCR landfills, that are impacted by this rule.  Alliant Energy, IPL and WPL continue to evaluate the revised CCR Rule and are unable to predict with certainty the future outcome or impact of these updates, including resolution of ongoing litigation.\nManufactured Gas Plant Sites\n - Refer to \nNote 1\n6\n(e)\n for discussion of IPL’s and WPL’s MGP sites.\nRenewable Energy Standards\n - \nIowa and Wisconsin have renewable energy standards, which establish the minimum amount of energy IPL and WPL must supply from renewable resources.  IPL primarily relies upon renewable energy generated from the wind or solar resources it owns and renewable energy acquired under PPAs to meet these requirements.  WPL utilizes its current renewable portfolio, which primarily consists of wind, solar and hydro energy, both owned and acquired under PPAs, to meet these requirements.  IPL and WPL currently exceed their respective renewable energy standards requirements.\n3) STRATEGY - \nRefer to “\nOverview\n” in MDA for discussion of Alliant Energy’s strategy, which supports its mission to deliver energy solutions and exceptional service that its customers and communities count on - affordably, safely, reliably and sustainably.\n9\nTable of C\no\nntents\n                                    \nC. INFORMATION RELATING TO UTILITY OPERATIONS\nAlliant Energy’s utility business includes the operations of IPL (electric, gas and steam operations) and WPL (electric and gas operations), which are both reportable segments.  IPL’s and WPL’s electric, gas and other revenues as a percentage of total revenues were as follows:\nIPL\nWPL\n1) ELECTRIC UTILITY OPERATIONS\nGeneral\n -\n Alliant Energy’s electric utility operations are located in the Midwest with IPL providing retail and wholesale electric service in Iowa and WPL providing retail and wholesale electric service in Wisconsin.  IPL also sells electricity to wholesale customers in Minnesota and Illinois.  Refer to the “\nElectric Operating Information\n” tables for additional details regarding electric utility operations.\nCustomers\n \n-\n IPL and WPL provide electric utility service to a large base of retail customers in several industries, with the largest concentrations in the farming, agriculture, industrial manufacturing, chemical (including ethanol), packaging and food industries.  IPL and WPL also sell electricity to wholesale customers, which primarily consist of municipalities and rural electric cooperatives.\nSeasonality\n - \nElectric sales are seasonal to some extent with the annual peak normally occurring in the summer months due to air conditioning requirements.  Electric sales are also impacted to a certain extent in the winter months due to heating requirements.\nCompetition\n - \nRetail electric customers in Iowa and Wisconsin currently do not have the ability to choose their electric supplier, and IPL and WPL have obligations to serve all their retail electric customers.  Although electric service in Iowa and Wisconsin is regulated, IPL and WPL still face competition from self-generation by large industrial customers, customer- and third party-owned generation (e.g. solar panels), alternative energy sources, and petitions to municipalize (Iowa) as well as service territory expansions by municipal utilities through annexations (Wisconsin).  In addition, the wholesale power market is competitive and IPL and WPL compete against independent power producers, other utilities and MISO market purchases to serve wholesale customers for their electric energy and capacity needs.  Alliant Energy’s strategy includes actions to retain current customers and attract new customers into IPL’s and WPL’s service territories in an effort to keep energy rates low for all of their customers.  Refer to “\nOverview\n” in MDA for discussion of the strategy element focusing on growing customer demand.\nElectric Supply\n -\n Alliant Energy, IPL and WPL have met, and expect to continue meeting, customer demand of electricity through a mix of electric supply, including owned EGUs, PPAs and additional purchases from wholesale energy markets.  Alliant Energy expects its current mix of electric supply to continue to evolve with new wind and solar generation, energy storage facilities, new natural gas resources, refurbishing of existing wind farms, improvements at existing natural gas-fired EGUs and converting certain coal-fired EGUs to natural gas.  Long-term generation plans are intended to meet growing customer demand, reduce air emissions and water impacts, reduce reliance on wholesale market purchases and mitigate the impacts of future EGU retirements while maintaining compliance with long-term electric demand planning reserve margins, renewable energy standards established by regulators, among other requirements.\nElectric Demand Planning Reserve Margin -\n IPL and WPL are required to maintain a planning reserve margin above their load at the time of the MISO-wide peak each season to ensure reliable electric service to their customers.  IPL and WPL utilize accredited capacity from EGUs they own, and have rights to through PPAs, to meet a substantial portion of their current MISO planning reserve margin requirements and periodically rely on short-term market capacity purchases to supplement the accredited capacity from such EGUs.\n10\nTable of C\no\nntents\n                                    \nMISO Seasonal Resource Adequacy Process\n - MISO’s resource adequacy process includes capacity planning reserve margins and capacity accreditation requirements with four distinct seasons, to help ensure the reliability of electricity in the MISO region.  Capacity planning reserve margins are required for all market participants on a seasonal basis, and seasonal accredited capacity values are determined for certain classes of generating resources, including higher accredited capacity for wind generation during the Spring, Fall and Winter seasons and higher accredited capacity for solar generation during the Summer season.  Beginning with the June 1, 2028 through May 31, 2029 planning period, MISO will implement a Direct Loss of Load methodology to determine capacity accreditation, which will incorporate forward-looking analysis, and historical resource-specific performance during periods of high system risk over the previous three years.  Alliant Energy, IPL and WPL currently plan to construct and/or acquire additional renewable, energy storage and natural gas resources to meet the requirements of the seasonal resource adequacy process and have reflected the estimated capital expenditures for these projects in the “Generation” lines in the construction and acquisition table in “\nLiquidity and Capital Resources\n.”  Seasonal capacity reserve margins are as follows:\nJune 2025 - August 2025\nSeptember 2025 - November 2025\nDecember 2025 - February 2026\nMarch 2026 - May 2026\nRequired installed capacity reserve margin\n15.7%\n25.3%\n38.6%\n38.8%\nRequired unforced capacity reserve margin\n7.9%\n14.9%\n18.4%\n25.3%\nGeneration Fuel Supply - \nIPL and WPL own a portfolio of EGUs located in Iowa, Wisconsin and Minnesota with a fuel mix that includes natural gas, renewable resources and coal.  Refer to “\nProperties\n” in"
}