{
  "ticker": "SCHW",
  "cik": "0000316709",
  "company_name": "SCHWAB CHARLES CORP",
  "filing_date": "2025-02-26",
  "accession": "0000316709-25-000010",
  "primary_doc": "schw-20241231.htm",
  "item1_text": "Item 1.     Business\nGeneral Corporate Overview\nThe Charles Schwab Corporation (CSC) is a savings and loan holding company. CSC engages, through its subsidiaries (collectively referred to as Schwab or the Company), in wealth management, securities brokerage, banking, asset management, custody, and financial advisory services. At December 31, 2024, Schwab had $10.10 trillion in client assets, 36.5 million active brokerage accounts, 5.4 million workplace plan participant accounts, and 2.0 million banking accounts.\nPrincipal business subsidiaries of CSC include the following:\n•\nCharles Schwab & Co., Inc. (CS&Co), incorporated in 1971, a securities broker-dealer;\n•\nCharles Schwab Bank, SSB (CSB), our principal banking entity; and\n•\nCharles Schwab Investment Management, Inc. (CSIM), the investment advisor for Schwab’s proprietary mutual funds (Schwab Funds\n®\n) and for Schwab’s exchange-traded funds (Schwab ETFs).\nIn May 2024, the Company completed the final client account conversions to CS&Co from the Ameritrade broker-dealers, TD Ameritrade, Inc. and TD Ameritrade Clearing, Inc. (TDAC). Accordingly, these entities are no longer principal business subsidiaries. See Business Acquisition below for additional information regarding the integration. \nUnless otherwise indicated, the terms “Schwab,” “the Company,” “we,” “us,” or “our” mean CSC together with its consolidated subsidiaries.\nSchwab provides financial services to individuals and institutional clients through two segments – Investor Services and Advisor Services. The Investor Services segment provides retail brokerage, investment advisory, and banking and trust services to individual investors, and retirement plan and business services, as well as other corporate brokerage services, to businesses and their employees. The Advisor Services segment provides custodial, trading, banking and trust, and support services to independent registered investment advisors (RIAs), independent retirement advisors, and recordkeepers. These services are further described in the segment discussion below.\nBusiness Strategy and Competitive Environment \nSchwab was founded on the belief that all Americans deserve access to a better investing experience. Although much has changed in the intervening years, our purpose remains clear – to champion every client’s goals with passion and integrity. Guided by this purpose and our vision of creating the most trusted leader in investment services, management has adopted a strategy described as “Through Clients’ Eyes.”\nThis strategy emphasizes placing clients’ perspectives, needs, and desires at the forefront. Because investing plays a fundamental role in building financial security, we strive to deliver a better investing experience for our clients – individual investors and the people and institutions who serve them – by disrupting longstanding industry practices on their behalf and providing superior service. We also aim to offer a broad range of products and solutions to meet client needs with a focus on transparency, value, and trust. In addition, management works to couple Schwab’s scale and resources with ongoing expense discipline to keep costs low and ensure that products and solutions are affordable as well as responsive to client needs. In combination, these are the key elements of our “no trade-offs” approach to serving investors. We believe that following this strategy is the best way to maximize our market valuation and stockholder returns over time.\nManagement estimates that investable wealth in the United States (U.S.) (consisting of assets in defined contribution, retail wealth management and brokerage, and registered investment advisor channels, along with bank deposits) currently exceeds $75 trillion, which means the Company’s $10.10 trillion in client assets leaves substantial opportunity for growth. Our strategy is based on the principle that developing trusted relationships will translate into more assets from both new and existing clients, ultimately driving more revenue, and along with expense discipline and thoughtful capital management, will generate earnings growth and build long-term stockholder value.\nWithin Investor Services, our competition in serving individual investors spans brokerage, wealth management, and asset management firms, as well as banks, trust companies, financial technology companies, and retirement service providers. In the Advisor Services arena, we compete with institutional custodians, wirehouses, regional and independent broker-dealers, banks, and trust companies. \n- 1 -\nTHE CHARLES SCHWAB CORPORATION\nAcross both segments, our key competitive advantages are:\n•\nScale and Size of the Business – As one of the largest investment services firms in the U.S., we are able to spread operating costs and amortize new investments over a large base of clients, and harness the resources to evolve capabilities to meet client needs.\n•\nOperating Efficiency – Coupled with scale, our operating efficiency and sharing of infrastructure across different businesses creates a cost advantage that enables us to competitively price products and services while profitably serving clients of various sizes across multiple channels.\n•\nOperating Structure – Providing bank, wealth, and asset management services to broker-dealer clients helps serve a wider array of needs, thereby deepening relationships, enhancing the stability of client assets, and enabling diversified revenue streams. \n•\nBrand and Corporate Reputation – In an industry dependent on trust, Schwab’s reputation and brand across multiple constituents enable us to attract clients and employees while credibly introducing new products to the market.\n•\nService Culture – Delivering a great client experience earns the trust and loyalty of clients and increases the likelihood that those clients will refer others.\n•\nWillingness to Disrupt – Management’s willingness to challenge the status quo, including our own business practices, to benefit clients fosters innovation and continuous improvement, which helps to attract more clients and assets.\nBusiness Acquisition\nAcquisition of Ameritrade \nThe Company acquired TD Ameritrade Holding Corporation, now Ameritrade Holding LLC (Ameritrade Holding) and its consolidated subsidiaries (collectively referred to as Ameritrade), effective October 6, 2020. The Company’s integration of Ameritrade is now complete. Through the integration, the Company generally adopted Schwab platforms and systems, though we’ve leveraged certain material advantages in Ameritrade’s platforms, including our comprehensive integration of Ameritrade’s thinkorswim\n®\n and thinkpipes\n®\n trading platforms, education, and tools into our offerings for retail and RIA clients. In 2023, we launched Schwab Trading Powered by Ameritrade™, an enhanced trading experience made possible by the combination of the thinkorswim trading platform with Schwab’s trading capabilities on Schwab.com and Schwab Mobile. We have also incorporated Ameritrade Institutional’s customizable portfolio rebalancing solution, iRebal\n®\n, as part of our offering for independent advisor clients.\nOver the course of five client transition groups in 2023 and 2024, we converted approximately $1.9 trillion in client assets across more than 17 million client accounts, including 7,000 RIAs, from Ameritrade to Schwab. In May 2024, the Company completed the conversion of the final Ameritrade client transition group to the Schwab platform. Following the completion of the final client account conversions to CS&Co, TD Ameritrade, Inc., and TDAC submitted Uniform Requests for Broker-Dealer Withdrawal (BDW) to terminate their registration as broker-dealers with the SEC, the Financial Industry Regulatory Authority, Inc. (FINRA), and other applicable regulatory organizations, and as of December 31, 2024, TD Ameritrade, Inc. and TDAC are no longer registered as broker-dealers with the SEC and FINRA. \nFor additional information on our integration of Ameritrade, see Part II – Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations (Item 7) – Overview and Part II – Item 8 – Financial Statements and Supplementary Data (Item 8) – Note 16.\nIDA Agreement\nConcurrently with the execution of the Agreement and Plan of Merger, dated as of November 24, 2019, as amended (the Merger Agreement) to acquire Ameritrade, CSC entered into an amended and restated insured deposit account agreement with TD Bank USA, National Association and TD Bank, National Association (together, the TD Depository Institutions) (the 2019 IDA agreement), which became effective October 6, 2020. On May 4, 2023, the Company executed the Second Amended and Restated Insured Deposit Account Agreement (2023 IDA agreement) with the TD Depository Institutions that replaced and superseded the 2019 IDA agreement. Consistent with the 2019 IDA agreement, in accordance with the 2023 IDA agreement, cash held in eligible brokerage client accounts is swept off-balance sheet to deposit accounts at the TD Depository Institutions. Schwab provides recordkeeping and support services to the TD Depository Institutions with respect to the deposit accounts for which Schwab receives an aggregate monthly fee. Under the 2023 IDA agreement, the service fee on client cash deposits held at the TD Depository Institutions remains at 15 basis points, as it was in the 2019 IDA agreement. \nFor additional information on the 2023 IDA agreement, see Part II – Item 7 – Capital Management and Item 8 – Note 15.\n- 2 -\nTHE CHARLES SCHWAB CORPORATION\nProducts and Services\nSchwab offers a broad range of products and services through intuitive end-to-end solutions, including robust digital capabilities, to address our clients’ varying investment and financial needs. Examples of these offerings include the following:\n•\nBrokerage – an array of full-feature brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities including certificates of deposit;\n•\nMutual funds – third-party mutual funds through the Mutual Fund Marketplace\n®\n, including no-transaction-fee (NTF) mutual funds through the Mutual Fund OneSource\n®\n service, which also includes proprietary mutual funds, plus mutual fund trading and clearing services to broker-dealers;\n•\nExchange-traded funds (ETFs) – an extensive offering of ETFs, including both proprietary and third-party ETFs; \n•\nManaged investing solutions – managed portfolios of both proprietary and third-party mutual funds and ETFs, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management;\n•\nAlternative investments – access to a variety of third-party alternative investments, such as private equity and real estate on Schwab’s alternative investment platforms – Schwab Alternative Investment OneSource\n®\n and Schwab Alternative Investment Marketplace;\n•\nBanking – checking and savings accounts, first lien residential real estate mortgage loans (First Mortgages), home equity lines of credit (HELOCs), and pledged asset lines (PALs); and\n•\nTrust – trust custody services, personal trust reporting services, and administrative trustee services.\nThese investing products and services are made available through two business segments – Investor Services and Advisor Services. Schwab’s major sources of revenues are generated by both of the reportable segments, based on their respective levels of client assets and activity. Revenue is attributable to a reportable segment based on which segment has the primary responsibility for serving the client. The accounting policies of the reportable segments are the same as those described in Part II – Item 8 – Note 2. \nInvestor Services\nCharles Schwab initially founded the Company 50 years ago to provide individual investors with access to the financial markets at a highly competitive cost. The Company has expanded offerings over time in response to client needs, aiming to provide a compelling and often disruptive solution in the marketplace. The Investor Services segment includes the following business units: Retail Investor; Workplace Financial Services, which includes Retirement Plan Services, Retirement Business Services (formerly part of Advisor Services), Stock Plan Services, and Designated Brokerage Services; Mutual Fund Clearing Services; and Off-Platform Sales. \nThrough the Retail Investor business unit, we offer individual investors access to a broad set of products, tools, education, trading, and advisory solutions. We provide advice and guidance through various relationship models. And we offer award-winning and 24/7 service to all our clients, regardless of asset levels, via a multi-channel service delivery model, which includes online, mobile, telephone, and branch support.\nWe believe in the power of investing and the importance of planning in helping clients achieve their financial goals. At the core of our offer is our broad set of relationship models that help personalize the investing journey for our clients and offer them the choice of where, when, and how they do business with us. Financial Consultants, Active Trader Financial Consultants, and Wealth Consultants in Schwab’s branches and regional centers focus on building client relationships. We also have a range of roles to support clients with a broad set of specialized needs, including financial planning, managed investing, trading, trust, equity compensation, and lending. Additionally, we have teams focused on supporting the advice and education needs of all our clients and corporate plan participants irrespective of asset levels at Schwab. To better meet the differentiated needs of our more affluent clients, we offer Schwab Private Client Services™ for clients with $1 million – $10 million and Schwab Private Wealth Services™ for clients with $10 million or more in total assets. Clients enrolled in these offerings have access to a dedicated relationship and service team, specialists, expedited processing, pricing discounts and product access.\nOur advisory solutions span a broad range of discretionary and non-discretionary choices, with minimum investments starting as low as $5,000, making it accessible to a broad set of investors. Our premier advisory solution, Schwab Wealth Advisory™, features a personal advice relationship with a dedicated Wealth Advisor, supported by a team of wealth management professionals who provide individualized service, financial planning, a customized investment strategy developed in collaboration with the client, and ongoing guidance and execution. We offer referrals to independent RIAs in the Schwab Advisor Network\n®\n for clients seeking personalized portfolio management, financial planning, and wealth management solutions. We provide investors access to professional investment management in a diversified account that is invested exclusively in either \n- 3 -\nTHE CHARLES SCHWAB CORPORATION\nmutual funds or ETFs through the Schwab Managed Portfolios™ and the Windhaven Investment Management\n®\n Strategies, or equity securities and ETFs through the ThomasPartners\n®\n Investment Management Strategies. Through Wasmer Schroeder™ Strategies, more than 20 fixed income strategies and separately managed account offerings are available to retail clients, including two positive impact strategies, a multi-sector income strategy, and ultra-short-term U.S. Treasury ladder strategies. We also refer investors who want to utilize a specific third-party money manager to direct a portion of their investment assets to the Schwab Managed Account\n™\n program. Schwab Personalized Indexing\n®\n allows clients to own individual stocks that reflect the characteristics of an index in a professionally managed solution, enabling greater customization and tax efficiency. Schwab Intelligent Portfolios\n®\n is available for clients who are looking to have their assets professionally managed via a fully automated online investment advisory service. Schwab Intelligent Portfolios Premium\n®\n, a hybrid advisory service, offers clients an advisory service which combines our robo-advice technology with unlimited guidance provided by a C\nERTIFIED\n F\nINANCIAL\n P\nLANNER\n™\n to make financial and investment planning more accessible to investors. Schwab Intelligent Income\n®\n is a low-cost solution designed to offer a simple, modern way to generate income from existing investment portfolios.\nFurther, given our belief in the importance of financial planning, we offer a broad set of planning capabilities addressing a variety of planning needs. Our solutions include simple, free digital retirement calculators, our complimentary digital Schwab Plan\n®\n available to all Schwab clients, as well as more complex planning solutions that are delivered by a Schwab representative who takes into account a client’s personal and financial goals to build a tailored financial plan.\nTo meet the specific needs of trading clients, Schwab offers integrated web-, mobile-, and software-based trading platforms, real-time market data, access to an extensive set of tradeable products, premium research, and multi-channel access, as well as sophisticated account and trade management features, risk management tools, and dedicated service support – all at highly competitive pricing. In addition to equities, ETFs, and 24/5 trading on select securities, qualified clients can trade options, futures, and forex. In 2023, we introduced Schwab Trading Powered by Ameritrade™, which brings together the best of Schwab and Ameritrade’s trading platforms, comprehensive education, and specialized service. \nSchwab’s international business offers clients outside the U.S. the ability to invest in U.S. markets. For clients living inside the U.S., it offers multicurrency and foreign exchange trading. For all clients, it offers trading in foreign stocks. In addition, Schwab serves both foreign investors and U.S. clients with preferred language needs who wish to trade or invest in U.S. dollar-based securities.\nWe also offer clients a range of self-service education and support tools, providing quick and efficient access to a broad lineup of information, research, tools, and administrative services, which clients can access according to their needs. Schwab Coaching delivers online and in-person workshops as well as live and on-demand webcasts. In addition, we provide educational content including articles, videos, podcasts, and interactive courses covering a broad range of financial topics designed to support investors of all experience levels. Additionally, we provide various online research and analysis tools that are designed to help clients achieve better investment outcomes. As an example of analysis tools available to clients, Schwab Equity Ratings\n®\n is a quantitative model-based stock rating system that provides all clients with ratings on approximately 3,000 stocks, assigning each equity a single grade: A, B, C, D, or F. Schwab Equity Ratings International\n®\n, an international ranking methodology, covers stocks of approximately 4,000 foreign companies. \nAnother example of expanding access to investing includes Schwab Stock Slices\n®\n, a service which enables investors to purchase a single stock slice, or up to 30 different stock slices at once, from the Standard & Poor’s\n®\n 500 Index (S&P 500\n®\n),\n \ncommission-free through our online channels. We also offer Schwab Investing Themes\n®\n, a thematic investing offer that uses proprietary research and technology to identify trends, opportunities, and relevant companies and group them into themes in which clients can invest in just a few clicks. The Schwab Trading Activity Index™ is a proprietary, behavior-based index created by Schwab, designed to indicate the sentiment of retail investors’ portfolios. It measures what investors are doing and how they are actually positioned in the markets.\nWorkplace Financial Services includes Retirement Plan Services, Retirement Business Services, Stock Plan Services, and Designated Brokerage Services. Retirement Plan Services offers a bundled retirement plan product for a range of plan types that provides retirement plan sponsors with extensive investment options, trustee or custodial services, and plan participant-level recordkeeping. Retirement plan design features, which increase plan efficiency and achieve plan sponsor goals, are also offered, including automatic enrollment, automatic fund mapping at conversion, and automatic contribution increases. In addition to an open architecture investment platform, we offer a managed investing service to help plan participants work toward their retirement goals. Individuals investing for retirement through 401(k) plans can take advantage of bundled offerings of multiple investment choices, education, third-party advice, and an integrated brokerage window. \nBeginning in 2024, the Investor Services segment includes the Retirement Business Services business unit within Workplace Financial Services. Retirement Business Services provides trust, custody, brokerage, and software services to independent \n- 4 -\nTHE CHARLES SCHWAB CORPORATION\nretirement plan advisors and independent recordkeepers. Through Retirement Business Services, retirement plan assets are held at Charles Schwab Trust Bank (Trust Bank) or trusteed by a separate, independent trustee, or through brokerage accounts at CS&Co. Retirement Business Services also offers the Schwab Personal Choice Retirement Account\n®\n, a self-directed brokerage offering for retirement plans. The Company and independent retirement plan providers work together to serve plan sponsors, combining the consulting and administrative expertise of the administrator with our investment, technology, brokerage, trust, and custodial services.\nStock Plan Services offers equity compensation stock plan administrators full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, stock appreciation rights, and a full range of participant support services that includes education and investing services to individual equity plan participants. Specialized services for executive transactions and reporting, corporate actions, grant acceptance tracking, and other services are offered to stock plan administrators to meet the needs of administering the reporting and compliance aspects of an equity compensation plan. Designated Brokerage Services supports employers’ needs for employee account surveillance (trading and reporting) through a consultative and best practices approach. Comprehensive single-custodian solutions combine technology with experienced service team members to help compliance professionals manage risk. Single-custodian solutions provide Schwab account trading data via an outbound direct data feed to industry regulated companies’ proprietary compliance solutions or third-party compliance monitoring systems. \nLastly, we also offer Mutual Fund Clearing Services and Off-Platform Sales. Mutual Fund Clearing Services provides open-end mutual fund trading, settlement, and related transactional services to banks, brokerage firms, and trust companies. Off-Platform Sales offers proprietary mutual funds, ETFs, and collective trust funds (CTFs) outside the Company and not on the Schwab platform. They are included within the Investor Services segment given their leveraging of the products and services offered to individual investors. \nAdvisor Services\nMore than thirty years ago, Schwab supported a small group of entrepreneurial advisors who challenged the industry by creating independent firms. Through the Advisor Services segment, Schwab has become one of the largest providers of custodial, trading, banking, and support services to RIAs and their clients. Management believes that we can maintain our competitive position primarily through the efforts of our sales, support, technology, and business consulting teams, which are dedicated to helping RIAs grow, compete, and succeed in serving their clients. In addition to focusing on superior service, we utilize technology to provide RIAs with a highly-developed, scalable platform for administering their clients’ assets easily and efficiently. Advisor Services sponsors and hosts a variety of national, regional, local, and virtual events designed to help RIAs of all sizes and complexities identify and implement better ways to expand and efficiently manage their practices.\nRIAs who custody client accounts at Schwab may use proprietary software that provides them with up-to-date client account information as well as trading capabilities. The Advisor Services website is the core platform for RIAs to conduct daily business activities online with Schwab, including viewing and managing client account information and accessing news and market information. The website provides account servicing capabilities for RIAs, including account opening, money movement, transfer of assets, trading, checking status, and communicating with our service team. The site provides multi-year archiving of statements, trade confirms, and tax reports, along with document search capabilities. We also provide access to integrations with third-party platforms, which support a variety of advisor needs including client relationship management, portfolio management systems, trade order management, and financial planning. As an example, we offer Schwab Advisor Portfolio Connect\n®\n, a simplified portfolio management solution that is available free of charge to advisors to manage Schwab accounts. It delivers core capabilities and features through an intuitive modern experience, without the need to download and reconcile data.\nThe Advisor Services website also provides interactive tools, educational content, and thought leadership for advisors turning independent. We offer a variety of services to help RIAs grow and manage their practices, including business, technology, and operations consulting on a range of topics critical to an RIA’s success, as well as an annual RIA benchmarking study to help firms understand key business metrics relative to peers. We also offer an array of services to help advisors establish their own independent practices through a robust prospect consulting offer. To support them throughout their transition, we offer access to business start-up and transition consultants, technology engineers, and dedicated service teams.\nSchwab provides extensive educational materials, programs, and events to RIAs seeking to expand their knowledge of industry issues and trends, as well as sharpen their individual expertise and practice management skills. We conduct industry research on an ongoing basis, and hold a series of events and conferences every year to discuss topics of interest to RIAs, including business strategies and best practices. Schwab sponsors and hosts the annual IMPACT\n®\n conference, which provides a national forum for the Company, RIAs, and other industry participants to gather and share information and insights, as well as a multitude of smaller events across the country each year.\n- 5 -\nTHE CHARLES SCHWAB CORPORATION\nRIAs and their clients have access to our broad range of products and services, including individual securities, mutual funds, ETFs, fixed income products, managed accounts, cash products, bank lending, and trust services. By functioning as the custodian, Schwab earns revenue associated with the underlying client assets, predominantly through net interest revenue and asset management and administration fees. In this capacity, we do not charge the RIA or end client a custody fee. \nAs part of our integration of Ameritrade, we have added some of the best features from Ameritrade into our ongoing offerings. The Company’s thinkpipes\n®\n trading platform offers real-time charting and efficient trading and allocation, and iRebal\n®\n provides customizable portfolio rebalancing – both now part of our ongoing offering for RIA clients.\nSources of Net Revenues\nSchwab’s largest sources of net revenues are net interest revenue, asset management and administration fees, trading revenue, and bank deposit account fees. These revenue streams are supported by the combination of our bank, broker-dealer, and asset management operating subsidiaries, each of which brings specific capabilities that enable us to provide clients with the products and services they are seeking. \nNet interest revenue is the difference between interest generated on interest-earning assets and interest paid on funding sources. Schwab’s primary funding source for interest-earning assets is uninvested client cash balances held on our balance sheet as part of clients’ overall relationship with the Company. Schwab’s interest-earning assets are primarily comprised of high-quality fixed income securities, margin loans, and bank loans.\nAsset management and administration fees are primarily earned from proprietary money market mutual funds, proprietary and third-party mutual funds and ETFs, and fee-based advisory solutions.\nTrading revenue includes commissions earned for executing trades for clients in certain individual equities, options, futures, fixed income securities, and certain third-party mutual funds and ETFs; order flow revenue; and principal transactions revenue earned primarily from actions to support client trading in fixed income securities. \nBank deposit account fees are primarily recognized pursuant to the Company’s IDA agreement with the TD Depository Institutions. Under the IDA agreement, uninvested cash within eligible brokerage client accounts is swept off-balance sheet to deposit accounts at the TD Depository Institutions. Schwab provides recordkeeping and support services to the TD Depository Institutions for bank deposit account fees. \nRegulation\nAs a participant in the securities, banking and financial services industries, Schwab is subject to extensive regulation under both federal and state laws by governmental agencies, supervisory authorities, and self-regulatory organizations (SROs). We are also subject to oversight by regulatory bodies in other countries in which we operate. These regulations affect our business operations and impose capital, client protection, and market conduct requirements.\nHolding Company and Bank Regulation\nCSC is a savings and loan holding company and is regulated, supervised, and examined by the Board of Governors of the Federal Reserve System (Federal Reserve). CSC has elected to be treated as a Financial Holding Company (FHC) by the Federal Reserve. In addition to the activities that a savings and loan holding company that has not elected to be treated as an FHC is permitted to conduct, an FHC may also engage in activities that are financial in nature or incidental to a financial activity (FHC Activities), including underwriting, dealing and making markets in securities, various insurance underwriting activities, and making merchant banking investments in non-financial companies.\nThe Federal Reserve has the authority to limit an FHC’s ability to conduct otherwise permissible FHC Activities if the FHC or any of its depository institution subsidiaries ceases to meet the applicable eligibility requirements, including requirements that the FHC and each of its depository institution subsidiaries maintain their status as “well-capitalized” and “well-managed.” If the Federal Reserve finds that an FHC fails to meet these requirements, the FHC and its subsidiaries may not commence any new FHC Activity, either de novo or through an acquisition, without prior Federal Reserve approval. The Federal Reserve may also impose any additional limitations or conditions on the conduct or activities of the FHC or any of its subsidiaries as it deems appropriate. If the FHC still fails to satisfy the applicable eligibility requirements 180 days after the Federal Reserve’s finding, the agency may require divestiture of all of the FHC’s depository institution subsidiaries or, alternatively, the FHC may elect to cease all of its FHC Activities. In addition, if any depository institution controlled by an FHC fails to maintain at least a “Satisfactory” rating under the Community Reinvestment Act of 1977 (CRA), the FHC and its subsidiaries are prohibited from \n- 6 -\nTHE CHARLES SCHWAB CORPORATION\nengaging in additional FHC Activities. \nAs a result of our election to be treated as an FHC and the election of our \ndepository institution subsidiaries \nto be deemed savings associations under the Home Owners’ Loan Act, a statutory prohibition limits those subsidiaries from making loans or other extensions of credit to any affiliate unless that affiliate engages, directly or indirectly, only in activities permissible under section 4(c) of the Bank Holding Company Act.\nCSC’s three depository institution subsidiaries are CSB, CSC’s principal depository institution subsidiary, Charles Schwab Premier Bank, SSB (CSPB), and Trust Bank. CSB and CSPB are Texas-chartered state savings banks headquartered in Westlake, Texas, and Trust Bank is a Nevada state-chartered savings bank with its main office located in Westlake, Texas. CSB and CSPB are currently regulated, supervised, and examined by the Federal Reserve, the Texas Department of Savings and Mortgage Lending (TDSML), the Consumer Financial Protection Bureau (CFPB), and the Federal Deposit Insurance Corporation (FDIC). Trust Bank is currently regulated, supervised, and examined by the Federal Reserve, the Nevada Financial Institutions Division, the CFPB, and the FDIC. CSC, CSB, CSPB, and Trust Bank are also subject to regulation and various requirements and restrictions under state and other federal laws.\nThis regulatory framework is designed to protect depositors and consumers, the safety and soundness of depository institutions and their holding companies, and the stability of the banking system as a whole. This framework affects the activities and investments of CSC and its subsidiaries and gives the regulatory authorities broad discretion in connection with their supervisory, examination and enforcement activities and policies. Below is a discussion of significant regulations. \nRegulatory Capital and Liquidity Framework\nBanking organizations are subject to the regulatory capital rules issued by the Federal Reserve and other U.S. banking regulators, including the Office of the Comptroller of the Currency and the FDIC. In addition to minimum risk-based capital requirements, banking organizations must hold additional capital, referred to as buffers, to avoid being subject to limits on capital distributions and discretionary bonus payments to executive officers.\nThe banking regulators have established four risk-based categories for determining the regulatory capital and liquidity requirements applicable to large U.S. banking organizations with $100 billion or more in total consolidated assets based on their total assets, cross-jurisdictional activity, weighted short-term wholesale funding, nonbank assets, and off-balance sheet exposure. CSC is generally subject to the requirements under Category III based on its total consolidated assets of between $250 billion and less than $700 billion and having less than $75 billion in cross-jurisdictional activity. If the average of our total consolidated assets for the four most recent calendar quarters is $700 billion or more, or the average of our cross-jurisdictional activity for the four most recent calendar quarters is $75 billion or more, we will move into Category II. As of December 31, 2024, CSC had total consolidated assets of approximately $480 billion and cross-jurisdictional activity of approximately $27 billion. \nCapital requirements for Category III banking organizations include the generally applicable risk-based capital and Tier 1 leverage ratio requirements (the “standardized approach” framework), the minimum 3.0% supplementary leverage ratio, the stress capital buffer (CSC), the capital conservation buffer (banking subsidiaries), and the countercyclical capital buffer, which is currently 0%. As a large savings and loan holding company, CSC is subject to the stress capital buffer requirement, which applies to risk-based capital ratios (Common Equity Tier 1 Capital, Tier 1 Capital, and Total Capital). Under the currently applicable capital requirements, Category III organizations are not subject to the “advanced approaches” regulatory capital framework and are permitted to opt out of including most components of accumulated other comprehensive income (AOCI) in their regulatory capital calculations. CSC made this opt out election and excludes most components of AOCI from its regulatory capital. Category II organizations are not permitted to opt out of including AOCI in their regulatory capital calculations and have additional requirements for calculating risk-based capital ratios and risk-weighted assets. \nIn July 2023, the Federal Reserve, together with the Office of the Comptroller of the Currency and the FDIC, issued a notice of proposed rulemaking with amendments to the regulatory capital rules. Among other things, the proposed rules would require us to include AOCI in regulatory capital \nand \nto calculate our risk-weighted assets using a revised risk-based approach, a component of which is based on operational risk\n, \nphased in over a three-year transition period\n. See \nPart II – Item 7 – Current Regulatory and Other Developments and Part II – Item 7 – Capital Management for additional information on these proposed regulatory changes.\nCertain banking organizations with trading assets and trading liabilities above certain thresholds or greater than a certain percent of total assets are subject to the Market Risk Rule and must adjust their risk-based capital ratios to reflect a measure of market risk of their trading activities, perform calculations to measure market risk, including back-testing, and make regular quantitative and qualitative public disclosures. \nCSC\n is subject to the rule \nand the related Market Risk Rule required disclosures\n. \nCSC began incorporating market risk capital for the period ending December 31, 2022, and while CSC is required to make adjustments to its \n- 7 -\nTHE CHARLES SCHWAB CORPORATION\nrisk-weighted assets related to de minimis positions, those adjustments have not significantly impacted our risk-based capital ratios nor have they had a current impact on CSC’s activities.\nThe U.S. Liquidity Coverage Ratio (LCR) rule is designed to promote resiliency of the banking sector by requiring that certain large U.S. banking organizations (Covered Companies) maintain a liquidity risk profile which ensures that they have sufficient High Quality Liquid Assets (HQLA), such as central bank reserves, certain government securities, and eligible corporate debt that can be converted easily and quickly to cash, to survive a significant stress event lasting 30 days. The LCR rule requires Covered Companies, including Schwab, to maintain an amount of HQLA that are unencumbered and controlled by the Covered Company’s liquidity management function sufficient to meet a designated percentage of their total stressed net cash outflows over a prospective 30 calendar-day period, as calculated in accordance with the LCR rule. Schwab is subject to the LCR and public disclosure requirement on a consolidated basis. On a quarterly basis the Company is required to disclose the average daily LCR over the quarter, and the Company also discloses quantitative and qualitative information over certain portions of the Company’s LCR components. Under the LCR rule, Schwab is required to maintain HQLA to cover 100% of the total stressed net cash outflows on a daily basis. In addition, HQLA that are held at the Company’s bank subsidiaries in excess of the subsidiaries’ total net cash outflows, and are not transferable to non-bank affiliates, are excluded by rule from the Company’s eligible HQLA.\nThe final Net Stable Funding Ratio (NSFR) rule was jointly adopted by the Federal Reserve, the Office of the Comptroller of the Currency, and the FDIC to strengthen the resilience of large bank and savings and loan holding companies by requiring them to maintain a minimum level of stable funding based on the liquidity characteristics of the holding company’s assets, commitments, and derivative exposures over a one-year time horizon. The requirement is expressed as a ratio of a banking organization’s available stable funding (ASF) to its required stable funding (RSF). Under the NSFR rule, CSC and our banking subsidiaries are required to maintain ASF in an amount equal to 100% of its RSF on an ongoing, daily basis. CSC is also required to publicly disclose its quarterly NSFR on a semi-annual basis. \nCapital Stress Testing\nUnder the current Federal Reserve capital stress testing rules, savings and loan holding companies that are Category III banking organizations and state member banks with total consolidated assets over $250 billion are required to disclose the results of company-run stress tests in even-numbered years. In the most recent cycle in 2024, CSC and CSB conducted company-run stress tests, reported the results of their stress testing to the Federal Reserve, and published a summary of their stress test results. \nPursuant to the Federal Reserve’s requirements, Category III savings and loan holding companies are also subject to an annual supervisory stress testing requirement in which the Federal Reserve conducts its own stress testing analysis to evaluate the ability of a holding company to absorb losses in specified economic and financial conditions over a nine-quarter planning horizon using such analytical techniques as the agency determines are appropriate. This supervisory stress testing requirement went into effect for CSC beginning with the 2022 stress testing cycle. \nPursuant to the Federal Reserve’s requirements, savings and loan holding companies with total consolidated assets of $100 billion or more, including CSC, are subject to an annual Comprehensive Capital Analysis and Review (CCAR) process, which requires submission of an annual capital plan to the Federal Reserve. These requirements also impose a stress capital buffer requirement, floored at 2.5 percent of risk-weighted assets. In June 2024, the Company received the results of the Federal Reserve’s 2024 CCAR. These results included the Federal Reserve’s estimate of CSC’s minimum capital ratios under the supervisory severely adverse scenario for the nine-quarter horizon beginning December 31, 2023 and ending March 31, 2026. Based on these results, CSC’s calculated stress capital buffer remains below the 2.5% minimum, resulting in a stress capital buffer at the 2.5% floor. This 2.5% stress capital buffer became applicable on October 1, 2024. See Part II – Item 8 – Note 24 for additional information regarding our capital requirements.\nAdditional Enhanced Prudential Standards\nIn addition to the capital stress testing regime discussed above, the Federal Reserve’s enhanced prudential standards rules also extend the applicability of certain additional enhanced prudential standards to large savings and loan holding companies, with the specific requirements tailored based on the same four-category framework utilized in the interagency regulatory capital and liquidity rules. These additional enhanced prudential standards, applicable to large U.S. bank holding companies under section 165 of the Dodd-Frank Wall Street Reform and Consumer Protection Act (Dodd-Frank Act), include: risk management and risk committee requirements; liquidity risk management, liquidity stress testing, and liquidity buffer requirements; and single \n- 8 -\nTHE CHARLES SCHWAB CORPORATION\ncounterparty credit limits. CSC is required to comply with these risk management and risk committee requirements, the liquidity risk-management, stress testing, and buffer requirements, as well as the single counterparty credit limits.\nIn August 2023, the Federal Reserve, together with the Office of the Comptroller of the Currency and the FDIC, issued a proposed rulemaking on long-term debt requirements for certain large banking organizations. \nSee \nPart II – Item 7 – Current Regulatory and Other Developments for discussion of the rule proposal. \nSource of Strength\nThe Dodd-Frank Act codified the Federal Reserve’s long-held position that a depository institution holding company must serve as a source of financial strength for its subsidiary depository institutions, the so-called “source of strength doctrine.” In effect, the holding company may be compelled to commit resources to support the subsidiary depository institution in the event the subsidiary is in financial distress.\nInsured Depository Institution Resolution Plans\nThe FDIC requires insured depository institutions (IDIs) with total consolidated assets of $50 billion or more to submit to the FDIC periodic plans providing for their resolution by the FDIC in the event of failure (IDI resolution plans) dating to a rule adopted in 2012. In June 2024, the FDIC adopted a new final rule with additional requirements for IDI resolution plans. Under the new final rule, large banks with total assets of at least $100 billion are required to submit comprehensive resolution plans that meet enhanced standards. These IDIs generally are required to submit a full resolution plan every three years under the new final rule with limited supplements filed in the off years. Among other requirements, the final rule requires periodic testing to validate capabilities and processing needed in resolution, and the FDIC will make certain credibility assessments of the IDI resolution plan. Under the new final rule, CSB is required to submit an IDI resolution plan to the FDIC on or before July 1, 2025. CSC is not subject to a separate holding company resolution plan requirement. \nDeposit Insurance Assessments\nThe FDIC’s Deposit Insurance Fund (DIF) provides insurance coverage for certain deposits, generally up to $250,000 per depositor per account ownership type, and is funded by quarterly assessments on insured depository institutions. The FDIC uses a risk-based deposit premium assessment system that, for large insured depository institutions with at least $10 billion in total consolidated assets, uses a scorecard method based on a number of factors, including the institution’s regulatory ratings, asset quality and brokered deposits. The deposit insurance assessment base is calculated as average consolidated total assets minus average tangible equity.\nIn October 2022, the FDIC adopted a final rule to increase the initial base deposit insurance assessment rates by two basis points, which became effective for the first quarterly assessment period of 2023. The FDIC has stated that this change is intended to raise the FDIC’s DIF reserve ratio to the minimum threshold within the FDIC’s established DIF restoration plan, and will remain in effect until the DIF reserve ratio meets the FDIC’s long-term goal of 2%. In November 2023, the FDIC approved a special assessment to recover losses incurred by the DIF in 2023 to protect uninsured depositors due to the March 2023 closures of two banks. See Part II – Item 7 – Current Regulatory and Other Developments for additional information regarding the special assessment. \nBrokered Deposits\nThe FDIC’s amended brokered deposits rule became effective April 1, 2021, which established a new framework for determining whether deposits made through arrangements between third parties and depository institutions constitute brokered deposits and more specifically to clarify the circumstances under which broker-dealers that place deposits with depository institutions through brokerage sweep arrangements, such as CS&Co, qualify for the “primary purpose exception” from the definition of a deposit broker. Under this framework, the FDIC established a “25 percent” business relationship designated exception where a broker-dealer or other third party may qualify for the primary purpose exception by filing a notice with the FDIC indicating that less than 25 percent of its customer assets under administration for a particular business line are placed at depository institutions. Funds swept by our broker-dealer subsidiary to Schwab’s depository institution subsidiaries and third-party banks continue to qualify for the primary purpose exception under this framework.\nIn July 2024, the FDIC issued a notice of proposed rulemaking to amend the brokered deposits framework; see Part II – Item 7 – Current Regulatory and Other Developments for additional information regarding this proposed rulemaking.\n- 9 -\nTHE CHARLES SCHWAB CORPORATION\nCommunity Reinvestment Act\nThe CRA requires the primary federal bank regulatory agency for each of Schwab’s depository institution subsidiaries to assess the subsidiary’s record in meeting the credit needs of the communities served by the bank, including low- and moderate-income neighborhoods and persons. Institutions are assigned one of four ratings (“outstanding,” “satisfactory,” “needs to improve,” or “substantial noncompliance”). The failure of an institution to receive at least a “satisfactory” rating could inhibit the institution or its holding company from undertaking certain activities, including acquisitions or opening branch offices. \nVolcker Rule \nCSC\n and its subsidiaries are subject to the Volcker Rule, which generally prohibits proprietary trading or acquiring or retaining an ownership interest in, sponsoring, or having certain relationships with hedge funds and private equity funds, subject to certain exemptions, in each case as the applicable terms are defined in the Volcker Rule and the implementing regulations. \nConsumer Financial Protection\nThe CFPB has broad rulemaking, supervisory and enforcement authority for a wide range of federal consumer protection laws relating to financial products. The CFPB has examination and primary enforcement authority over depository institutions with $10 billion or more in consolidated total assets.\nFinancial Services Regulation\nBank Secrecy Act of 1970 and USA PATRIOT Act of 2001\nCSC and its subsidiaries that conduct financial services activities are subject to the Bank Secrecy Act of 1970 (BSA), as amended by the USA PATRIOT Act of 2001, which requires financial institutions to develop and implement programs reasonably designed to achieve compliance with these regulations. The BSA and USA PATRIOT Act include a variety of monitoring, recordkeeping and reporting requirements (such as currency transaction reporting and suspicious activity reporting), as well as identity verification and client due diligence requirements which are intended to detect, report and/or prevent money laundering and the financing of terrorism. In addition, CSC and various subsidiaries of the Company are subject to U.S. sanctions programs administered by the Office of Foreign Assets Control.\nBroker-Dealer, Futures Commission Merchant (FCM), Forex Dealer Member (FDM), and Investment Advisor Regulation \nOur principal broker-dealer subsidiary, CS&Co, is registered as a broker-dealer with the U.S. Securities and Exchange Commission (SEC or Commission), the fifty states, the District of Columbia, the U.S. Virgin Islands, and the Commonwealth of Puerto Rico. CS&Co, CSIM, and certain of our other subsidiaries are registered as investment advisors with the SEC. Charles Schwab Futures and Forex LLC (CSFF) is registered as an FCM and FDM with the Commodity Futures Trading Commission (CFTC). \nMuch of the regulation of broker-dealers has been delegated to SROs. CS&Co is a member of FINRA and the Municipal Securities Rulemaking Board (MSRB). In addition, CS&Co is a member of Nasdaq Stock Market, Cboe EDGX Exchange, Inc., and MEMX LLC. In addition to the SEC, the primary regulators of CS&Co are FINRA and, for municipal securities, the MSRB. The National Futures Association (NFA) is the primary regulator for CSFF’s futures, commodities, and forex trading activities.\nThe principal purpose of regulating these entities is the protection of clients and securities markets. The regulations cover all aspects of the securities business, including, among other things, sales and trading practices, publication of research, margin lending, uses and safekeeping of clients’ funds and securities, capital adequacy, recordkeeping and reporting, fee arrangements, order flow revenue from securities exchanges and market makers, disclosure to clients, fiduciary duties, and the conduct of directors, officers, and employees.\nCS&Co is subject to Rule 15c3-1 under the Securities Exchange Act of 1934 (the Uniform Net Capital Rule) and related SRO requirements. The CFTC and NFA also impose net capital requirements. The Uniform Net Capital Rule specifies minimum capital requirements intended to ensure the general financial soundness and liquidity of broker-dealers. CSC itself is not a registered broker-dealer and it is not subject to the Uniform Net Capital Rule. \nThe Uniform Net Capital Rule prohibits broker-dealers from paying cash dividends, making unsecured advances or loans or repaying subordinated loans if such payment would result in a net capital amount of less than 5% of aggregate debit balances or \n- 10 -\nTHE CHARLES SCHWAB CORPORATION\nless than 120% of its minimum dollar requirement. See Part II – Item 8 – Note 24 for additional information regarding our net capital requirements.\nIn addition to net capital requirements, as a self-clearing broker-dealer, CS&Co is subject to cash deposit and collateral requirements with clearing houses, such as the Depository Trust & Clearing Corporation and Options Clearing Corporation, which may fluctuate significantly from time to time based upon the nature and size of clients’ trading activity and market volatility.\nThe structure and regulation of the securities markets have a significant impact on the Company’s business and operations, including its sources of net revenues. See Part II – Item 7 – Current Regulatory and Other Developments for proposed regulatory changes, including in regard to equity market structure.\nAs a result of our operations in countries outside the U.S., we are also subject to rules and regulations issued by certain foreign authorities, including the Financial Conduct Authority in the United Kingdom, the Securities and Futures Commission in Hong Kong, the Monetary Authority of Singapore in Singapore, and the Ministry of Finance in the People’s Republic of China.\nHuman Capital\n \nWe believe that hiring people who share our corporate purpose of helping clients achieve their financial goals is an essential element of executing our “Through Clients’ Eyes” strategy, and we seek to attract, retain, and motivate the talent Schwab needs to successfully serve our clients and grow our business. As of December 31, 2024, Schwab had full-time, part-time, and temporary employees, and persons employed on a contract basis, that represented the equivalent of approximately 32,100 full-time employees. \nSchwab offers a compensation package that rewards both employee and company performance. The package encompasses an array of compensation components in addition to base pay including performance-based incentive pay, equity awards, recognition awards, and a range of health and wellness benefits. We also offer benefits and resources designed to help our employees achieve their financial goals, including a 401(k) plan, an employee stock purchase plan, financial planning consultations, and disability and life insurance options. In addition, Schwab offers programs to help with employee career growth including mentorship, development, and leadership programs as well as reimbursement for qualified business-related education and training. We also encourage and empower employees to volunteer in the communities where we live and work, offering paid time off for every employee to volunteer in his or her community. The Company offers a hybrid work and flexibility approach to work arrangements that is designed to balance the importance our employees place on workplace flexibility with the benefits of in-person interactions to train and learn from one another, build human connections, and maintain Schwab’s culture as we serve our clients.\nWe seek to build a workforce with a wide range of perspectives and experiences, which supports our strategy and helps us better serve our clients. We focus on attracting highly qualified talent with varied backgrounds and perspectives by maintaining a strong employer brand and expanding where and how we meet prospective employees. For Schwab employees, we support a number of Employee Resource Groups (ERGs), which are employee-driven and provide support, leadership development opportunities, and connection. Our ERGs are open to all employees, are not limited by affiliation, and help us build an inclusive culture. Additionally, our leaders are responsible for creating an environment where all people can do their best work, and for fostering the development of high-performance teams that value the individual strengths of every employee. We regularly request feedback from our employees through surveys.\nAvailable Information\nSchwab files annual, quarterly, and current reports, proxy statements, and other information with the SEC. The SEC filings are available to the public over the internet on the SEC’s website at \nhttps://www.sec.gov\n. \nOn our website, \nhttps://www.aboutschwab.com\n, we post the following filings after they are electronically filed with or furnished to the SEC: annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934. In addition, we post to the website the Dodd-Frank stress test results, our regulatory capital disclosures based on Basel III, our average LCR, and our average NSFR.\nAll such filings are available free of charge either on our website or by request via email (\ninvestor.relations@schwab.com\n), or mail (Charles Schwab Investor Relations at 3000 Schwab Way, Westlake, TX 76262).\n- 11 -\nTHE CHARLES SCHWAB CORPORATION"
}