{
  "ticker": "AMZN",
  "cik": "0001018724",
  "company_name": "AMAZON COM INC",
  "filing_date": "2025-02-07",
  "item1_summary": " Amazon will disclose amendments to our Code of Business Conduct and Ethics, as well as waivers of the provisions thereof, on our investor relations website under the heading “Corporate Governance” at amazon.com/ir . To the extent permissible under Nasdaq rules, we intend to disclose amendments under the rules .\n The information required by Item 14 of Part III is included in our Proxy Statement relating to our 2025 Annual Meeting of Shareholders and is incorporated herein by reference . See exhibits listed under Part (b) below . The information has been omitted because the required financial statements are included in the consolidated financial statements or the notes or because it is not required .\n Amazon.com, Inc., Inc., Wells Fargo Bank, National Association, as prior trustee, and Computershare Trust Company as successor trustee . The Company’s Current Report on Form 8-K, filed November 29, 2012, is incorporated by reference to the Company's current report on Form 8-K filed April 13, 2022 .\n Amazon.com, Inc., dated as of May 12, 2021, containing Form of 0.250% Note due 2023, 0.450% Note . due 2024, Form of 1.000% Note. ote due 2050, and Form of 2.700% Note Due 2060 (incorporated by reference to the Company’s Current Report on Form 8-K, filed June 3, 2020).\n Amazon.com, Inc.  for the Year ended December 31, 2002 . The company's Insider Trading Policy is subject to an Insider Disclosure Disclosure Agreement . The agreement includes a five-year Revolving Credit Agreement, among Amazon, Inc., Citibank N.A., as administrative agent, and the lenders party thereto .\n The registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized, as of February 6, 2025 . The Company has not filed with this Annual Report on Form 10-K certain instruments defining the rights of holders of long-term debt of the Company and its subsidiaries because the total amount of securities authorized thereunder does not exceed 10 percent of the total assets .\n This Report has been signed below by the following persons on behalf of the registrant and in the capacities indicated as of February 6, 2025 . The Report was signed by Andrew R. Jassy, the President and Chief Executive Officer (P.Y. y) and the Director of the Company's Executive Committee ."
}