{
  "ticker": "DUK",
  "cik": "0001326160",
  "company_name": "Duke Energy CORP",
  "filing_date": "2025-02-27",
  "item1_summary": " Duke Energy will provide information that is responsive to the remainder of this Item 10 in its definitive proxy statement or in an amendment to this Annual Report not later than 120 days after the end of the fiscal year covered by this Report . The Compensation and People Development Committee of the Board of Directors (the Compensation Committee) maintains an equity grant policy .\n The following table shows information as of December 31, 2024, about securities to be issued upon exercise of outstanding options, warrants and rights under Duke Energy's equity compensation plans . Duke Energy has not timed the release of material non-public information for the purpose of affecting the value of any executive or director compensation, and we have no plan to do so .\n As of December 31, 2024, no options were outstanding under equity compensation plans . Includes RSUs and performance shares (assuming the maximum payout level) granted under the Duke Energy Corporation 2015 Long-Term Incentive Plan . Includes shares that could be payable with respect to certain compensation deferred under the Executive Savings Plan or the Directors' Savings Plan .\n The benefits payable under the plan are unfunded and subject to the claims of Duke Energy’s creditors . Outside directors may elect to defer all or a portion of their annual compensation, generally consisting of retainers . Participants may direct the deemed investment of their accounts among investment options available under the Duke Energy Retirement Savings Plan .\n The following tables present the Deloitte fees for services rendered to the Duke Energy Registrants during 2024 and 2023 . The tables include the fees billed, or expected to be billed, for professional services for the financial statement audits, audit of financial statements included in Duke Energy's Annual Report on Form 10-K .\n The Audit Committee of Duke Energy adopted a policy that all services provided by the independent auditor require preapproval by the Audit Committee . Pursuant to the policy, certain audit services, audit-related services, tax services and other services have been specifically preapproved up to fee limits . In the event the cost of any of these services may exceed the fee limits, the audit Committee must specifically approve the service .\n The Duke Energy Carolinas, LLC.  are omitted because they are not required, or because the required information is included in the Consolidated Financial Statements or Notes. The company's other schedules are omitted . The information is provided in this section of this section along with a summary of each other's respective respective financial statements .\n All other schedules are omitted because they are not required, or because the required information is included in the Consolidated Financial Statements or Notes . The following schedule includes that of Duke Energy Florida, Inc. (Duke Energy Florida) and Duke Energy Ohio (Ohio) and the parent company of the parent firm of the company .\n Dozens of schedules are omitted because they are not required, or because the required information is included in the Consolidated Financial Statements or Notes . Items constituting management contracts or compensatory plans or arrangements are designated by a double asterisk (**) The Company agrees to furnish upon request to the commission a copy of a copy .\n The list of items designated by a triple asterisk (***) omitted schedules or exhibits upon request on all items designated as Exhibit 2.1 to Duke Energy Corporation's Current Report on Form 8-K filed on October 26, 2015, File No. 1-32853 . The list includes: Duke Energy Carolinas, Piedmont Natural Gas Company, Duke Energy Corp. and Forest Subsidiary, Inc.\n Amended Articles of Incorporation of Duke Energy Ohio, Inc. (formerly The Cincinnati Gas & Electric Company), effective October 23, 1996, (incorporated by reference to Exhibit 3(a) to . registrant's Quarterly Report on Form 10-Q for the quarter ended September 30, 1996 . d on November 13, 2006, File No. 1-4928).\n The United States Department of Energy has not provided financial information relating to Duke Energy Progress, Inc. (formerly The Cincinnati Gas & Electric Company) Duke Energy Florida, LLC (incorporated by reference to Exhibit 3.4 to registrant's Current Report on Form 8-K filed on August 4, 2015, File No. 1-3274)\n Duke Energy Florida, LLC (incorporated by reference to Exhibit 3.5 to registrant's Current Report on Form 8-K filed on August 4, 2015, File No. 1-3274). . The company's limited Liability Company Operating Agreement of Duke Energy . LLC . Piedmont Natural Gas Company, Inc., as amended and restated effective October 3, 2016 .\n Description of Registered Securities (incorporated by reference from the registrant’s prospectus contained in Form S-3 filed on September 23, 2019, File No. 333-233896-01, under the heading \"Description of Debt Securities\"). The registrant's prospectus is included in the description of the registered securities .\n Indenture between Duke Energy Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, dated as of June 3, 2008 (incorporated by reference to Exhibit 4.1 to Duke Energy Corp.'s Current Report on Form 8-K filed on June 16, 2008, File No. 1-32853).\n nth Supplemental Indenture, dated as of August 16, 2012 (incorporated by reference to Exhibit 4.1 to Duke Energy Corporation's Current Report on Form 8-A of Duke Energy Corp. filed on January 14, 2013, File No. 1-32853) 4.8-9:8-8: 8.9-10: 9-11: 10-12: 11:12: 13:14: 14: 14; 13:13: 14.1: 14th: Thirteenth Indenture to indenture between Duke Energy .\n Fifteenth Supplemental Indenture, dated as of April 11, 2017 (incorporated by reference to Exhibit 4.2 to registrant’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2018, filed on May 9, 2017, File No. 1-32853). X.1.15: Fifteenth, Fifteenth and Twentieth Supplemental Indentures .\n Twenty-sixth Supplemental Indenture, dated as of September 28, 2021 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on June 7, 2019, File No. 1-32853). Twenty-eighth Supplemental Indentine, dated August 11, 2022, to the indenture,  between Duke Energy Corporation and The Bank of New York Mellon Trust Company, N.A., as Trustee, and forms of global notes included therein .\n The Bank of New York Mellon Trust Company, N.A., as Trustee, and forms of global notes included therein (incorporated by reference to exhibit 4.1.1 to registrant's Current Report on Form 8-K filed on December 8, 2022, File No. 1-32853).\n Duke Energy Carolinas, LLC and The Bank of New York Mellon Trust Company, N.A., as Trustee, and form of global note included therein (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on April 6, 2023, File No. 1-32853)\n Eighty-seventh Supplemental Indenture, dated as of April 14, 2008 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC’s Current Report on Form 8-K filed on January 11, 2008, File No.1-4928) Eighty fifth and eighty-eighty-eighth Indenture incorporated by reference to exhibit 4.6.9 to registrant's Registration Statement on Form S-3 filed on October 3, 2007 .\n 4.10-Eighty-eighth Supplemental Indenture, dated as of November 17, 2008 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC’s Current Report on Form 8-K filed on November 20, 2008, File No.1-4928) 4.15-6.16-9-9.16: The Bank of New York Mellon Trust Company, N.A., as Trustee .\n Fourteen-seventh Supplemental Indenture, dated as of March 11, 2016 (incorporated by reference to Exhibit 4.1 to Duke Energy Carolinas, LLC’s Current Report on Form 8-K filed on March 1, 2018, File No. 1-4928). Fourteenth and Seventeen Supplemental Indentures, dated November 17, 2017, and One Hundredth Supplemental Indances, dated January 1, 2019, respectively .\n The First and Refunding Mortgage Bonds, 2.85% Series due 2032 and 3.55% Series . due 2052 (incorporated by reference to Exhibit 4.1 to registrant’s Current Report on Form 8-K filed on March 4, 2022, File No. 1-32853). The bonds represent the First and . Refunded mortgage Bonds, . and forms of global bonds representing the . First and refunding . mortgage bonds, . 2.5% Series. due 2042 and . 3.5%. The bonds were sold by Duke Energy Carolinas, LLC. ed as of March 4 . 2022 .\n Bank of New York Mellon Trust Company, N.A., as Trustee, and a form of global bonds representing the First and Refunding Mortgage Bonds, 4.85% Series due 2034 (incorporated by reference to Exhibit 4.3 to registrant's Current Report on Form 8-K, filed on January 5, 2024, File No. 1-04928).\n Fourteenth Supplemental Indenture dated October 1, 1971 (incorporated by reference to Exhibit 2(c), File No. 2(C), File . 2-37505). X.5.11.11: Fourth Supplemental Indententine dated May 15, 1979 . X.6: Twenty-sixth, Twenty-seventh and Twenty-eighth Indenture . X 6:11: 20; 20: 20: 21: 20, 20: 25: 20 .\n Twenty-ninth Supplemental Indenture dated October 1, 1980 (incorporated by reference to Exhibit 4(b)-2, File No. 2-81299). 20th Supplemental Indentine dated December 1, 1982 . 20th, 20th and 20th Indentines were created in the 1980s .\n Forty-fifth Supplemental Indenture dated September 1, 1988 (incorporated by reference to Exhibit 4(h), File No. 33-25560). X.39                                                 referring exhibit 4(g), File . to Exhibit . 33-25460 .                                       Revenues 4(e) and 4(f) were created in 1987 .                 vanished in January 1, 1987 .\n The form of C. incorporated by reference to Exhibit 4(f) to Duke Energy Progress’ Current Report on Form 8-K dated January 19, 1994, File No. 1-3382 . The form is based on the terms of an agreement signed by the Department of Energy’s Secretary of Energy and the Secretary of State of Energy .\n arolina Power & Light Company First Mortgage Bond, 6.80% Series Due August 15, 2007 (incorporated by reference to Exhibit 4 to Duke Energy Progress’  Quarterly Report on                                   Form 10-Q for the period ended September 30, 1998, File No. 1-3382).\n Seventy-fourth Supplemental Indenture, dated as of November 1, 2005 (incorporated by reference to Exhibit 4 to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Current Report on Form 8-K filed on November 30, 2005, File No. 1-3382 .\n Fourteenth Supplemental Indenture, dated as of March 1, 2013 (incorporated by reference to Exhibit 4.1 to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company (d/b/a Progress Energy Carolinas, Inc.)) Current Report on Form 8-K filed on March 12, 2013, File No. 1-3382).\n Eighty-ninth Supplemental Indenture (incorporated by reference to Exhibit 4.82) to registrant’s Current Report on Form 8-K filed on March 7, 2019, File No. 1-3382). Eighty eighth, 90th and 90th Supplemental Indentures (for Debt Securities) between Duke Energy Progress, Inc. (formerly Carolina Power & Light Company) and The Bank of New York Mellon (successor in interest to The Chase Manhattan Bank), as Trustee .\n Indenture (for [Subordinated] Debt Securities) (open ended) (incorporated by reference to Exhibit 4(a)(2) to Duke Energy Progress, Inc.'s (formerly Carolina Power & Light Company) Registration Statement on Form S-3 filed on November 18, 2008, File No. 333-155418).\n Forty-sixth Supplemental Indenture, dated as of September 1, 2007 (incorporated by reference to Exhibit 4 to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation) Annual Report on Form 10-K for the year ended December 31, 2004, filed on March 16, 2005, File No. 1-3274).\n Forty-seventh Supplemental Indenture, dated as of December 1, 2007 (incorporated by reference to Exhibit 4 to Duke Energy Florida, Inc.'s (formerly Florida Power Corporation) Current Report on Form 8-K filed on September 19, 2007, File No. 1-3274). Forty-eighth Supplemental Indentine, dated . as of June 1, 2008, and Fifty-fifth Sup. 1, 2012 .\n Plemental Indenture, dated as of June 1, 2018 (incorporated by reference to Exhibit 4.1 to registrant's Current Report on Form 8-K filed on June 21, 2018, File No. 1-3274). X.8.18: Sixteen: Fifty-seventh, Fiftyth, Fifties, Eighty-Seventh, Sixtieth and Fiftifties Indenture . X.9: Fiftieth, Sixty-eighth, SIXTH: Financial Indenture between Duke Energy Florida, LLC and The Bank of New York Mellon, as successor Trustee .\n The Bank of New York Mellon Trust Company, National Association (successor in interest to J.P. Morgan Trust Company) as Trustee, dated as of December 7, 2005 (incorporated by reference to Exhibit 4(a) to registrant’s Current Report on Form 8-K filed on December 13, 2005, File No. 1-3274) Duke Energy Florida, Inc.'s (formerly Florida Power Corporation (d/b/a Progress Energy Florida) registration statement on Form S-3 filed on November 18, 2008, File . 333-155418). The bank's current Indenture (Unsecured Debt Securities) between Duke Energy Ohio, Inc. (formerly The Cincinnati Gas & Electric Company) and The .\n Original Indenture (First Mortgage Bonds) between Duke Energy Ohio, Inc. (formerly The Cincinnati Gas & Electric Company) and The Bank of New York Mellon Trust Company, N.A., as Successor Trustee, dated as of August 1, 1936 (incorporated by reference to an exhibit to registrant's Registration Statement No. 2-2374)\n Forty-seventh Supplemental Indenture, dated as of May 21, 2020 (incorporated by reference to Exhibit 4.12.1 to registrant's Current Report on Form 8-K filed on January 8, 2019, File No. 1-1232) Forty-eighth Supplemental Indentine, dated March 22, 2023, File 1.1 . Forty-ninth Indenture dated March 14, 2024 (File No. 13)\n Original Indenture (First Mortgage Bonds) between Duke Energy Indiana, LLC (formerly PSI Energy, Inc.) and Deutsche Bank National Trust Company, as Successor Trustee, dated as of September 1, 1939, (filed as an exhibit in File No. 70-258) Examine 4.14.1 to Duke Energy . Indiana’s Current Report on Form 8-K filed on June 15, 2006, File . 1-3543 .\n Dozens of Supplemental Indenture agreements have been issued since 1999 . The majority of the agreements were signed by Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) in 2007 and 2008 . The terms of the agreement are subject to a maximum penalty of up to $10,000 per year . The agreement was signed in 2007 .\n Fourth Supplemental Indenture, dated as of December 1, 2011 (incorporated by reference to Exhibit 4.8.17 to Duke Energy Indiana, LLC’s (formerly PSI Energy, Inc.) Registration Statement on Form S-3 filed on September 29, 2010, File No. 333-169633-02).\n Fourteen-nine Supplemental Indenture, dated as of September 27, 2019 (incorporated by reference to Exhibit 4.1 to registrant’s Current Report on Form 8-K filed on Sept. 27 , 2019, File No. 1-3543). Fourteenth-seventieth Indenture dates as of March 12, 2020; Seventy-sixth-seventh-segment Indenture dated March 1, 2024 . Duke Energy Ohio, Inc. (formerly The Cincinnati Gas & Electric Company) and The Dayton Power and Light Company .\n Inventor's Current Report on Form 8-K filed on February 27, 2001, File No. 1-15929). X.18: 4.47% Series A Senior Notes due July 16, 2027 (incorporated by reference to Exhibit 4.1 to registrant’s Current Report . 1-06196) 4.20: 20.65% Notes due 2043; 4.10% Series B Notes due . 2046: 3.64% Senior Note due 2046; 3.60% Senior Notes .\n Piedmont Natural Gas Company. mpany, Inc. and The Bank of New York Mellon Trust Company, N.A., as trustee (incorporated by reference to Exhibit 4.2 to registrant's Registration Statement on Form S-3-ASR filed on July 7, 2011, File No. 333-175386)\n Fourteenth Supplemental Indenture between Piedmont Natural Gas Company, Inc. and The Bank of New York Mellon Trust Company, N.A., as successor to Citibank.A. (incorporated by reference to Exhibit 4.1 to registrant’s Current Report on Form 8-K filed on May 13, 2022, File No. 1-6196).\n Duke Energy Corporation, Duke Energy Carolinas, LLC and the U.S. Department of Justice resolving Duke Energy's used nuclear fuel litigation against the Department of Energy, dated as of March 6, 2007 . e Bank of New York Trust Company, N.A. (incorporatized by reference to Exhibit 4.1 to registrant's Quarterly Report on Form 10-Q for the urchyQ-Q ended June 30, 2007, filed on June 8, 2007,. File No. 1-06196).\n Piedmont ACP Company, LLC and Dominion Atlantic Coast Pipeline, LLC, (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on October 7, 2016, File No. 1-06196). Piedmond Energy Company and Georgia Natural Gas Company have an assignment of membership interests .\n Duke Energy Indiana, LLC (formerly PSI Energy, Inc.) and Bechtel Power Corporation, dated as of December 15, 2008, File Nos. 1-32853 and 1-3543 . Portions of the exhibit have been omitted and filed separately with the Securities and Exchange Commission pursuant to Rule 24b-2 under the Securities Exchange Act of 1934 .\n Duke Energy Corporation Executive Officer Severance Plan (incorporated by reference to Exhibit 10.14.1**) Duke Energy Florida, Inc. and Wells Fargo Bank, National Association, as Borrowers, the lenders listed therein . Bank of America, N.A. and The Royal Bank of Scotland plc, as Co-Syndication Agents and Bank of China, New York Branch, Barclays Bank PLC, Citibank, Citiberank, Credit Suisse AG and Credit Suiss AG, Cayman Islands Branch, Industrial and Commercial Bank of . China Limited, JPMorgan Chase Bank, N., JPMorgan Chase . Chase Bank N.E. and UBS Securities LLC, as . Co-Documentation Agents, dated as of November 18, 2011 .\n Amendment No. 3 and Consent, dated as of March 16, 2017, among the registrants, the Lenders party thereto, and Wells Fargo Bank, National Association, as Administrative Agent and Swingline Lender . Duke Energy Corp., Duke Energy Carolinas, LLC, Duke Energy Ohio, Inc. Duke Energy Florida, Inc., and Piedmont Natural Gas Company, Inc, as Lenders .\n Duke Energy Corporation. .A., as Administrative Agent, and Swingline Lender (incorporated by reference to Exhibit 10.1 to registrants' Current Report on Form 8-K filed on March 17, 2020, File Nos. 1-32853, 1-4928, 1.3382, . 1-3274, and 1-6196).  X.16**.1**Amendment to Duke Energy Corp. 2015 Long-Term Incentive Plan .\n Performance Share Award Agreement (incorporated by reference to Exhibit 10.21 to registrant’s Annual Report on Form 10-K for the year ended December 31, 2022, filed on February 27, 2023, File No. 1-32853) Duke Energy Carolinas, LLC, Duke Energy Progress, LLC and The North Carolina Department of Environmental Quality, respectively, have settlements .\n The North Carolina Rate Case (incorporated by reference to Exhibit 99.1 to registrant's Current Report on Form 8-K filed on March 26, 2020, File Nos. 1-32853, 1-4928, and 1-3382) Duke Energy Corporation  adopted by and among Cinergy Corp., Duke Energy Indiana HoldCo, LLC, Duke Energy Corp. and Epson Investment PTE. LTD .\n Amended and Restated Duke Energy Corporation Executive Cash Balance Plan, dated as of January 1, 2014 (incorporated by reference to Exhibit 10.1 to registrant's Current Report on Form 8-K filed on January 13, 202- 202-5, File No. 1-32853) Duke Energy Corp. and Harry K. Sideris are listed .\n Agreement, dated as of July 30, 1981, between Duke Energy Progress, Inc. (formerly Carolina Power & Light Company) and North Carolina Eastern Municipal Power Agency Number 3 and Exhibits, together with resolution, dated . as of . December 16, 1982, to Purchase, Construction and Ownership Agreement . Duke Energy Florida (formerly Florida Power Corporation d/b/a Progress Energy Florida, Inc.) (“PEF”), Southern Natural Gas Company, Florida Gas Transmission Company (FGT) and BG LNG Services, LLC (BG)\n Duke Energy Florida, Inc. as owner, and consortium consisting of Westinghouse Electric Company LLC and Stone & Webster, Inc., as contractor, for a two-unit AP1000 Nuclear Power Plant . (Portions of the exhibit have been omitted and filed separately with the Securities and Exchange Commission pursuant to a request for confidential treatment pursuant to Rule 24b-2 under the Securities Exchange Act of 1934, as amended.)\n Duke Energy Corporation 2017 Director Compensation Program Summary (incorporated by reference to Exhibit 10.3 to Duke Energy Corp.’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2017, filed on August 3, 2017 . ort on Form 8-K filed on February 24, 2022, File No. 1-32853).\n Duke Energy SAM, LLC, Duke Energy Ohio, Inc., Duke Energy Commercial Enterprise, Inc. and Dynegy Resource I, LLC (incorporated by reference to Exhibit 10.61 to Duke Energy Corporation's Annual Report on Form 10-K for the year ended December 31, 2014, filed on March 2, 2015, File No. 1-32853).\n Duke Energy International Group S.à.r.l. and China Three Gorges (Luxembourg) Energy Sà.l., dated as of October 10, 2016 (incorporated by reference to Exhibit 2.2.1 to . registrant's Current Report on Form 8-K filed on October 13, 2016, File No. 1-32853).\n The Bank of Nova Scotia, as Administrative Agent, PNC Bank, N.A., Sumitomo Mitsui Banking Corporation, and TD Bank as Co-Syndication Agents . Wells Fargo Bank, National Association, as . Administrative Agent and Swingline Lender and Wells Fargo Securities, LLC, as Joint Lead Arranger, Joint Bookrunner and Sustainability Structuring Agent. that increases the amount of the credit facility from $8B to $9B (incorporated by reference to Exhibit 10.1 to registrant’s Current Report on Form 8-K filed on May 16, 2019, File No. 1-32853).\n Duke Energy Florida, LLC, as Borrower, the lenders listed therein, Truist Bank, as . Administrative Agent, and PNC Bank, N.A., as Administrative Agent . Duke Energy's borrowing of the remaining $500 million under . registrant's existing $1 billion revolving credit facility on March 17, 2020 (incorporated by reference to Exhibit 10.1 to registrant’s Current Report on Form 8-K filed on October 21, 2022, File No. 1-3274, 1.1232, 1-3543, and 1-6196).\n Piedmont Natural Gas Company, Inc.  Agreement, dated as of March 9, 2022 (incorporated by reference to Exhibit 10.2 to registrant's Quarterly Report of Form 10-Q for the quarter ended March 31, 2023, filed on May 9, 20 23, File Nos. 1-32853, . 1-4928, 1-3382, and 1-3274, .1-1232, and  1-3543, respectively . Agreement, signed by and among Williams Partners Operating LLC and Cabot Pipeline Holdings LLC, dated April 9, 2012, by and . among . and among Constitution Pipeline Company, LLC .\n Second Amended and Restated Limited Liability Company Agreement of SouthStar Energy Services LLC, dated as of September 1, 2013, by and between Georgia Natural Gas Company and Piedmont Energy Company . Duke Energy Indiana Holdco, LLC (incorporated by reference to Exhibit 10.1 to registrants' Current Report on Form 8-K filed on September 8, 2021, File Nos. 1-32853, 1-03543).\n The company filed a lease agreement with CGA 525 South Tryon TIC 1, LLC, a Delaware limited liability company, and CK 525 South TIC 2, LLC . Duke Energy Corporation and Barclays Capital, Inc., BofA Securities, Inc. and Credit Suisse Securities (USA) LLC, acting as sales agents, have an Equity Distribution Agreement, dated November 10, 2022 .\n Duke Energy Corporation Securities Trading Policy, as amended May 9, 2024. t on Form 8-K, filed on November 10, 2022, File No. 1-32853 (X.1.2) Duke Energy Corp. Securities Trading . Policy is based on Duke Energy’s Securities . Trading Policy .\n The Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 . The CFO is a member of the Board of Standards of Standards and Quality Control (CQC) The COCOO is a non-member of the CQC. ficer . CQCCO is an independent body of the board of standards and procedures .\n The Duke Energy Corporation Clawback Policy does not appear in the Interactive Data File because it's XBRL tags are embedded within the Inline Inline document . Duke Energy's Clawback policy is described as 'guarded' and 'guilty' by the company . The policy has been described as \"guilty\" and \"guarded\" by the public .\n The total amount of securities of each respective registrant or its subsidiaries authorized under any instrument with respect to long-term debt not filed as an exhibit does not exceed 10% of the total assets of such registrant and its subsidiaries . Each registrant agrees, upon request of the SEC, to furnish copies of any or all of such instruments to it .\n The report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated . The registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized . The undersigned does hereby sign this document on behalf of each of the above-named persons .\n This report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated . The registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized . LYNN J. Good is the Chief Executive Officer of the Registrant DUKE ENERGY PROGRESS, LLC.\n This report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated . The registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized . The report was signed on February 27, 2025 by LYNN J. Good, the Chief Executive Officer (Principal Executive Officer) and the Chief Accounting Officer (Chief Accounting Officer)\n This report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated . The registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized . R. Alexander Glenn is the current chairman of the company .\n The report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated . The registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized . The report was signed on February 27, 2025 by PIEDMONT NATURAL GAS COMPANY, INC."
}